[
	{
		"title": "Apple 2024 MacBook Pro Laptop with M4 Pro, 12-core CPU, 16-core GPU: Built for Apple Intelligence, 14.2-inch Liquid Retina XDR Display, 24GB Unified Memory, 512GB SSD Storage; Space Black",
		"product_id": "B0DLHY2BJ6",
		"price": "$1690.05",
		"image_url": "https://m.media-amazon.com/images/I/61-oTP1X4rL._AC_UY218_.jpg",
		"product_url": "https://www.amazon.com/Apple-MacBook-Laptop-12-core-16-core/dp/B0DLHY2BJ6/ref=sr_1_1?dib=eyJ2IjoiMSJ9.SiTN0uy0qE9ctdc3d0GhSGUrLHcqgvRzKkPsoG_B5kO-I3Rf2NhYUPfx6HzBUed2_Yy29THsFzs7btwr6aBlHcVqa7G3pktKCuUwdzb2_kD_PQHTCq_TV5KegiEnOoofyYWbyAPlhqwjk1qOFhXRZtsw64vj7EbYvbB2LE2EYZ-f2yH_5Y78SrpsJlxHLtbyp_VGwA-rFhGxCV0AmA2ue9S5DEIBJyaoqct6ChLswjw.nPfzNWCzg6P1jw-mFwYXnbZdPwXUcajGGeyzc-1_o98&dib_tag=se&keywords=apple+laptop&qid=1748244131&refinements=p_123%3A110955&sr=8-1",
		"average_rating": "4.8 out of 5 stars",
		"review_count": "799 global ratings",
		"histogram": {
			"5_star": "91%",
			"4_star": "5%",
			"3_star": "2%",
			"1_star": "2%"
		},
		"histogram_reviews_to_scrape": {
			"5_star": 9,
			"4_star": 0,
			"3_star": 0,
			"1_star": 0
		},
		"review": [
			{
				"reviewer_name": "Garrett Wiley",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 12, 2025",
				"review_text": "This is my very first Apple device, my initial thoughts are:I am very impressed by the hardware of this device. Specifically:- A quick CPU benchmark placed this at around 90% of my desktops performance (Ryzen 9 9800X3D). For a laptop, that is absolutely unheard of.- The battery seems to last forever, even with semi-intensive workloads. At one point I used it for an hour and still had 97% battery.- The display is incredible. The contrast, resolution, and refresh rate combined make this about the best I've seen.- The webcam is high quality.- The MagSafe charger is very niceIn general, Macs don't support as much software as Windows. In my case, it does support everything I would need a laptop for, but it is something to keep in mind.However, because Apple has their own OS, hardware, etc, the software experience is far more tailored to the device than Windows devices are. As an example, the webcam settings are very easy to use and access.The device itself is very light and thin, it was a little smaller than I expected, ordering the 14 inch one, but I don't have any issues with it.In conclusion: This is a premium laptop, for a premium price - designed with ease of use and workloads in mind."
			},
			{
				"reviewer_name": "Enan Chediak",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 9, 2025",
				"review_text": "This computer has been really reliable. I use it for editing photographs, and I feel like I can really rely on it to perform and to show my images with detail and consistency. The battery life has been wonderful compared to the Windows PC I had before. I've only had it for about 3 months, but I'm already really happy with it."
			},
			{
				"reviewer_name": "DC-User",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 2, 2025",
				"review_text": "this is a great little computer.  It replaces a 16\" 2019 MacBook Pro with the old Intel chips.  The 2019 Mac developed a cooling problem which would have cost $600 to repair,  I chose to trade it in for a new Mac running the Apple chip.Apple gave me a $320 credit toward a new machine but I noticed that Amazon was selling MacBooks for $250 less than the Apple store so I will apply the credit to buy a new iPhone.I initially considered getting a new 16\" MacBookPro but they cost about $400 more and are heavier than the 14\" machine.  So far the smaller screen is adequate.Moving my data over to the new machine was seamless using Time Machine and an external backup disk.  However, I had some problems with getting my existing version of Acrobat Pro 2020 to transfer over."
			},
			{
				"reviewer_name": "IJM-CR",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 21, 2025",
				"review_text": "Ha sido una muy buena inversin, adems de que el producto me lleg pronto y con una entrega rpida y segura.  Muy satisfecho con el servicio de AMAZON en esta compra."
			},
			{
				"reviewer_name": "INNA IATSENKO",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 16, 2025",
				"review_text": "Im really happy with this laptop  I got it for an exceptionally good price 1509, and it performs even better than I expected. Definitely a great value for the money!"
			},
			{
				"reviewer_name": "Amazon Customer",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 18, 2025",
				"review_text": "Listen, this laptop is expensive and it's a significant investment. I understand that, but this MacBook with the M4 chip runs incredibly smooth. I can run Adobe Premiere and Lightroom without any issues. I have yet to encounter the dreaded spinning wheel of death. I've never had a laptop that operates so well while rendering 4K videos, this MacBook handles any task in Adobe software as if it were simply enjoying a slice of pie after Thanksgiving. Once you get accustomed to macOS, this laptop transforms the way you work in the most positive way possible."
			},
			{
				"reviewer_name": "Ryan Barker",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 23, 2025",
				"review_text": "This laptop is superb, likely the best on the market.The screen is beautiful and perfect for watching media. The battery life is practically endless, I never worry about running out of power. The speakers are clear and very deep for a laptop. The touchpad and keyboard are both high quality.It has weight in a good way, it feels solid and sturdy without being heavy. Very happy with this purchase."
			},
			{
				"reviewer_name": "Julie C",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 21, 2025",
				"review_text": "Bought this as a gift for my husband, he had an M1 Macbook Air for the longest time.He said that the power was really noticeable, of course it is heavier than his Macbook Air, but not overly heavy since I didn't choose the largest screen.I believe that the design and color has been around and hasn't changed.It's what you can expect from Apple, an amazingly beautiful and functional laptop."
			},
			{
				"reviewer_name": "Alazo",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 12, 2025",
				"review_text": "The 2024 MacBook Pro is a powerhouse for video editing.  Its a bit small I should have gotten the bigger one. And its very easy to store away."
			}
		],
		"review_summary": "The laptop offers exceptional performance, impressive battery life, and a high-quality display, making it a premium choice for users seeking reliability and power in their computing experience.",
		"review_sentiments": {
			"pos_5_aspects": [
				"BATTERY",
				"PERFORMANCE",
				"DISPLAY",
				"PORTABILITY",
				"PRICE",
				"PERFORMANCE",
				"BATTERY",
				"PORTABILITY",
				"PRICE",
				"PERFORMANCE",
				"PERFORMANCE",
				"BATTERY",
				"DISPLAY",
				"AUDIO",
				"BUILD_QUALITY",
				"DESIGN",
				"PERFORMANCE",
				"PORTABILITY"
			],
			"neg_5_aspects": [],
			"pos_4_aspects": [],
			"neg_4_aspects": [],
			"pos_3_aspects": [],
			"neg_3_aspects": [],
			"pos_2_aspects": [],
			"neg_2_aspects": [],
			"pos_1_aspects": [],
			"neg_1_aspects": []
		}
	},
	{
		"title": "Apple 2024 MacBook Air 13-inch Laptop with M3 chip: Built for Apple Intelligence, 13.6-inch Liquid Retina Display, 16GB Unified Memory, 256GB SSD Storage, Backlit Keyboard, Touch ID; Space Gray",
		"product_id": "B0DLHTTWVB",
		"price": "$899.00",
		"image_url": "https://m.media-amazon.com/images/I/711xdPNfEhL._AC_UY218_.jpg",
		"product_url": "https://www.amazon.com/Apple-2024-MacBook-13-inch-Laptop/dp/B0DLHTTWVB/ref=sr_1_2?dib=eyJ2IjoiMSJ9.SiTN0uy0qE9ctdc3d0GhSGUrLHcqgvRzKkPsoG_B5kO-I3Rf2NhYUPfx6HzBUed2_Yy29THsFzs7btwr6aBlHcVqa7G3pktKCuUwdzb2_kD_PQHTCq_TV5KegiEnOoofyYWbyAPlhqwjk1qOFhXRZtsw64vj7EbYvbB2LE2EYZ-f2yH_5Y78SrpsJlxHLtbyp_VGwA-rFhGxCV0AmA2ue9S5DEIBJyaoqct6ChLswjw.nPfzNWCzg6P1jw-mFwYXnbZdPwXUcajGGeyzc-1_o98&dib_tag=se&keywords=apple+laptop&qid=1748244131&refinements=p_123%3A110955&sr=8-2",
		"average_rating": "4.7 out of 5 stars",
		"review_count": "1,438 global ratings",
		"histogram": {
			"5_star": "88%",
			"4_star": "6%",
			"3_star": "2%",
			"1_star": "4%"
		},
		"histogram_reviews_to_scrape": {
			"5_star": 9,
			"4_star": 1,
			"3_star": 0,
			"1_star": 0
		},
		"review": [
			{
				"reviewer_name": "uuarcpsx",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on March 3, 2025",
				"review_text": "This is now my second Macbook I've owned. My first was the touchbar 2017 Macbook Pro, and that pales in comparison to this. As I've grown older, I have less of a need to use the processing power from the Pro models, and just need something light to carry around and do 90% of my work. This laptop is that, and so much more.I've been using this laptop very frequently for a little over two months now, and I'm in love with pretty much everything about it. I'm amazed at how light it is, while still feeling so, so premium. The metal curves around the screen and body feel so high quality when you graze your finger across them. One of the major gripes I had about my last Macbook was the keyboard -- the touchbar model keyboard was awful. The keys had a habit of failing occasionally. The new Macbook keyboards? Actually a keyboard now. Clicky and feel robust, a joy to type on! (which is something I thought I'd never say about a laptop keyboard)I am not a power user, I do not use this laptop for heavy rendering or 3D graphics. I do not game on this laptop. I have a desktop in my office for those things. This handles what I actually use a laptop for really, really well. I love that I can go to a coffee shop with this thing, pull it out of my bag, and instantly open up to my 15 open tabs from my previous session and continue to keep working. The speed is insane, and there are no hitches. The battery life also is incredible. Big fan of the braided cable that comes with this. At the moment, I can get a few days of heavy browsing use out of this, which coming from my old pro model that would die in less than an hour on battery with the same workload, is nothing short of a miracle to me. Praise the M series chips!The screen quality is super sharp too, I'm sure it's the same or similar screen to my old Pro model, but the bezels make up for it. Sure, it may not have Promotion, or whatever the Apple term for 120hz is nowdays, but I personally don't mind it, and don't notice it. Again, this is not a poweruser device.So, at the moment, this is an incredible deal on a laptop. I wish this was around when I was shopping for laptops in college, because this would have been a no brainer. Will this laptop handle the test of time with its great battery life and fast speeds? Only time will tell us, but at the moment, it's worth investing in."
			},
			{
				"reviewer_name": "Kristy Neil",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 26, 2025",
				"review_text": "I have only had it for a few days but I will say this. I am highly satisfied. I ordered a couple laptops about a year or so ago and ended up paying for the return because I just wasn't sold on them. I am sure they could have been great laptops for the budget at the time. It just wasn't what I was looking for. I found this Mac here a couple hundred dollars cheaper here and went back and forth if I should stick with apple and be safe. I am glad I saved myself a little bit of money and took the risk. It's exactly what I needed for work and school. I also misplaced my iPhone couple days ago and thought someone stole it for sure. I was able to pull the phone up here that I have mirrored answer calls text and emails I had received. Also locate the phone, that was thankfully turned in my a Good Samaritan. Thank you amazon for saving me some money."
			},
			{
				"reviewer_name": "Chandu",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 21, 2025",
				"review_text": "The 2025 MacBook Air M3 (13-inch) is an absolute beast in a sleek package. Coming from an older Intel-based model, the speed jump is massive. Everything feels instant  app launches, multitasking, and even editing large files.Battery life? Stellar. Easily gets me through 1012 hours of work and content creation without reaching for the charger. The display is crisp and vibrant, and the keyboard + trackpad combo remains the best in the game.Its whisper-quiet, cool, and the form factor is ideal for travel or working from anywhere. If youre thinking about upgrading, this ones a future-proof win."
			},
			{
				"reviewer_name": "Angela Roberts",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on March 26, 2025",
				"review_text": "I am so happy with my MacBook Air 2024 M3 chip computer. I had a MacBook Air 2017 computer before this one. This computer is definitely an improvement.I like the redesign of the materials used in this computer. It does not feel as flimsy or like its going to bend. The only thing I miss is the USB ports being on different sides of the MacBook. It is hard to plug in to USB-C devices into both of the ports because they are so close together on one side. Other than that, I am extremely happy.I would recommend you purchasing the AppleCare plus through Apple itself as you will be able to pay either annually or monthly for the protection. Paying on Amazon is a rip off.Even though this MacBook is fanless, I would still recommend sitting it on a cooling pad as to prevent it from overheating. Ive not had any issues with overheating, just a recommendation to not take the fact that it has no fans and is advertised as not needing a fan for granted."
			},
			{
				"reviewer_name": "Sly",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 22, 2025",
				"review_text": "Got this one for my daughter whos in nursing school they take a whole lot of notes with their iPads and do beyond normal amounts of research she absolutely loves it. "
			},
			{
				"reviewer_name": "RBO",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 9, 2025",
				"review_text": "Ive always liked MacBooks, and this is no exception. I opted for the M3 with higher memory, and was not disappointed.However, I really missed using my old iPad, so I gave this one to a family member (arent I nice?) and ordered myself a 13 iPad Air + keyboard which I really love."
			},
			{
				"reviewer_name": "Jeffrey Vaughn",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 23, 2025",
				"review_text": "Its Apple. It works and its light. Screen is beautiful and this makes running through airports easier."
			},
			{
				"reviewer_name": "KENNETH M KRAUS",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 19, 2025",
				"review_text": "Another great Apple solution.  Fast and accurate delivery as well.  Thank you for a great customer experience."
			},
			{
				"reviewer_name": "Slayermike Fishing and More - Youtube",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 13, 2025",
				"review_text": "Mac works great fast service great price and value for money"
			},
			{
				"reviewer_name": "P Jo",
				"star_rating": "4.0 out of 5 stars",
				"review_date": "Reviewed in the United States on October 18, 2024",
				"review_text": "When my beloved iPad Pro started rejecting its Smart Keyboard, I started looking for a replacement device - after replacing the Smart Keyboard. I did a lot of research and decided that a MacBook Air might suit my needs better since the keyboard for the iPad Pro was the source of my problems with it. I thought since the MacBook Air is in the Apple family, and since I also have an iPhone,  that the MacBook Air would work seamlessly and synch up with both the other Apple devices with no problems. Silly, silly me.The adjustment has been great because I have not used an actual laptop in years and have never used a Mac machine of any kind. I have read that it may take a couple of months to adjust so I am really trying to love it.Not being a tech person, I thought it might be helpful to others who are considering this purchase to share my thoughts.What I like: The MacBook Air is very thin and beautiful. (Thinner is always better, right?) The action of the keyboard is stellar - so smooth! - and the resolution of the screen is sharp and clear. I am able to share pictures and videos across all three Apple devices, which is why I chose the MacBook. The battery lasts for days, which is super impressive.What I don't like: The devices do not synch up as seamlessly as I thought they would. I am sure it is due to my inexperience with Mac laptops, but I would have thought it would all have been automatic with entry of my Apple ID and password. For me, the learning curve seems fairly steep, but it is because I haven't used a laptop of any kind in years (I've used only my iPad Pro) and have never used a MacBook at all.I am already happy with the purchase since the keyboard doesn't keep disconnecting like on my iPad Pro, making it necessary to utter profanities and throw the keyboard in the floor. (Not that I've ever done either of those things.) So I think it is going to be a good fit for me once I adjust to the fact that it is a laptop and not an Ipad and stop touching the screen!"
			}
		],
		"review_summary": "The laptop offers excellent performance, impressive battery life, and a high-quality design, making it a highly satisfying choice for everyday tasks and casual use.",
		"review_sentiments": {
			"pos_5_aspects": [
				"BATTERY",
				"BUILD_QUALITY",
				"DESIGN",
				"PERFORMANCE",
				"PORTABILITY",
				"PRICE",
				"PRICE",
				"PERFORMANCE",
				"BATTERY",
				"DISPLAY",
				"PERFORMANCE",
				"PORTABILITY",
				"BUILD_QUALITY",
				"DESIGN",
				"PERFORMANCE",
				"PORTABILITY",
				"DISPLAY",
				"PRICE"
			],
			"neg_5_aspects": [],
			"pos_4_aspects": ["DESIGN", "BUILD_QUALITY", "DISPLAY", "BATTERY"],
			"neg_4_aspects": [],
			"pos_3_aspects": [],
			"neg_3_aspects": [],
			"pos_2_aspects": [],
			"neg_2_aspects": [],
			"pos_1_aspects": [],
			"neg_1_aspects": []
		}
	},
	{
		"title": "Late 2019 Apple MacBook Pro with 2.6GHz Intel Core i7 (16-Inch, 16GB RAM, 512GB Storage) - Silver (Renewed)",
		"product_id": "B08CZT64VP",
		"price": "$399.00",
		"image_url": "https://m.media-amazon.com/images/I/619L9jf3-rL._AC_UY218_.jpg",
		"product_url": "https://www.amazon.com/Apple-MacBook-16-Inch-Storage-2-6GHz/dp/B08CZT64VP/ref=sr_1_3?dib=eyJ2IjoiMSJ9.SiTN0uy0qE9ctdc3d0GhSGUrLHcqgvRzKkPsoG_B5kO-I3Rf2NhYUPfx6HzBUed2_Yy29THsFzs7btwr6aBlHcVqa7G3pktKCuUwdzb2_kD_PQHTCq_TV5KegiEnOoofyYWbyAPlhqwjk1qOFhXRZtsw64vj7EbYvbB2LE2EYZ-f2yH_5Y78SrpsJlxHLtbyp_VGwA-rFhGxCV0AmA2ue9S5DEIBJyaoqct6ChLswjw.nPfzNWCzg6P1jw-mFwYXnbZdPwXUcajGGeyzc-1_o98&dib_tag=se&keywords=apple+laptop&qid=1748244131&refinements=p_123%3A110955&sr=8-3",
		"average_rating": "4.1 out of 5 stars",
		"review_count": "220 global ratings",
		"histogram": {
			"5_star": "64%",
			"4_star": "14%",
			"3_star": "7%",
			"2_star": "3%",
			"1_star": "12%"
		},
		"histogram_reviews_to_scrape": {
			"5_star": 6,
			"4_star": 1,
			"3_star": 1,
			"2_star": 0,
			"1_star": 1
		},
		"review": [
			{
				"reviewer_name": "Genesis",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 22, 2025",
				"review_text": "Llego en muy buenas condiciones. Sper amplia y el color hermoso. A mi esposo le gusto este regalo"
			},
			{
				"reviewer_name": "Xavier F.",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 29, 2025",
				"review_text": "Great computer "
			},
			{
				"reviewer_name": "Rose",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 3, 2025",
				"review_text": "Was definitely skeptical about buying a refurbished unit on Amazon but it ended up being great. Works great for the value & being a 2019 computer."
			},
			{
				"reviewer_name": "juliana pratt",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 19, 2025",
				"review_text": "Muy buenas condiciones"
			},
			{
				"reviewer_name": "Nadelis Brown",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on March 29, 2025",
				"review_text": "Me encant est sper buena"
			},
			{
				"reviewer_name": "Madelin Chaves Umaa",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on March 16, 2025",
				"review_text": "El producto traa un defecto fsico muy pequeo pero no afecta en nada el funcionamiento del equipo."
			},
			{
				"reviewer_name": "Jos Madrigal",
				"star_rating": "4.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 16, 2025",
				"review_text": "Todo funciona bien"
			},
			{
				"reviewer_name": "Amazon Customer",
				"star_rating": "3.0 out of 5 stars",
				"review_date": "Reviewed in the United States on February 2, 2025",
				"review_text": "So far, the product is pretty good."
			},
			{
				"reviewer_name": "Phantomofproductions",
				"star_rating": "1.0 out of 5 stars",
				"review_date": "Reviewed in the United States on March 29, 2025",
				"review_text": "This was the worst electronic purchases that I have ever made. There has been one issue after another with this machine. The battery doesn't present as charging a lot of times. At times there is typing that happens when I have not typed anything. The machine's fans run hot many times. At the login screen, my password is not accepted and I then have to go through recovery mode to do a reset. Getting work done on tis machine has proven to be quite difficult."
			}
		],
		"review_summary": "The laptop has received mixed reviews, with many praising its condition and value, while others report significant issues affecting its performance and usability.",
		"review_sentiments": {
			"pos_5_aspects": ["PRICE"],
			"neg_5_aspects": [],
			"pos_4_aspects": [],
			"neg_4_aspects": [],
			"pos_3_aspects": ["BUILD_QUALITY"],
			"neg_3_aspects": [],
			"pos_2_aspects": [],
			"neg_2_aspects": ["BATTERY"],
			"pos_1_aspects": [],
			"neg_1_aspects": ["PERFORMANCE", "BUILD_QUALITY"]
		}
	},
	{
		"title": "Apple MacBook Pro 256GB Wi-Fi Laptop 13.3in with Intel Core i5 MF840LL/A - Silver (Renewed)",
		"product_id": "B01B1YYKSG",
		"price": "$222.99",
		"image_url": "https://m.media-amazon.com/images/I/81vs5TXBrlL._AC_UY218_.jpg",
		"product_url": "https://www.amazon.com/Apple-MacBook-256GB-Laptop-MF840LL/dp/B01B1YYKSG/ref=sr_1_4?dib=eyJ2IjoiMSJ9.SiTN0uy0qE9ctdc3d0GhSGUrLHcqgvRzKkPsoG_B5kO-I3Rf2NhYUPfx6HzBUed2_Yy29THsFzs7btwr6aBlHcVqa7G3pktKCuUwdzb2_kD_PQHTCq_TV5KegiEnOoofyYWbyAPlhqwjk1qOFhXRZtsw64vj7EbYvbB2LE2EYZ-f2yH_5Y78SrpsJlxHLtbyp_VGwA-rFhGxCV0AmA2ue9S5DEIBJyaoqct6ChLswjw.nPfzNWCzg6P1jw-mFwYXnbZdPwXUcajGGeyzc-1_o98&dib_tag=se&keywords=apple+laptop&qid=1748244131&refinements=p_123%3A110955&sr=8-4",
		"average_rating": "3.8 out of 5 stars",
		"review_count": "955 global ratings",
		"histogram": {
			"5_star": "58%",
			"4_star": "13%",
			"3_star": "6%",
			"2_star": "3%",
			"1_star": "20%"
		},
		"histogram_reviews_to_scrape": {
			"5_star": 6,
			"4_star": 1,
			"3_star": 1,
			"2_star": 0,
			"1_star": 2
		},
		"review": [
			{
				"reviewer_name": "Alexi",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on October 14, 2024",
				"review_text": "It came free with a shell in a nice black color, it boots and runs well and has a decent battery life. I actually like that it's limited in what it can run, but that's just me, because it is mostly for writing and working. I have found ways to install older Mac writing and presentation software for my job. The highest priority was that it can open and run the latest version of QLab, which it does effortlessly. It also runs a few other theatrical programs I need to.Pros:Works well, good battery life, and boots easilyDistraction free work environment, and light weight to take anywhereHDMI port installed rather than needing connection for HDMIUSB Hubs all work as intended.Great inexpensive way to get a Mac for exclusive software like QLabCons:The OS is kneecapped by apple, by design, and there's not really a work around.Charging cable is super shortA little slow running anything, largely due to ageOverall, I highly enjoy my silly little laptop. It's kind of charming and goofy, and a good introduction to Apple for a PC user. After all, if I mess it up, I just wipe it and start again. Runs the basic software I need without much extra. Travels well, and provides me a 2 computer setup for when I need to run lights and sound for an event. I really am glad these renewed options exist for purchase. However, don't think it will run everything under the sun, it won't, but if you know that going in... It'll be just fine, and perfectly serviceable."
			},
			{
				"reviewer_name": "Barb",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 5, 2021",
				"review_text": "Received my Macbook Pro a day early than expected. I wanted to wait to write a review so I could make sure that it worked well. My old job gave me a 2020 Macbook air and I loved working on it. I did not want to spend that much money, so I researched at found out that a lot of people who do a lot of creative stuff online like the 2015 Macbook pro, and I see why!- Keyboard is awesome. Lights up.- Battery Life isn't bad, having that I had an old 2011 HP laptop that I used for my undergrad and its shot.- Has all outlets you need to upload media (New versions require you to buy an extension to use USB, HDMI and does not have a headphone jack, not that I'm going to use it anyways)- This laptop does NOT have an outlet for a CD or DVD.- This laptop does NOT come with Windows, Adobe, or anything. Just basic apps from Apple.- The screen is just as bright and beautiful as the 2020 Macbook Air that I used for work.- Doesn't over heat. Haven't had any issues since receiving it.The laptop did have some small marks on it, but it looks like it'll come off with a Clorox wipe.**I did see a few people have issues with having their keyboard cover ruining the laptop screen, so I will be getting a screen protector, keyboard cover and a case for my laptop just so I won't ruin it.Great laptop for school and work."
			},
			{
				"reviewer_name": "Amazon Customer",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on February 14, 2025",
				"review_text": "I purchased this Mac Book for my son and he absolutely loved it. Great quality and very fast! I would purchase again!!!!!!!"
			},
			{
				"reviewer_name": "Aaliyah",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on October 11, 2024",
				"review_text": "This was a gift . there are three choices for good acceptable or excellent condition I did choose to get one in excellent Condition And there was barely a scratch on the MacBook I forgot to take pictures but in very good condition.(edited after I bought second one to add pictures) Did come in Russian the first time. But easy fix with Google translate picture. Quality was great charger worked fine loved the price. Just ordered one for myself :)"
			},
			{
				"reviewer_name": "Ryan Lester",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on August 24, 2019",
				"review_text": "Until yesterday, my daily driver was a 2013 13\" MBP with 8 GB RAM. I'd been considering having the screen replaced because of some annoying scratches, until I realized that for an extra ~$100 I could just pick this up instead  a total steal by comparison*.Swapping my 2 TB SSD (OCW Aura Pro X2) into this was quick and easy; also threw in a BaseQi adapter with a 256 GB microSD for good measure, and based on past experience immediately applied a screen protector (https://smile.amazon.com/gp/aw/d/B077C5S97T). Now it's about equivalent to a current high-end MBP, except actually better because the keyboard is great.Cons:* There's a small dent in the aluminum near the logo. (Can't really complain since it's replacing a machine that had its fair share of minor scratches and dents.)* I had to clean it up a bit (peel off some stickers, clean the screen, and Clorox wipe the body to get rid of sticky residues).Overall, this is a pretty sweet deal. I'm almost surprised that these things aren't demanding a premium over current-gen models, so getting them at a fraction of what they were four years ago is awesome.*: For that little bit of extra money, now I have double the RAM, a modest spec bump across the board, Force Touch, less worn out keycaps, and a (much needed) backup computer; most importantly I didn't have to stop working and wait for my computer to be repaired."
			},
			{
				"reviewer_name": "Unknown",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on December 4, 2024",
				"review_text": "Bought for my son in college. His other MacBook had a screen crack and it was suggested to buy refurbished rather than fix screen. Delivered on time. Was easy to set up. Came with charger. Have not had any issues. Would recommend to go this route rather than paying same amount for screen replacement only."
			},
			{
				"reviewer_name": "Bparris",
				"star_rating": "4.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 10, 2025",
				"review_text": ""
			},
			{
				"reviewer_name": "Taylor",
				"star_rating": "3.0 out of 5 stars",
				"review_date": "Reviewed in the United States on January 16, 2025",
				"review_text": "The amount of maintenance I had to do on my own when I got this laptop was so unserious. It came in a cardboard box with a sheet of bubble wrap and was halfway out the wrap when I got it so I had to start with a quick inspection to make sure everything was okay and its not, one of the brightness keys is gonna need to be fixed. I had to switch the language from Spanish, remove 30+ bluetooth devices that were saved, and update it to the newest IOS to get it to do ANYTHING. Be so for real."
			},
			{
				"reviewer_name": "Hapa",
				"star_rating": "1.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 2, 2025",
				"review_text": "Does not hold charge. Very very disappointed.  Bought this for my daughter as a gift. She isnt able to use it for school because she constantly needs to plug it in for her to use."
			},
			{
				"reviewer_name": "Pyro",
				"star_rating": "1.0 out of 5 stars",
				"review_date": "Reviewed in the United States on March 27, 2025",
				"review_text": "The speakers are blown. It over heats when its on the charger and when its not charging it dies in 10 minutes and Ive received no help from Amazon regarding this issue. All of the MacBooks come out dated and cant be updated unless you take it to someone and have them do it. Stay away from Amazon MacBooks!"
			}
		],
		"review_summary": "The laptop is appreciated for its decent performance and battery life, making it suitable for writing and basic creative tasks, although some users report issues with charging, overheating, and limited software compatibility.",
		"review_sentiments": {
			"pos_5_aspects": [
				"BATTERY",
				"PERFORMANCE",
				"PORTABILITY",
				"BATTERY",
				"BUILD_QUALITY",
				"DESIGN",
				"DISPLAY",
				"PERFORMANCE",
				"PORTABILITY",
				"BUILD_QUALITY",
				"PERFORMANCE",
				"PRICE",
				"BUILD_QUALITY",
				"PERFORMANCE",
				"PORTABILITY",
				"PRICE",
				"PORTABILITY",
				"PRICE"
			],
			"neg_5_aspects": [],
			"pos_4_aspects": [],
			"neg_4_aspects": [],
			"pos_3_aspects": [],
			"neg_3_aspects": ["BUILD_QUALITY"],
			"pos_2_aspects": [],
			"neg_2_aspects": [],
			"pos_1_aspects": [],
			"neg_1_aspects": ["BATTERY", "AUDIO", "BATTERY", "BUILD_QUALITY"]
		}
	},
	{
		"title": "Late-2018 Apple MacBook Air with Core i5 (13-inch, 8GB RAM, 256GB) (QWERTY English) Gold (Renewed)",
		"product_id": "B07KGJ3Z8H",
		"price": "$300.00",
		"image_url": "https://m.media-amazon.com/images/I/51FJlZmqO8L._AC_UY218_.jpg",
		"product_url": "https://www.amazon.com/Apple-MacBook-13-inch-Display-Dual-core/dp/B07KGJ3Z8H/ref=sr_1_6?dib=eyJ2IjoiMSJ9.SiTN0uy0qE9ctdc3d0GhSGUrLHcqgvRzKkPsoG_B5kO-I3Rf2NhYUPfx6HzBUed2_Yy29THsFzs7btwr6aBlHcVqa7G3pktKCuUwdzb2_kD_PQHTCq_TV5KegiEnOoofyYWbyAPlhqwjk1qOFhXRZtsw64vj7EbYvbB2LE2EYZ-f2yH_5Y78SrpsJlxHLtbyp_VGwA-rFhGxCV0AmA2ue9S5DEIBJyaoqct6ChLswjw.nPfzNWCzg6P1jw-mFwYXnbZdPwXUcajGGeyzc-1_o98&dib_tag=se&keywords=apple+laptop&qid=1748244131&refinements=p_123%3A110955&sr=8-6",
		"average_rating": "3.9 out of 5 stars",
		"review_count": "2,756 global ratings",
		"histogram": {
			"5_star": "61%",
			"4_star": "12%",
			"3_star": "6%",
			"2_star": "4%",
			"1_star": "17%"
		},
		"histogram_reviews_to_scrape": {
			"5_star": 6,
			"4_star": 1,
			"3_star": 1,
			"2_star": 0,
			"1_star": 2
		},
		"review": [
			{
				"reviewer_name": "Bayyinnah Drones",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 22, 2025",
				"review_text": "I was beyond scared and nervous about this purchase due to some of the bad reviews , BUT mine came literally perfect !! NO scratches , NO dents, NO sticker marks , NO nothing & all the keys work as well !!!! It did come dead and the only problem is the charger ( port that goes in the wall) does not fit inside my outlet  I have to prop my mirror up against it just for it to stay in and charge . Honestly for me if thats the biggest problem Im good with it !!!! Im so happy with it  I most definitely will update if anything start going wrong tho"
			},
			{
				"reviewer_name": "Calli",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 10, 2025",
				"review_text": "It came super fast and its cute so far the battery has only go a down 1% sense Ive had it and its been all day the size is perfect its a little heavier then i thought but over all its a pretty good MacBook especially for it bing 18"
			},
			{
				"reviewer_name": "Anyia",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 18, 2025",
				"review_text": "Perfect! Youll never guess I bought a used MacBook, not one scratch or dent. Came with the charger and block too"
			},
			{
				"reviewer_name": "Carter Kastli",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 16, 2025",
				"review_text": "Received in great condition I don't see any scratches and works great!"
			},
			{
				"reviewer_name": "Portia Asante",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 18, 2025",
				"review_text": "The laptop looks good and it's working great"
			},
			{
				"reviewer_name": "Andres rosales",
				"star_rating": "5.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 13, 2025",
				"review_text": "Was worried it wasnt going to work but its amazing and. Works excellently"
			},
			{
				"reviewer_name": "Best for comfort and fit",
				"star_rating": "4.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 25, 2025",
				"review_text": "I purchased it in good condition for $50 less.  T appeared to be perfect, upon its unpackingbut after inspection more closely; I was able to notice a few imperfections.  It was rated very well and the $50 savings was identifiable.  If you are looking for a machine that appears flawlessI highly recommend purchasing the advertised product, ranked excellent.  It is worth the money and its nice to have a used machine in perfect condition."
			},
			{
				"reviewer_name": "Nathenial Crow",
				"star_rating": "3.0 out of 5 stars",
				"review_date": "Reviewed in the United States on April 2, 2025",
				"review_text": "I never used a Mac before, so I chose to buy this one instead of shelling out a bunch of money for one. The build of this is amazing! It's light weight and its comfortable to have sitting on my lap. The screen gets pretty bright, almost as bright as a flashlight. The sound is pretty loud. However, there are somethings I don't like about this. It's an Intel Mac, so it gets hot VERY QUICKLY. It tends to slow down at worst times. And the latest version of MacOS. The settings is all over the place. So for Ease of use, you're going to spend a long time in the settings trying to find the right thing."
			},
			{
				"reviewer_name": "warchildnyc",
				"star_rating": "1.0 out of 5 stars",
				"review_date": "Reviewed in the United States on August 21, 2024",
				"review_text": "I have bought refurbished/renewed electronics, for myself and others, from Amazon and other places for years and never had a problem until this transaction. This product was described by the seller as \"Renewed - Excellent\" but was in Poor condition.The laptop had three very visible scratches on the outside cover, with additional scratches on the Apple logo. Worse yet, the backlit keyboard had MAJOR defects as 4 keys (A, S, E and D) had the letters completely worn off (and were illuminated as unreadable white blobs). Worse yet, a sticker had been haphazardly placed over the top of the D key. Not only was the sticker not even centered on the key, but a sticker on a key of a backlit keyboard disables the backlight functionality for that key.  Horrible. I have owned a lot of computers over the years and have never experienced keys wearing off on a keyboard. This thing was either abused or defective from the start. I have two laptops that I use to run my business. Both bought refurbished or used (without being refurbished) and both have been great for multiple years and still have no physical defects despite a lot of travel and heavy use.Overall, VERY disappointing and deserves a 1-star review, only because I cannot give it a zero.I received a return authorization and will be sending it back for a refund. This disappointing experience also resulted in my daughter not having a computer for her first day of high school orientation.  Im buying another one from a different seller today, so at least she will have it for the first day of class next week.There should be some sort of quality control process for allowing sellers to market renewed products under the Amazon name. Maybe there is and this one just slipped through the cracks.Update as of 9/10/24, I have still not received my refund or any communication from Amazon or the seller."
			},
			{
				"reviewer_name": "jessica montoya",
				"star_rating": "1.0 out of 5 stars",
				"review_date": "Reviewed in the United States on May 21, 2025",
				"review_text": ""
			}
		],
		"review_summary": "The laptop generally receives positive reviews for its condition and performance, though there are some instances of significant defects in refurbished models and issues with usability.",
		"review_sentiments": {
			"pos_5_aspects": [
				"BUILD_QUALITY",
				"PORTABILITY",
				"BATTERY",
				"PORTABILITY",
				"DESIGN",
				"PERFORMANCE"
			],
			"neg_5_aspects": ["BUILD_QUALITY"],
			"pos_4_aspects": [
				"PRICE",
				"BUILD_QUALITY",
				"PORTABILITY",
				"DISPLAY",
				"AUDIO"
			],
			"neg_4_aspects": ["PERFORMANCE"],
			"pos_3_aspects": [],
			"neg_3_aspects": [],
			"pos_2_aspects": [],
			"neg_2_aspects": [],
			"pos_1_aspects": [],
			"neg_1_aspects": []
		}
	}
]
