[
    {
        "title": "Late 2019 Apple MacBook Pro with 2.6GHz Intel Core i7 (16-Inch, 16GB RAM, 512GB Storage) - Silver (Renewed)",
        "product_id": "B08CZT64VP",
        "price": "$829.00",
        "image_url": "https://m.media-amazon.com/images/I/619L9jf3-rL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Apple-MacBook-16-Inch-Storage-2-6GHz/dp/B08CZT64VP/ref=sr_1_1?dib=eyJ2IjoiMSJ9.sJijff5UO7JQ2SfX_lZPADYovWLssz-RWmzUtr6gmts44pMpzdjL8yeY20-rTS36CH8AZkCVvuWvEFWQwixWAPcS3WwaSMDaEsEDmLaUQ2kzwnKy8zIlOWu3lRJRM16OxyvMzorIMziU_xLwvtZ5UhhZhEdqHldJX7zThufn5DEUdNplVJmJjXM-PQVGi7FP8fWnOnfT6dm5Qh9O51-i8kLbpyx78-liFOB-E8FWRv4.PtwsRyiaC6jfMwsPomMP9MQq4fSo99M4W8mroQnOePg&dib_tag=se&keywords=apple+laptop&qid=1742568494&refinements=p_123%3A110955&sr=8-1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "194 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "13%",
            "3_star": "8%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Gforce7",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 17, 2025",
                "review_text": "Good machinePurchased prior to the release of the M chip set I should have waited for the (M) chip set."
            },
            {
                "reviewer_name": "Gypsyfox",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 29, 2024",
                "review_text": "This was the first factory refurbished computer I have ever bought and I was extremely happy with its appearance and performance!"
            },
            {
                "reviewer_name": "Emmanuel",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 17, 2025",
                "review_text": "Realmente soy estudiante de Multimedia, lo cual requiero el uso constante de programas pesados como de la familia de Adobe, Maya, Capcut etc etc y para ver películas o escuchar música muy muy cómodo y fácil."
            },
            {
                "reviewer_name": "Valinda Rungpiti",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 31, 2024",
                "review_text": "Excellent condition! I love it so much, Minimal scratches overall best bang for ur buck"
            },
            {
                "reviewer_name": "Good",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 12, 2025",
                "review_text": "Excellent"
            },
            {
                "reviewer_name": "Jonathan  Simon",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on July 13, 2024",
                "review_text": "Received item exactly as described. For the price this is still a great value in 2024. Little to no scratches or blemishes on the exterior and the screen is flawless. The battery on this model can handle up to 1000 battery cycles. The one i received still has over 600 plus cycles left on the battery. This model is also still supported on the new MacOs Sequoia coming fall 2024 so you can expect support and updates for this model to continue through 2025-2026 hopefully."
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 17, 2025",
                "review_text": "I've had this used laptop for 4 months by now and it has worked great so far so I am happy with the purchase. However, by month 3 the USB adapter and the charging cable that came with the order (not made by Apple) were not charging correctly.  I had to buy new ones and opted to get them directly from Apple and they work perfect. The USB adapter that came with the laptop was overheating since the first time I used it."
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 2, 2025",
                "review_text": "So far, the product is pretty good."
            },
            {
                "reviewer_name": "Phillip D.",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on September 14, 2024",
                "review_text": "I was excited to get this macbook. its in perfect condition. The day I got it, I charged it up and everything was going great. Then, the charger quit working. To the sellers credit, they sent me a new one. This was awesome, but then the computer was also overheating. I charged the computer to full and timed how long it would take the battery to go to 0. it took less than 4 hours. I notified the seller who used the excuse that the low battery life is due to it being a refurbished model. This was a very poor excuse and a lie. No where in the description does it say that the battery life would be less because its a refurb. On the contrary, its says the battery life should be an average of 10 hours and says nothing else. Refurb means that it should be like new with the possible exception of cosmetic. So what the seller is saying is a lie."
            }
        ],
        "review_summary": "The laptop is generally praised for its condition and performance, but some buyers have experienced issues with the charger, overheating, and battery life, particularly regarding expectations for refurbished models.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PERFORMANCE",
                "DESIGN",
                "PERFORMANCE",
                "AUDIO",
                "PRICE",
                "PRICE",
                "BATTERY",
                "BUILD_QUALITY",
                "DISPLAY"
            ],
            "neg_5_aspects": [
                "PERFORMANCE"
            ],
            "pos_4_aspects": [
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "BATTERY"
            ],
            "pos_3_aspects": [
                "PERFORMANCE"
            ],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [
                "BATTERY"
            ],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BATTERY",
                "PERFORMANCE"
            ]
        }
    },
    {
        "title": "Apple MacBook Air (13-inch Retina display, 1.6GHz dual-core Intel Core i5, 128GB) - Gold (Renewed)",
        "product_id": "B07NPTXDK7",
        "price": "$299.00",
        "image_url": "https://m.media-amazon.com/images/I/71thf1SYnGL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Apple-MacBook-13-inch-display-dual-core/dp/B07NPTXDK7/ref=sr_1_2?dib=eyJ2IjoiMSJ9.sJijff5UO7JQ2SfX_lZPADYovWLssz-RWmzUtr6gmts44pMpzdjL8yeY20-rTS36CH8AZkCVvuWvEFWQwixWAPcS3WwaSMDaEsEDmLaUQ2kzwnKy8zIlOWu3lRJRM16OxyvMzorIMziU_xLwvtZ5UhhZhEdqHldJX7zThufn5DEUdNplVJmJjXM-PQVGi7FP8fWnOnfT6dm5Qh9O51-i8kLbpyx78-liFOB-E8FWRv4.PtwsRyiaC6jfMwsPomMP9MQq4fSo99M4W8mroQnOePg&dib_tag=se&keywords=apple+laptop&qid=1742568494&refinements=p_123%3A110955&sr=8-2",
        "average_rating": "3.9 out of 5 stars",
        "review_count": "2,772 global ratings",
        "histogram": {
            "5_star": "60%",
            "4_star": "12%",
            "3_star": "7%",
            "2_star": "4%",
            "1_star": "17%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 2
        },
        "review": [
            {
                "reviewer_name": "Julie K",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 30, 2024",
                "review_text": "So, I bought this on a total whim, when my trusted macbook of 13 years suddenly went haywire and I needed one for work. I spent about 2 minutes looking for options; and settled on this one since the price was low and I liked the color. I half expected it to show up disheveled with ample signs of wear and tear. However, to my delight, the thing looked brand new. Felt brand new. I still can't tell the difference.  A few weeks in, and I love this thing so much. It's light and cute, and works wonderfully. I am so happy with my purchase and even happier I didn't spend thousands on a new one, when this one is just as good!"
            },
            {
                "reviewer_name": "Isaac Zapata",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "A few scuffs and scratches but works just fine is just a little slow but that may be a wifi problem."
            },
            {
                "reviewer_name": "Nûra Sullivan",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 12, 2025",
                "review_text": "It came within one day, fully charged and with a brand new charger. It started up right away and looks brand new besides very minor scuffs. I love it & would highly recommend. It has given me 0 issues"
            },
            {
                "reviewer_name": "Luke",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 16, 2024",
                "review_text": "The MacBook Air was shipped promptly and arrived in excellent visual condition. The speed and performance of the computer have been good, and the trackpad functions perfectly. While the battery life isn’t perfect, it’s what I would expect for a refurbished unit of this age. We encountered some issues with the keyboard, but the company has been very responsive and willing to address our concerns. I spoke with David, who was friendly and easy to work with."
            },
            {
                "reviewer_name": "Genna",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 13, 2025",
                "review_text": "Good, love the color. Works great"
            },
            {
                "reviewer_name": "Brooke's Mama",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "Purchased for a friend it works great!"
            },
            {
                "reviewer_name": "Zamyia",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 25, 2024",
                "review_text": "Laptop came in good condition! It had little scuffs on them & scratches on the front but I just covered it with stickers its really not a big issue, the apple logo was clean, no scratches or scuffs, charger works well! Its fast! The battery was at a normality, its okay not the best battery in the world but I can’t complain! Its basically a brand new macbook"
            },
            {
                "reviewer_name": "PRL Anee",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 16, 2025",
                "review_text": "Used MacBook I bought works. Runs smooth. However, charging port is definitely broken, so it chimes every 2 minutes, and the battery life sucks. Probably was sent knowing so. For the price and what I use it for (my daughter’s first laptop) it’s ok. Wouldn’t get for myself. The noise while it’s charging would drive me insane."
            },
            {
                "reviewer_name": "warchildnyc",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on August 21, 2024",
                "review_text": "I have bought refurbished/renewed electronics, for myself and others, from Amazon and other places for years and never had a problem until this transaction. This product was described by the seller as \"Renewed - Excellent\" but was in Poor condition.The laptop had three very visible scratches on the outside cover, with additional scratches on the Apple logo. Worse yet, the backlit keyboard had MAJOR defects as 4 keys (A, S, E and D) had the letters completely worn off (and were illuminated as unreadable white blobs). Worse yet, a sticker had been haphazardly placed over the top of the D key. Not only was the sticker not even centered on the key, but a sticker on a key of a backlit keyboard disables the backlight functionality for that key.  Horrible. I have owned a lot of computers over the years and have never experienced keys wearing off on a keyboard. This thing was either abused or defective from the start. I have two laptops that I use to run my business. Both bought refurbished or used (without being refurbished) and both have been great for multiple years and still have no physical defects despite a lot of travel and heavy use.Overall, VERY disappointing and deserves a 1-star review, only because I cannot give it a zero.I received a return authorization and will be sending it back for a refund. This disappointing experience also resulted in my daughter not having a computer for her first day of high school orientation.  I’m buying another one from a different seller today, so at least she will have it for the first day of class next week.There should be some sort of quality control process for allowing sellers to market renewed products under the Amazon name. Maybe there is and this one just slipped through the cracks.Update as of 9/10/24, I have still not received my refund or any communication from Amazon or the seller."
            },
            {
                "reviewer_name": "Harleigh wade",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 9, 2024",
                "review_text": "I am severely disappointed and upset, I spent my graduation money on this macbook to have for college. I trusted this company to give me a laptop that was atleast functional. For the first part it was, just a little slow. After a few times of me using it, The macbook would over heat, and not cool off properly. When I looked into the edges, I could see the inside WAS NOT cleaned properly, and I was correct when I happened to open the back of it up. It became very slow, and to the point of nothing working and I couldn’t even do a software update to fix the slow issue.I purchased this on September 11, 2023. I am not in college yet, so I have not used it much. Probably barely even 10 times. I had the macbook in a bookbag with a box of crayola markers everytime I was not using it, and when I was using it, I NEVER set anything on the macbook, and dropped it. I have no idea how the lines ended up on my screen. I went to use the macbook after a charged it overnight, and leaving it on a table and I discovered the black lines. I was left clueless.I cleaned the inside of the macbook with q-tips, and both ends on all of them are completely black. I am SO disappointed. I advise anyone who buys this product, PLEASE check all of the functions of it as soon as you get it, and even open the inside of it if you can. I expected better from amazon."
            }
        ],
        "review_summary": "The laptop has received mixed reviews, with many users praising its good condition, performance, and value for money, while others experienced significant issues such as cosmetic damage, slow performance, and functional defects.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "PORTABILITY",
                "BUILD_QUALITY",
                "DESIGN",
                "PERFORMANCE"
            ],
            "neg_5_aspects": [
                "PERFORMANCE",
                "BUILD_QUALITY",
                "DISPLAY"
            ],
            "pos_4_aspects": [
                "BATTERY",
                "BUILD_QUALITY",
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "BATTERY"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "BATTERY",
                "PRICE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY",
                "DESIGN"
            ]
        }
    },
    {
        "title": "Apple MacBook Air 2022 Laptop with Apple M2 chip (13.6-inch, 8GB RAM, 256GB SSD Storage) Midnight (Renewed)",
        "product_id": "B0BHC15G32",
        "price": "$1,049.00",
        "image_url": "https://m.media-amazon.com/images/I/61upJ6FlFLL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Apple-MacBook-13-6-inch-Storage-Midnight/dp/B0BHC15G32/ref=sr_1_3?dib=eyJ2IjoiMSJ9.sJijff5UO7JQ2SfX_lZPADYovWLssz-RWmzUtr6gmts44pMpzdjL8yeY20-rTS36CH8AZkCVvuWvEFWQwixWAPcS3WwaSMDaEsEDmLaUQ2kzwnKy8zIlOWu3lRJRM16OxyvMzorIMziU_xLwvtZ5UhhZhEdqHldJX7zThufn5DEUdNplVJmJjXM-PQVGi7FP8fWnOnfT6dm5Qh9O51-i8kLbpyx78-liFOB-E8FWRv4.PtwsRyiaC6jfMwsPomMP9MQq4fSo99M4W8mroQnOePg&dib_tag=se&keywords=apple+laptop&qid=1742568494&refinements=p_123%3A110955&sr=8-3",
        "average_rating": "4.4 out of 5 stars",
        "review_count": "583 global ratings",
        "histogram": {
            "5_star": "79%",
            "4_star": "7%",
            "3_star": "2%",
            "2_star": "1%",
            "1_star": "11%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 8,
            "4_star": 1,
            "3_star": 0,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Keiniyah walker",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 12, 2025",
                "review_text": "It’s works great!!! Feels brand new I love that it came in with the original box and a real Apple charger. There’s not dents or scratches"
            },
            {
                "reviewer_name": "Kelly Buehler",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 1, 2024",
                "review_text": "I originally ordered this item to be delivered at an Amazon Locker location & after I got notified that it was ready to be picked up, I came to the locker and found it was empty. Had to call their customer service to get a replacement ordered and this time delivered to my house. Amazon definitely provided great customer service on the replacement as well as the product itself. No scratches anywhere. It wasn’t charged when I got it so make sure you already have a type c charger as I did. So far I really like this MacAir as it’s my first Mac computer I’ve ever bought. It’s easy to navigate software wise and very lightweight(as expected). Speed is good on it as it’s only 2 years old. Very good buy for the price."
            },
            {
                "reviewer_name": "Mateo Tello",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 4, 2025",
                "review_text": "Everything Ok, worth it.The only problem is the charger is not the original one. It came with 98% battery condition."
            },
            {
                "reviewer_name": "Sonia Ante",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 13, 2025",
                "review_text": "Happy Gal ! Arrived early ! Works great so far. Great condition, very pleased. Came with apple certified charger mag safe .. everything works ! Happy with this purchase!"
            },
            {
                "reviewer_name": "stephanie",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 6, 2025",
                "review_text": "good quality, wrong charger but still charges, a little dirty but still really good quality for the price"
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 8, 2025",
                "review_text": "This item shipped and arrived to me  within one day. I’m truly satisfied with how fast it got to me. The item is in good shape and looks grand new. I’m loving it so far."
            },
            {
                "reviewer_name": "Roland Lee Calzadilla",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 15, 2025",
                "review_text": "Sobrepasó mis espectativas que gran excelencia q buen servicio, rapidez de envio y sobre todo asombrado con la perfección en cuidado de mi producto. Sin dudas recomendado 100%"
            },
            {
                "reviewer_name": "Tyler E Lee",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Laptop came just as expected. After two other attempts I was finally able to get a great product at a fair price."
            },
            {
                "reviewer_name": "B. ritch",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 26, 2025",
                "review_text": "So far the Mac book is as advertised. The charger that came with it is not a mag safe charger like the description stated. It charges slowly but it charges to full. The delivery was a couple of days early and I had to scramble to get someone to sign for it since I was at work and missed the first delivery attempt. Overall think it was a good purchase. Cheaper than new and a well functioning machine. It was well cared for before I bought it, or it seems to have been."
            },
            {
                "reviewer_name": "Trace M.",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "Bought refurbished for my daughter and the laptop had an issue from the start.  After some troubleshooting I was able to get the unit working but within a week it stopped again.  We took it to the Apple Store and it turned out the laptop was brought in for this issue last August and the fix will be around $650.00.  Last time we order refurbished.  Also, came with the wrong power supply."
            }
        ],
        "review_summary": "The laptop generally receives positive feedback for good condition and functionality, but there are concerns about shipping issues, improper chargers, and occasional hidden defects in refurbished units.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PORTABILITY",
                "PRICE",
                "PERFORMANCE",
                "BATTERY",
                "BUILD_QUALITY",
                "PRICE",
                "PRICE"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PRICE",
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "BATTERY"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "PERFORMANCE",
                "BATTERY",
                "PRICE"
            ]
        }
    }
]