[
    {
        "title": "Dell Inspiron Touchscreen Laptop, 15.6\" Business & Student Laptop Computer, Windows 11 Pro Laptop 32GB RAM 1TB SSD, Intel i5-1155G7 Processor, Full HD IPS Display, Numeric Keypad, HDMI, Carbon Black",
        "product_id": "B0CTPCTW66",
        "price": "$543.00",
        "image_url": "https://m.media-amazon.com/images/I/61Wc1fDGJuL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Dell-Inspiron-Touchscreen-i5-1155G7-Processor/dp/B0CTPCTW66/ref=sr_1_1?dib=eyJ2IjoiMSJ9.-lRFAy6jN5tE2HvJoRmhAZ-fs1m3UCQ1OHfrq9xJ901si04MCGdB1Zd11PkXqpMs0bY20CgjWTiA5p9ND17jPmoCUoxwEsqdsy-0wZfLqTZE6p0BU0BcUVYjq0JKVKDmcBQ9Nn0482kAYVwK-UPmnAFBJZ808Fhx97pAs-3tP94LUEAaW25lB2osMqHnVp6QtMp-Nhg2GNctW8KYJCBnNzyAfDoyJdmhFUIXTyfcwy0.lc9eP29JSyMN--IFjyALNU0YafutTCGx83xbSzS2DZ8&dib_tag=se&keywords=dell+laptop&qid=1742568201&refinements=p_123%3A241862&sr=8-1",
        "average_rating": "4.3 out of 5 stars",
        "review_count": "296 global ratings",
        "histogram": {
            "5_star": "67%",
            "4_star": "16%",
            "3_star": "6%",
            "2_star": "2%",
            "1_star": "9%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "TJ",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 16, 2025",
                "review_text": "I bought the 40GB RAM with 2TB and I love it.  Fairly easy to set up, speed is awesome, very light weight, battery life is pretty good.  I would highly recommend this as a great deal for the price."
            },
            {
                "reviewer_name": "Sayne",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 14, 2025",
                "review_text": "The product has exceeded expectations. It was easy to setup and works very well.Battery Life is excellent and picture quality great"
            },
            {
                "reviewer_name": "Michael Nolan",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 13, 2025",
                "review_text": "Excellent laptop! Fast and convenient. I couldn't ask for a better computer. The Windows 11 is a bit different from the W 10 I have been used to, but after a short time I have found it to be better and seemingly simpler in some ways."
            },
            {
                "reviewer_name": "Old JW",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "I am enjoying this new computer. It is much quicker than my previous computer and it has many more features for me to use and enjoy. It was priced right and delivered as promised."
            },
            {
                "reviewer_name": "Angel A. O. Ortiz",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 26, 2025",
                "review_text": "A great price for a 40 GB Ram and 2 TB memory. Great for all purposes, business, trading, emulators, Google meet and all features."
            },
            {
                "reviewer_name": "Dale",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 12, 2025",
                "review_text": "Nice Dell Laptop with allthe features."
            },
            {
                "reviewer_name": "Eric",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 16, 2025",
                "review_text": "My is 50 years old and went back to school for her masters degree and she swears it’s the best for school ,easy to understand ,easy use and simply  awesome for old people. Lol she just loves it so much better than her Mac."
            },
            {
                "reviewer_name": "AnMo917",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 1, 2025",
                "review_text": "Ease of use for high school or college student. It's light weight and a nice resolution touch screen. The 15.6 inch screen size is perfect it's not too big or too small. Not the best graphics card but not bad if used for simple videos or zoom. Great work laptop."
            },
            {
                "reviewer_name": "Distribuidora Sula Industrial S. de R.L",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 19, 2025",
                "review_text": "Me gustó mucho, lo único que no tiene luz el teclado, de allí con todo lo demás muy bien, estéticamente muy bonita y liviana"
            },
            {
                "reviewer_name": "Smiles005",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "WATCH OUT EVERYONE!!!Amazon's practice of listing and selling products like Dell computers for third party sellers seems like a scam, since the third party seller can sell old products on Amazon where the warranty is already expired or almost so. And I saw nothing on AMAZON's site when I bought the DELL computer that things like an expired or limited time warranty could be an issue when buying ON AMAZON from a third party seller.Bought this Dell computer on Amazon, February 24, 2025, delivered just a couple days ago and today on March 4, 2025 I checked the WARRANTY which only had less than 6 months LEFT. Dell said the AMAZON third party seller resold the computer on AMAZON months after it bought the computer, and the warranty began to run earlier when the third party seller bought the computer. Not when I purchased the computer on Amazon! This should not be HAPPENING. I contacted the Company and they said nothing was wrong!It came saying the last time it had been updated was August 18th and took the entire first day to get up to date.In regards to the Computer, it runs super fast. It has a battery that dies really quickly which is why I was checking the warranty. The Power in this computer dies so fast and the fans are always running. It the touch screen is nice and it seems to have a good quality. The Sound is pretty good after it is updated. It seems to have more durability than most computers but time will tell."
            },
            {
                "reviewer_name": "Thomas Going",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 9, 2025",
                "review_text": "BUYER BEWARE OF DELL, AMAZON AND THIRD PARTY SELLERS ON AMAZON.  And extended warranty company Asurion.Amazon's  practice of listing and selling products like Dell computers for third party sellers seems like a scam, since the third party seller can sell old products on Amazon where the warranty is already expired or almost so.  And I saw nothing on AMAZON's site when I bought the DELL computer that things like an expired or limited time warranty could be an issue when buying ON AMAZON from a third party seller.Bought this Dell computer on Amazon, July 16, 2024, and Jan.3, 2025 the screen separated from the cover.  Contacted Dell, and they advised the WARRANTY was EXPIRED!  That's less than 6 months.  Dell said the AMAZON third party seller resold the computer on AMAZON months after it bought the computer, and the warranty began to run earlier when the third party seller bought the computer. Not when I purchased the computer on Amazon!Spent hours on the phone with Dell, and they know about this issue with third party sellers.  Even after providing them with the Amazon invoice and receipt of when I took possession of the computer, they would not help me and apply and run the warranty to the date I bought the computer from Amazon.Amazon's rep basically said sorry, but that's my problem for buying from a third party seller. Say what?  I bought the computer on AMAZON and paid AMAZON.  Now I'm out of luck?To make matters worse, I bought an extended warranty on Amazon from Asurion on the same day I bought the Dell computer on Amazon.  When I tried to make a claim, Asurion auto responded that the Dell computer still has the manufactures warranty and to contact Dell, seemingly as a result of only having purchased the computer from Amazon in July.  And not taking into account that the warranty started to run when the third party seller bought the computer months earlier.Shame on Dell, Amazon, and Asurion."
            }
        ],
        "review_summary": "The laptop generally receives positive feedback for its performance, ease of use, and features, although there are significant concerns about warranty issues when purchased through third-party sellers on Amazon.",
        "review_sentiments": {
            "pos_5_aspects": [
                "BATTERY",
                "PRICE",
                "PERFORMANCE",
                "PORTABILITY",
                "BATTERY",
                "DISPLAY",
                "PERFORMANCE",
                "PERFORMANCE",
                "PRICE",
                "PRICE",
                "PERFORMANCE",
                "PERFORMANCE",
                "PORTABILITY"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PORTABILITY",
                "DISPLAY",
                "DESIGN",
                "PORTABILITY",
                "BUILD_QUALITY",
                "DISPLAY",
                "AUDIO"
            ],
            "neg_4_aspects": [
                "BUILD_QUALITY",
                "BATTERY"
            ],
            "pos_3_aspects": [
                "PERFORMANCE"
            ],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY",
                "WARRANTY",
                "PERFORMANCE"
            ]
        }
    },
    {
        "title": "Dell Latitude 7420 FHD Laptop Notebook with Intel Core i7 11th Gen Processor (16GB Ram, 512GB SSD, WiFi, Bluetooth) Windows 11 Pro - Carbon Fiber (Renewed)",
        "product_id": "B09WXZV2T2",
        "price": "$399.99",
        "image_url": "https://m.media-amazon.com/images/I/61VRqYjVIvL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Dell-Latitude-7420-Processor-Bluetooth/dp/B09WXZV2T2/ref=sr_1_2?dib=eyJ2IjoiMSJ9.-lRFAy6jN5tE2HvJoRmhAZ-fs1m3UCQ1OHfrq9xJ901si04MCGdB1Zd11PkXqpMs0bY20CgjWTiA5p9ND17jPmoCUoxwEsqdsy-0wZfLqTZE6p0BU0BcUVYjq0JKVKDmcBQ9Nn0482kAYVwK-UPmnAFBJZ808Fhx97pAs-3tP94LUEAaW25lB2osMqHnVp6QtMp-Nhg2GNctW8KYJCBnNzyAfDoyJdmhFUIXTyfcwy0.lc9eP29JSyMN--IFjyALNU0YafutTCGx83xbSzS2DZ8&dib_tag=se&keywords=dell+laptop&qid=1742568201&refinements=p_123%3A241862&sr=8-2",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "100 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "17%",
            "3_star": "3%",
            "2_star": "6%",
            "1_star": "8%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 0,
            "2_star": 1,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Greg Becker",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 19, 2025",
                "review_text": "I purchased this as a dedicated laptop for crafting with Xtool.  Though I did end up adding an external monitor as the screen is small when designing, it works great for running my M1 Utlra Xtool machine.  I probably wouldn't use it for other computer tasks as I am a computer geek by trade and prefer something with more power, memory, storage, etc.  But as a dedicated craft use computer, nice as it isn't expensive and gets the job done effectively!"
            },
            {
                "reviewer_name": "John A",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 23, 2025",
                "review_text": "This item was in perfect condition, just like it was described on the Amazon site. Thank you for the care and attention to details, it is truly appreciated."
            },
            {
                "reviewer_name": "Mitchell Fisher",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 18, 2025",
                "review_text": "These laptops are fast, lightweight and workhorses! You can’t go wrong with the Latitude series. For the price, you can’t beat it. The processing speed gets the job done, the battery life is great (the efficient processor allows for longer battery life). The form factor is small, which makes it easy to travel with. The keyboard is solid and allows me to type quickly."
            },
            {
                "reviewer_name": "Mark MAC",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Very pleased with this computer that I received.  It functions exactly as expected.  No issues at all."
            },
            {
                "reviewer_name": "Lisa Sparacino",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "I am in the tech field, so I knew that this had the specs I wanted.  I had read other reviews and saw that many were happy, some complained about the condition.  Well I want to say that the condition of this was excellent-  if I didn't know better I would have thought it was new.  It was basically ready to use- just turned it on, answered a few questions and I was up and running.  No scratches or dings.  The only issue I see is that the magnet does not engage easily on closing- so you have to take care to close it gently a couple of times to have it engage.  This is not really a problem unless you run out of battery.  But you should always be aware of that, anyway.  Also-  received it in 1 day!  Even though it was scheduled to come in 3 days!  Very happy that I paid 1/4 of what I paid for my last laptop and so far I like it better!!!"
            },
            {
                "reviewer_name": "Dale & Patti",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 8, 2025",
                "review_text": "Bought this laptop for my consulting business and it’s perfect for my needs. I had a Dell and had the docking station and monitors, so wanted to keep the Dell. Unfortunately, the motherboard needed replacing which was going to cost as much as a new Dell. When I bought this ‘renewed’ Dell I was expecting to get something that looked used. This laptop turned out to be better than what I had, for a third of the cost of a new one!"
            },
            {
                "reviewer_name": "erick",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 9, 2025",
                "review_text": "Excelente , 100% recomendable"
            },
            {
                "reviewer_name": "McSwizzle",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 10, 2025",
                "review_text": "Carbon fiber was covered by a black \"sticker\" skin- not an issue. Battery life isn't the greatest, but everything else seems to be okay."
            },
            {
                "reviewer_name": "Sandra",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 14, 2025",
                "review_text": "Love that it is a touch screen! Do not like how any laptop battery does not hold."
            },
            {
                "reviewer_name": "Kendra",
                "star_rating": "2.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 6, 2025",
                "review_text": "It's been a bit of a saga. I got one of these refurbished laptops a couple of months ago. I first noticed it's poor battery life (<2 hours with light web browsing) and customer support was quick to mail me a new battery I could install. Before the battery arrived I noticed it also had a cracked frame. Again, customer service was prompt to send me a replacement laptop. When I had the same problem with battery life, even a little worse (90 minutes total), they told me they were sure it met their refurbished standards for a laptop in \"excellent\" condition before it left their warehouse. I promise it did not. It was also missing 5 different drivers when it arrived that I had to install through Dell Support. I have little faith in their quality checks. Now that I've installed those drivers, and received the replacement laptop that thankfully doesn't have a cracked frame, my main complaint is battery life. I think they owe me a replacement battery. 90 minutes is ridiculous. If you're reading this, please respond!"
            },
            {
                "reviewer_name": "trubadore",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 28, 2024",
                "review_text": "Had to take the computer to the DELL site to be worked on.  The old owner was still set up in the system.  Now the warranty work cannot commence on the device.  Vendor would not provide information or attempt to provide a statisfactory reply.  DELL will not work on Laptop.  Vendor says, we provide a two month warrenty.  We do not care about your problem. Reply showed that they do not care about their customers.  Amazon would not listen to me.  No more Laptops or computers will be bought through the Amazon Website by me and I suggest anyone else who is looking for a laptop go somewhere else."
            }
        ],
        "review_summary": "The laptop is generally praised for its performance, lightweight design, and value, though some users have reported issues with battery life and customer service experiences.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PORTABILITY",
                "PRICE",
                "PERFORMANCE",
                "PRICE",
                "PERFORMANCE",
                "BATTERY",
                "PORTABILITY",
                "BUILD_QUALITY",
                "BATTERY",
                "PRICE",
                "PRICE"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "DESIGN"
            ],
            "neg_4_aspects": [
                "BATTERY",
                "BATTERY"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [
                "BATTERY",
                "BUILD_QUALITY"
            ],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PRICE"
            ]
        }
    },
    {
        "title": "Dell Inspiron 15 3000 3520 Business Laptop Computer[Windows 11 Pro], 15.6'' FHD Touchscreen, 11th Gen Intel Quad-Core i5-1135G7, 16GB RAM, 1TB PCIe SSD, Numeric Keypad, Wi-Fi, Webcam, HDMI, Black",
        "product_id": "B0CC936WF1",
        "price": "$505.00",
        "image_url": "https://m.media-amazon.com/images/I/71gbrvRJI-L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Dell-Laptop-Touchscreen-Quad-Core-i5-1135G7/dp/B0CC936WF1/ref=sr_1_3?dib=eyJ2IjoiMSJ9.-lRFAy6jN5tE2HvJoRmhAZ-fs1m3UCQ1OHfrq9xJ901si04MCGdB1Zd11PkXqpMs0bY20CgjWTiA5p9ND17jPmoCUoxwEsqdsy-0wZfLqTZE6p0BU0BcUVYjq0JKVKDmcBQ9Nn0482kAYVwK-UPmnAFBJZ808Fhx97pAs-3tP94LUEAaW25lB2osMqHnVp6QtMp-Nhg2GNctW8KYJCBnNzyAfDoyJdmhFUIXTyfcwy0.lc9eP29JSyMN--IFjyALNU0YafutTCGx83xbSzS2DZ8&dib_tag=se&keywords=dell+laptop&qid=1742568201&refinements=p_123%3A241862&sr=8-3",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "367 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "15%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "11%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "P Brac",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 22, 2025",
                "review_text": "I like Dell laptops, with touchscreen, runs faster than my old machine. All the features I wanted ."
            },
            {
                "reviewer_name": "Mark F.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 11, 2024",
                "review_text": "I've been using Dell laptops, workstations and servers and network switches for 3 decades. In this time, I've had one server motherboard replaced under warranty and all the other hardware goes way past its life expectancy with some equipment running a decade or more without issues. You simply can't go wrong with a Dell product. My laptop has been running flawless and the build quality is outstanding as with all of their other products.Buy it !"
            },
            {
                "reviewer_name": "Angela Conti",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 25, 2025",
                "review_text": "My business laptop's hard drive crashed. I ordered this one until I could find another. It's fast and has a nice battery life for a second work laptop."
            },
            {
                "reviewer_name": "Jesús Figueredo Reyes",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 17, 2025",
                "review_text": "El producto llegó con buena calidad gracias a ustedes"
            },
            {
                "reviewer_name": "M. Pelland",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 7, 2025",
                "review_text": "I returned three \"refurbished\" Amazon laptops--very annoying and time consuming. Each had problems. In days gone by, refurbished or renewed electronics were a good value and dependable. I gave up and chose the new model of this Dell. Win 11. It is exactly what I need with no issues, no problems. The keyboard lights up. The cover is attractive. The unit works perfectly. Buy new--it's worth it."
            },
            {
                "reviewer_name": "Omar",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 7, 2025",
                "review_text": "Excelente equipo,tiene muy buenas propiedades, muy rapida,buen precio la recomiendo 100%"
            },
            {
                "reviewer_name": "Jeff",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 6, 2025",
                "review_text": "I've had several Dell computers over the years.  My last laptop was an hp and broke after only three years.  The back of the base cracked.  It was usable but I could not close the cover.  The speed was also slow.  After doing some research, I found this Dell model.  The hp was bigger and that posed some problems.  This size is better.  The only drawback that I didn't notice when I ordered is that it does not have backlit keys.  Other dells have had this and once you have, it you get spoiled.  For now, it's been great."
            },
            {
                "reviewer_name": "Joe Bios",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 21, 2024",
                "review_text": "I purchased a Dell 3520 Win 11 Pro from a reseller \"Like New\". A few things folks might find helpful. 1. Dell sells a limited set of configurations (Memory, SSD, etc), so resellers open the laptop to \"upgrade\" memory, SSD to offer more choice in configurations. Of course, this begs the question what components are being installed. In my case the components were reasonable: 16GB Samsung DDR4 3200 memory and WD Green 1TB SSD, but its \"reasonable\" to check the delivered system. 2. Microsoft defaults to keeping a \"remarkable\" amount of information about your activities, like every app installed, every webpage viewed, etc., so I strongly suggest logging into your Microsoft account (account.microsoft.com) and turn on every privacy control they provide. Then clear the accumulated history and log into the account in a day or so and check if they stopped accumulating data. 3. Windows PRO provides S Mode which is a restrictive version of Windows (only M$ store apps, lighter weight process controls etc). This is mostly for PCs going to less than trusted employees. Turning off S Mode is a one-way trip, i.e. it cannot be reenabled (essentially forever). The system I receive had S Mode off. This is something I would have done anyway, but it's something to consider if you need S Mode for employee users."
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 6, 2025",
                "review_text": "this dell computer does work well. the volume keys do not work, I downloaded an app and have problems with it. I would like to return this dell computer. I can not get the apps. that I am use to. I need a computer that I can the apps. that I need. I also need to update my grand daughter Tandem insulin pump and can do it on this computer. I can do this on a computer that has play store on it. The pump need to be updated before the end of this month. I have 2 computers picked out in my cart to choice from. THIS IS VERY IMPORTANT THAT I GET INSULIN PUMP IS VERY NECCESARY TO MY GRAND DAUGHTER.  THANK YOU VERY MUCHI am so sorry, I did see your  report and credit to my account. I would like to send back to you. please send me a return label so I can print it out and send back to you.  Like I said I AM SO SORRY I DID SEE THE RETURN TO ME  THANK YOU VERY MUCHI received the new computer and returning the dell computer in the box the new computer was in.  How do i return it back, do I need a return label"
            },
            {
                "reviewer_name": "Capt. C.",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on June 11, 2024",
                "review_text": "I can only begin this review with serious misgivings about this particular Dell Inspirion laptop.  When one purchases a product from a \"Dell Vendor\", one presumes it is a 100% Dell product.  Apparently this was not the case with this laptop.  Exactly 3 days after the Amazon/Vendor's return policy ran out, this laptop stopped working.  The error message was \"Corrupt Hard Drive\".  I can understand electronic devices will sometimes have issues.  I can also understand manufacturers and vendors need to have a limit on how long they will allow items to be returned.  So we called Dell Warranty Service, and they were very helpful.  They sent a box, pre-paid shipping label and we thought that would be the end of it.  Wait a reasonable time for the laptop to be repaired under warranty, and we could go on with our lives.  NOT SO.  According to the Dell Warranty Center, this particular laptop has a 3rd Party Hard Drive.  Not a hard-drive provided by Dell or installed by Dell or used by Dell.  So... our laptop was... in fact... not able to be repaired under warranty.  Dell has offered to fix the laptop and install the correct, but the repair is nearly as much as the laptop cost new from Amazon.  This is totally unacceptable!  When we bought the laptop, we presumed it was a new Dell Laptop with appropriately sourced and installed electronics that would be approved by Dell (or installed by Dell)... BUYER BEWARE of ROKC Electronics.  They have offered NO Help,  NO Sympathy,  and we are now completely out of the money we spent, and have a laptop that is absolutely Useless!!!!  I can only imagine if we were still in the window for return, they would put the same Non-Dell parts back in, and we would be facing similar issues down the road.  This is not the way to run a business.  And certainly not the way an Amazon vendor should be doing business.  Very Very Very Disappointed!"
            }
        ],
        "review_summary": "The laptop receives mostly positive feedback for its performance, build quality, and features, though there are notable concerns regarding third-party components and warranty issues from certain vendors.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PERFORMANCE",
                "DISPLAY",
                "BUILD_QUALITY",
                "BATTERY",
                "PERFORMANCE",
                "BUILD_QUALITY",
                "DESIGN",
                "PERFORMANCE",
                "PRICE",
                "PERFORMANCE"
            ],
            "neg_5_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PRICE"
            ],
            "pos_4_aspects": [
                "PORTABILITY"
            ],
            "neg_4_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "AUDIO",
                "PERFORMANCE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "AUDIO",
                "BATTERY",
                "DESIGN",
                "DISPLAY",
                "PORTABILITY"
            ]
        }
    }
]