[
    {
        "title": "HP Pavilion 15.6\" HD Touchscreen Anti-Glare Laptop, 16GB RAM, 1TB SSD Storage, Intel Core Processor up to 4.1GHz, Up to 11 Hours Long Battery Life, Type-C, HDMI, Windows 11 Home, Silver",
        "product_id": "B0C4G4L53W",
        "price": "$423.00",
        "image_url": "https://m.media-amazon.com/images/I/71aTEZOda0L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Pavilion-Touchscreen-Anti-Glare-Processor/dp/B0C4G4L53W/ref=sr_1_1?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "1,130 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "15%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "MT",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 27, 2025",
                "review_text": "i got this to replace an old labtop and it had the new windows 11. it does have a touch screen which i wanted. its memory and storage is fairly good. it is very light weight and comes on quickly. it does have ease of use. screen quality is good. so far  i have been happy with the device."
            },
            {
                "reviewer_name": "Kathy Wanhainrn",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 30, 2025",
                "review_text": "This was the second laptop I  ordered.  The first was from a different supplier and after  20 + days was never shipped.  Thank you fuel cell for delivering this product on time and I really like it!"
            },
            {
                "reviewer_name": "Noydys Romero Ramrez",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 22, 2025",
                "review_text": "Excelente producto est laptop rpida y trabajo rpido y muy fcil de utilizar se lo recomiendo  seguro y llega super rpido su envo,muy importante tener est laptop en casa nos ayudar trabajar ms cmodo desde casa"
            },
            {
                "reviewer_name": "NinaH",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 10, 2025",
                "review_text": "I am very pleased with th espeed and performance of this machine! It was a great deal and I anticipate will last me a long time.  I do not do a lot of gaming or video but for everyday use, this is perfect! The screen is a good size and easy to read. The touch screen responds well and it i seasy to use."
            },
            {
                "reviewer_name": "Roy & Susan Ross",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 18, 2025",
                "review_text": "it works"
            },
            {
                "reviewer_name": "Mark",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 15, 2025",
                "review_text": "Excellent quality. Cheap."
            },
            {
                "reviewer_name": "J.P.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 14, 2025",
                "review_text": "So far so good!"
            },
            {
                "reviewer_name": "Karen Phillips",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 30, 2025",
                "review_text": "This unit has a great display, better than average keyboard and is very fast. This thing really flies and is well worth the price!  If it weren't for the Mediatek WiFi card in it, I would rate it a 5 without hesitation.However, if you plan to run Linux on it, be aware that Linux Mint has no drivers for the WiFi, Mediatek has no Linux drivers for it and HP has no drivers of any kind for Linux.  I ended up using a $10 TP-Link USB WiFi adapter and now all is well in my world."
            },
            {
                "reviewer_name": "jake",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 15, 2025",
                "review_text": "Not the best operation Ive seen in the price range but definitely not the worst either"
            },
            {
                "reviewer_name": "Greg Wolfe",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 29, 2025",
                "review_text": "Mostly a robust computer, however, the USB-C port is not DisplayPort capable, which means you can't plug this into a desktop hub, which means extra hassle plugging in 3-5 items each time you bring it back to the desk.  Even the cheaper models of Acer have this plug"
            },
            {
                "reviewer_name": "licenced professional",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 17, 2025",
                "review_text": "WASTE OF MONEY!! Computer went completely black screened in 11 months. Warranty for 1 year.System was completely removed from laptop while doing class work, sent it to Hp and warranty was voided due to the seller modifying the laptop and adding 1TB when its only suppose to come with 256gb. Reached out to Amazon and they said I should receive call from seller which I never did. After seeing everyone elses reviews Im sure I wont get anywhere with them and not willing to pay a $200 bs restocking fee! Hubby is a computer wiz luckily (I shouldve let him look at it first but wanted to use my warranty).These computers are refurbished, all the parts are from HP EXCEPT for the 1TB Hard drive, which is made from Kingston. Did some research and a 1TB drive is only $60 (I would purchase a different brand than Kingston since its the cheapest, you get what you pay for).YouTube how to open and replace the hard drive (easy af)  and do it yourself. But this company seems to make sure these laptops only last but a year which is terrible for people using their last to buy the price of crap , trying to get through school/work etc. Smh. BUYER BEWAREI brought the Samsung 990 Evo Plus 1TB hard drive from Amazon for $70 and paid an extra $12 for a 2 year warranty .. just installed it and re-installed Windows 11 and EVERYTHING was backed up once I signed back in to Microsoft which makes me extremely happy!! DO NOT send your laptop back to this company, they will only sell it again with a weak/used hard drive for $400 to someone else.Its cheaper to fix it yourself. :)"
            }
        ],
        "review_summary": "The laptop is lightweight, fast, has a good touchscreen and display quality, and offers decent performance for everyday use, although some users reported issues with WiFi compatibility and durability concerns.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PORTABILITY",
                "DISPLAY",
                "PERFORMANCE",
                "PERFORMANCE",
                "PORTABILITY",
                "PERFORMANCE",
                "PRICE",
                "DISPLAY",
                "BUILD_QUALITY",
                "PRICE"
            ],
            "neg_5_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PRICE"
            ],
            "pos_4_aspects": [
                "DISPLAY",
                "PERFORMANCE",
                "PRICE"
            ],
            "neg_4_aspects": [
                "PRICE"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "PORTABILITY"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "AUDIO",
                "BATTERY",
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PORTABILITY",
                "PRICE"
            ]
        }
    },
    {
        "title": "HP 14 Laptop, Intel Celeron N4020, 4 GB RAM, 64 GB Storage, 14-inch Micro-edge HD Display, Windows 11 Home, Thin & Portable, 4K Graphics, One Year of Microsoft 365 (14-dq0040nr, Snowflake White)",
        "product_id": "B0947BJ67M",
        "price": "$188.80",
        "image_url": "https://m.media-amazon.com/images/I/815uX7wkOZS._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Micro-edge-Microsoft-14-dq0040nr-Snowflake/dp/B0947BJ67M/ref=sr_1_2?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-2",
        "average_rating": "4.1 out of 5 stars",
        "review_count": "3,115 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "13%",
            "3_star": "7%",
            "2_star": "3%",
            "1_star": "12%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Christine",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 23, 2025",
                "review_text": "Great laptop for the price. Very light and easy to take with you on the go."
            },
            {
                "reviewer_name": "Smittiff",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Love it! Great price and well worth it."
            },
            {
                "reviewer_name": "Missi",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 18, 2025",
                "review_text": "Laptop is just its described. Great battery, life, good quality Not too heavy."
            },
            {
                "reviewer_name": "Risme",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 5, 2025",
                "review_text": "So far it's amazing! I love this pc and hope it continues to be great. I will update with time. This is a really nice pc and exceeded my expectations so far."
            },
            {
                "reviewer_name": "Saul Arroyo Alfaro",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 18, 2025",
                "review_text": "No me funcion, y na lo pude devolver, era un regalo, mala compra"
            },
            {
                "reviewer_name": "Robin Ramer",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 12, 2025",
                "review_text": "Very clean and works great!! The item appears to be new!! Love it!! Item is as described!"
            },
            {
                "reviewer_name": "sam17704",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 8, 2025",
                "review_text": "This is listed as a budget laptop, but if one is knowledgeable about pc's you can make it into a less than $300 laptop that can process videos.  I am using it as I write this to use VideoPad to change the resolution of a video clip to 3840 x 1920 fps.  Now the pc is cheap as in the keyboard feels cheap and I am not sure how long the power on button is going to last.  You cannot update the RAM.  It has only 2 USB ports and they are so close together it is hard to use two at the same time.  A 5 minute video clip changed from mp4 to wmv is 25% complete after 20 minutes.  That said it was $188!!!"
            },
            {
                "reviewer_name": "KH",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 13, 2025",
                "review_text": "The laptop is nice but zoom/video calls are glitchy and slow. Its quick to say CPU high usage or something like that. I end up having to turn the video off so that it doesnt mess with my feedback. Kinda not cool. Otherwise, its pretty decent so far."
            },
            {
                "reviewer_name": "tparwaz",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 2, 2025",
                "review_text": "I purchased a HP 14 Laptop, Intel Celeron N4020, 4 GB RAM, 64 GB Storage, 14-inch Micro-edge HD Display, Windows 11 Home, Thin & Portable, 4K Graphics, One Year of Microsoft 365 (14- on Jan 30th 2025 and received it on feb 1st 2025, was happy and satisfied at first, now its April 2, 2025 and for the last week or so every time I turn my computer on, the Time on it resets and is off by a few hours, also it takes almost 2 minutes for the computer to boot.  I have gone into the time and language settings to try and fix the issue, but nothing seems to work, so I started to research the problem and have read that the cmos battery is most likely gone/dying... the issue that I am having is that my window for return is past the date which was March 4th 2025. So now I am stuck with a computer that is not working correctly and not only that I used affirm to pay on it and Now I still have to keep making payments on a product that doesn't work properly and as well pay more money to have someone fix the issue that I am having. Iam not happy with this purchase."
            }
        ],
        "review_summary": "The laptop provides good value for its price with a great battery life and portability, but it suffers from connectivity issues, quality concerns, and potential reliability problems over time.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "PORTABILITY",
                "PRICE",
                "BATTERY",
                "BUILD_QUALITY",
                "PORTABILITY",
                "BUILD_QUALITY",
                "DESIGN",
                "PERFORMANCE"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PRICE",
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "BUILD_QUALITY",
                "PORTABILITY"
            ],
            "pos_3_aspects": [
                "PERFORMANCE"
            ],
            "neg_3_aspects": [
                "PERFORMANCE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BATTERY",
                "PERFORMANCE",
                "PRICE"
            ]
        }
    },
    {
        "title": "HP 15.6\" Business Laptop, Free Microsoft Office 2024 Lifetime License, Copilot AI Chat, HD Touchscreen Display, Intel 6-Core i3-1215U 4.4 GHz, 16GB RAM, 1TB SSD, Long Battery Life, Windows 11 Pro",
        "product_id": "B0CWN27G3V",
        "price": "$440.86",
        "image_url": "https://m.media-amazon.com/images/I/71xEfn8Qi8L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Business-Microsoft-Lifetime-Touchscreen/dp/B0CWN27G3V/ref=sr_1_3?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-3",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "1,601 global ratings",
        "histogram": {
            "5_star": "64%",
            "4_star": "15%",
            "3_star": "7%",
            "2_star": "2%",
            "1_star": "12%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Chakman70",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Lightweight laptop, its comes with the lifetime office license 2024. Contact the seller if you have problem to activate it. They are super awesome, prompt and helpful. I love mine "
            },
            {
                "reviewer_name": "amy g.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 28, 2024",
                "review_text": "So I bought two of these computers, one for my daughter and one for me. Let me say first that DURING your INITIAL setup make sure that you DO get properly signed in to your Microsoft account and your OneDrive account. Set them up during setup. Also make sure that one drive is set to sync. While setting up my daughter's computer I got the password wrong so it set it up without signing in. After setup I did sign into Microsoft and OneDrive but did not set it up to sync. I could not get that computer out of S Mode no matter what I did. I had to reinstall a brand new windows 11 and then go in and delete the old operating system in order to get it out of S Mode.On my computer setting it up I DID properly get signed into Microsoft account and one drive and told it to enable the sync. This one came right out of S Mode after the setup was done when I followed Microsoft's instructions. It must have something to do with enabling those things and signing in during setup and not afterward! (Microsoft should be CLEAR about this and nowhere did I find this information online - truly it was by accideny).As far as this complaining about a battery not holding charge. First of all your standby time unplugged I have at least 10 to 12 hours, if not a few days. I left mine unplugged overnight and it only went down less than 10%. If you're using your computer yeah you're only going to have maximum 3 to 4 hours of battery time and that's the same on all of my laptops. Secondly this computer comes with an HP interface program called MY HP that includes Diagnostics. You will have to create an account and sign in but there are diagnostic tools in there that will test your battery. One of the things HP says (Especiaaly with a new computer or if you are replacing a battery) is that you need to condition the battery so that it does not get damaged or operate improperly. What they recommend is that you discharge the battery until the computer shuts itself off. Then you plug it in (if it starts up when you plug it in let it boot and turn it back off all the way). Then allow the battery to charge with the computer off for a minimum of 6 hours. Then you unplug the charger and let the computer sit for at least 4 hours still completely off. Once you turn it back on reload the HP diagnostic software and run the battery test again. If it still tells you that the battery needs conditioned then you will repeat the process up to three times until it tells you the battery condition is good. Make sure when you do this that you have the power setting set to charge the battery to 100%. Once you have conditioned the battery go in and set it to power saving so that it only charges the battery up to 80% so that way you don't overuse the battery and you don't get Ghost charges. If you do this you will have a longer usage time and standby time. And you won't damage the battery in the end."
            },
            {
                "reviewer_name": "Miss Mitzi",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 24, 2025",
                "review_text": "Just what I was looking for: a light-weight HP laptop that has Microsoft lifetime non-subscription,  upgraded features. I've been satisfactorily using Windows 10 on two 17-inch laptops (an HP and a Lenovo) for several years. But when Microsoft announced not supporting WIN 10 and encouraging the installation of WIN 11, I knew I would have to \"bite the bullet\" and upgrade before I ended up having to buy Windows 11. WIN 11 comes pre-installed. I've become accustomed to using Office suites since the mid-90s (okay, okay I'm now 78).  Free pre-installation of the latest of the non-subscription Office suites (2024) was a big plus when considering the purchase of this new laptop.  I hope I'm all set for the rest of my life.  I was also looking for a laptop that--as I age--I could much more easily carry around the house than I can right now carry my 17-inchers.  (It could also be easier to carry when I pack up other personals if ever notified to evacuate due to fire, wind, or earthquake.) Also, realizing that I didn't necessarily need a 17-inch laptop any longer, I chose a less expensive 15-incher. By the way, validating the pre-installed Office 2019 is easy. Just don't hurry, read everything on the screen as you work toward validation, and you'll be done with that step in four minutes! Watch that you do not install Microsoft 365 'cause you'll have to pay for and subscribe to it. If you don't need it, then Office is truly adequate for you. The legal pre-installed version of Office 2019 is genuine Microsoft software that does not come with a product key and, therefore, it does not need to be registered with Microsoft.  (If you have an online Microsoft account, it's up to you if you want to register the laptop itself.)  One more thing, once you're done with setup process, you'll notice that OneDrive is the default for synchronizing. If you're not familiar with OneDrive, go online to understand what it's for and how it works. Contact the seller via Amazon's communication feature for anything. Just click his name on the right side of the product description page and you'll arrive at the seller's profile with the link for communication in the upper right corner."
            },
            {
                "reviewer_name": "Angela",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 7, 2025",
                "review_text": "Love it!!! I bought it a few weeks ago and it was a great purchase. I'm a very straight forward basic person so it does what it needs to do for me. I'm not a gamer so I only use it for work and school and the computer is perfect!"
            },
            {
                "reviewer_name": "NB54",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 24, 2025",
                "review_text": "Best value for the money, screen quality is excellent, boot speed very good  highly recommend"
            },
            {
                "reviewer_name": "Iva Ruen",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Perfect laptop for work. Sleek design, runs smoothly, lightweight, and battery lasts all day. Highly recommend."
            },
            {
                "reviewer_name": "Peter",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 3, 2025",
                "review_text": "Product itself is good, though start up time is slow compared to my previous HP laptop bought several years ago. The key issue is the Microsoft Office 2024 life time free license that promised to be pre-instlled and no key to activiated as advertised. Like most of the feedback received by Amazon, my lapatop also shipped without the promised Microsoft Office 2024 preinstalled. I asked their customer service, which is very responsive with same day reply, tell me to reutrn for fixing the problem, which I did with their returned label. But when received the returned laptop, the software is still not installed. This time when I asked their custoer service, which is still very responsive, but the answer is Office 365 is better, asked me to subscribe it instead.I admitted that taking advantage of getting the free life time license for Microsoft Office 2024 is the reason of buying this laptop, and pay to subscribe the software is consumer's discretion. And this time I have no choice if need the Office software to work on my Word, Excel files.Who's responsibility, the seller's not so true advertising or my ignorance of believing in free lunch still exists?"
            },
            {
                "reviewer_name": "S. Fine",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 3, 2025",
                "review_text": "This is an upgrade from my Windows 10 HP laptop, which will no longer be supported in October.  So far I am quite pleased with it, good value, lighter and thinner, but very fast to boot up.  Took a bit of Googling to find all the quirks and tricks for setting it up they way I like.  Like other reviewers stated, Don't let it fool you into downloading Office 365, the free version is in there, you just have to look for it initially.  Once I located the Word, Excel and other applications I wanted, I created shortcuts for them on my desktop.  Layout is a bit different from version 10.Plenty of storage space, at least for me.  Downside is only two USB ports, located on opposite sides of the pc, and don't believe the Amazon description that says there is a multi-size SD card reader--there is not.  That, and the fact that the non-backlit keyboard is GREY with WHITE lettering that makes is impossible to read without good lighting, is the reason I am only giving it four stars.  Other than that, I think it is a good value for $420."
            },
            {
                "reviewer_name": "Tamiko Mason",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 15, 2025",
                "review_text": "The speakers are not good, I don't like that the on button is on the keyboard with the main keys. It does work as described."
            },
            {
                "reviewer_name": "Raquel Sierra-Pinto",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 16, 2024",
                "review_text": "This laptop was purchased for my girlfriend since she was planning on attending college. For the first two weeks, everything was fine, but in the third week, the Wi-Fi could no longer connect. There wasn't even an option. I contacted the third party whom I purchased the extended warranty from ( a warranty that is purchased when you buy items on amazon.com) and was told to contact HP.  HP tried a few things and after a while asked for information such as the model and everything else that's needed to determine the specs of the laptop. Turns out that this actual model only is supposed to have 128 GB and 4 ram. THIS COMPANY \"MODIFIED\" this laptop to \"make\" it a 1 TB hard drive. This \"modification voids the warranty with HP and the third party will not cover anything until the warranty from HP expires after a year. After going back and forth with this seller and Amazon, they finally agreed to send a return label and refund my money. I clearly confirmed the amount I would be receiving and this company never stated otherwise. After a week I receive a PARTIAL REFUND. According to this company, they charge a \"restocking fee\" of over $200 DOLLARS?!?!  Keep in mind, I wanted to keep the laptop if it was in working order but this was a DEFECTIVE and MODIFIED laptop. The seller's answer to the problem initially was to factory reset the laptop every time the wifi no longer worked (as in the option for it disappeared). Why would anyone want to do that? It's a shame that Amazon allows this company to sell these illegal, modified and defective laptops on their site."
            }
        ],
        "review_summary": "The laptop is lightweight and features a lifetime Office license, but some users faced issues with setup, battery performance, and unexpected modifications, leading to mixed feelings about the purchase and customer service experiences.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PORTABILITY",
                "BATTERY",
                "PORTABILITY",
                "PRICE",
                "PERFORMANCE",
                "PORTABILITY",
                "DISPLAY",
                "PERFORMANCE",
                "DESIGN",
                "PERFORMANCE",
                "PORTABILITY",
                "BATTERY"
            ],
            "neg_5_aspects": [
                "PERFORMANCE",
                "PORTABILITY"
            ],
            "pos_4_aspects": [
                "BUILD_QUALITY",
                "PORTABILITY",
                "PRICE",
                "PORTABILITY",
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "PERFORMANCE",
                "PRICE",
                "BUILD_QUALITY",
                "BUILD_QUALITY"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "AUDIO",
                "PRICE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "DESIGN",
                "AUDIO",
                "DISPLAY",
                "BATTERY"
            ]
        }
    },
    {
        "title": "HP Portable Laptop, Student and Business, 14\" HD Display, Intel Quad-Core N4120, 8GB DDR4 RAM, 64GB eMMC, 1 Year Office 365, Webcam, RJ-45, HDMI, Wi-Fi, Windows 11 Home, Silver",
        "product_id": "B0CPL25J3W",
        "price": "$204.80",
        "image_url": "https://m.media-amazon.com/images/I/61IpRGnny7L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Portable-Student-Business-Quad-Core/dp/B0CPL25J3W/ref=sr_1_4?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-4",
        "average_rating": "4.1 out of 5 stars",
        "review_count": "2,838 global ratings",
        "histogram": {
            "5_star": "64%",
            "4_star": "14%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "13%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Reviewer",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 20, 2025",
                "review_text": "Memory is 64 GB. The available memory was only 16 GB. To run a Windows update, the memory was not enough. It gave options for external USB use to run an update. After almost 20 hours of tries, it was updated. Later after disk cleanup run, memory free was 24 GB. This was bought like new and saved me $60+. I am glad finally updated to latest Windows update. It is working fine right now."
            },
            {
                "reviewer_name": "Lisa G.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 15, 2025",
                "review_text": "Perfect for what I needed a laptop for. But, like all other reviews does not have lots of storage. You can buy external storage to help or store documents in your one drive  which is what I do and that has helped. I still give 5 stars because I really the laptop and will purchase 2 more for my girls. I think the price is just right."
            },
            {
                "reviewer_name": "Krissy",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 19, 2025",
                "review_text": "I bought this laptop for work purposes. Its great so far, the only downside for me was that it doesnt have an Ethernet port, I had to buy an adapter but it works well and they battery last long, good size and great keyboard quality "
            },
            {
                "reviewer_name": "Amanda",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 13, 2025",
                "review_text": "Great computer m, I wasnt looking for anything to expensive just needed something to get me through school, doesnt job I like it!"
            },
            {
                "reviewer_name": "Jorge",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 23, 2025",
                "review_text": "Llego justo lo que pedi, en perfectas condiciones"
            },
            {
                "reviewer_name": "Adriana gomez",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 14, 2025",
                "review_text": "Me encanto el color aparte es mucho mejor de lo que desperaba amazon siempre me sorprende con su fantastica calidad"
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 17, 2025",
                "review_text": "Very pleased with the laptop, although, I initially ordered a different color. The seller explained the matter and was amazingly helpful with assisting with the order. I ultimately changed my mind about returning it, because I've used the computer, and so far I can definitely say that it works really well & looks great. I am looking forward to buying additional accessories for it, when I can afford to."
            },
            {
                "reviewer_name": "Kells",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 3, 2025",
                "review_text": "Im not a Windows user but I needed it for one specific purpose, so this laptop was the best value on Amazon.  Plenty of RAM, which gives me some confidence that I wont get too bogged down.  Not too impressed with the build quality but I cant complain for the price.  The trackpad is annoying but you can just touch to click which helped SO MUCH once I realized that.  Setup was a nightmare, but expected from Windows.  Still it was worse than I expected.  I think at least part of that is HP as the problem I had with the setup showed several people online describing the same frozen screen at the same stage, also on HP models.  Now its all done Im glad I got this and didnt have to spend much.  Its working smoothly now.  I dont really have an opinion about the screen or anything like that because Im not using it for regular daily tasks."
            },
            {
                "reviewer_name": "Jenny",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on August 6, 2024",
                "review_text": "I thought this was just the right PC for us. We don't need much, web browsing, some gaming, some MS Office work. Yesterday I saw that the laptop OS needed update so started it. Noticed it was taking some time so I just let it do its thing all day. Went to turn the laptop back on that evening, and got a flash from the monitor but nothing else. I knew it wasn't a power issue because the separate mouse (not included) was lit, indicating it was connected. Tried everything I could think of then went to HP website. HP tells me there's 15 days left on the warranty (\"whew!\") and gave me repair options (phone, chat, local warranty provider [Best Buy]). I chose to go to Best Buy. They worked on the laptop for about 25 minutes, and while I can't tell exactly what was done, I do know it was a series of keystrokes and a flash drive. Geek Squad hands the laptop back to me and tells me it's a hardware issue and not worth the cost of repair. I take the laptop back home and get in a chat with technical support. They have me do what appears to be the same steps Geek Squad did. Then they tell me I need an empty flash drive to reset/reinstall the BIOS. Now I'm not really that tech savvy, but I know enough to tell the technician that all the steps that they have had me do I already had done by Geek Squad, their authorized repair center. Tech tells me that without doing that last step with the empty flash drive they cannot determine that it is truly a hardware issue (really??!) and that they won't be able to give me a repair/replacement if I don't take that last step.Sorry, HP, but you cannot convince me that the cost of a replacement laptop is worth more than the bad taste in my mouth, and my withering review (not only on Amazon, but to anyone who asks) of your inability to honor your very limited warranty. I can't imagine why you wouldn't send a replacement of a low-end laptop just to keep positive goodwill towards your customers. And it's why I strongly suggest anyone reading this review to search for a different unit."
            }
        ],
        "review_summary": "The laptop has a good price-to-performance ratio and is suitable for basic tasks, but users have reported issues with storage capacity, lack of an Ethernet port, setup difficulties, and concerns about build quality and customer service.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "BATTERY",
                "BUILD_QUALITY",
                "PORTABILITY"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PERFORMANCE",
                "DESIGN"
            ],
            "neg_4_aspects": [],
            "pos_3_aspects": [
                "PRICE",
                "PERFORMANCE"
            ],
            "neg_3_aspects": [
                "BUILD_QUALITY"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PRICE"
            ]
        }
    },
    {
        "title": "HP 17 Laptop, 17.3\" HD+ Touchscreen Display, 12th Gen Intel Core i7-1255U, 64GB RAM, 2TB SSD, Webcam, HDMI, SuperSpeed USB Ports, Wi-Fi 6, Windows 11 Home, Silver",
        "product_id": "B0CKTZVB17",
        "price": "$842.00",
        "image_url": "https://m.media-amazon.com/images/I/71CGrFl8cjL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Touchscreen-Display-i7-1255U-SuperSpeed/dp/B0CKTZVB17/ref=sr_1_5?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-5",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "673 global ratings",
        "histogram": {
            "5_star": "70%",
            "4_star": "12%",
            "3_star": "3%",
            "2_star": "2%",
            "1_star": "13%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 1,
            "3_star": 0,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Jesus Navarrete",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 19, 2025",
                "review_text": "The **HP 17 Laptop** isnt just a computerits a revolution in productivity and performance. From multitasking madness to creative projects, this machine handles it all with jaw-dropping ease. Heres why its earned a permanent spot on my desk (and in my heart):**Unmatched Performance:**Fueled by the **Intel Core i7-1255U Processor** and a staggering **64GB of RAM**, this laptop laughs in the face of heavy workloads. Ive effortlessly juggled 20+ browser tabs, video editing software, and complex spreadsheets*without a single lag*. For developers, designers, or data analysts, this is pure firepower.**Stunning 17.3 HD+ Touchscreen:**The massive **touchscreen display** is a game-changer. Whether Im sketching designs, presenting slides, or binge-watching movies, the vibrant colors and crisp details make every interaction immersive. Plus, the touch functionality adds a layer of convenience that feels luxuriously intuitive.**Speed Meets Storage:**With a **1TB SSD**, boot-up times are lightning-fast, and files load in the blink of an eye. Ive stored terabytes of projects, media, and software without a hint of slowdown. Say goodbye to external drivesthis laptop is a vault with runway-ready speed.**Sleek, Professional Design:**The sleek **silver chassis** strikes the perfect balance between elegance and durability. Despite its large screen, its surprisingly portable for a 17 laptop, and the full-sized keyboard with numeric pad is a dream for data entry. The HD webcam? Crystal-clear for Zoom calls, making WFH a breeze.**Connectivity Done Right:**With **HDMI, Wi-Fi 6**, and multiple USB ports, connecting to peripherals or dual monitors is seamless. I hooked it up to my 4K TV for a movie night, and the results were flawless. Windows 11 Home also brings a smooth, user-friendly interface thats perfect for both work and play.**Minor Consideration:**The 17.3 size might be bulky for frequent travelers, but for desk warriors and home users, its a worthy trade-off for the stunning screen real estate.**Final Verdict:**This isnt just a laptopits a future-proof investment. Whether youre rendering 3D models, editing 4K videos, or running virtual machines, the HP 17 delivers desktop-level power in a portable package. **5 stars arent enoughthis is a game-changer!** **Who Needs This Laptop?**- **Professionals** drowning in multitasking (developers, engineers, content creators)- **Creatives** craving a vibrant touchscreen for design or editing- **Students** tackling resource-heavy projects or gaming on the side- **Anyone** tired of sluggish performance and cramped storageDont settle for less. The HP 17 Laptop is the Swiss Army knife of computingversatile, powerful, and ready for anything. **Worth every penny!**"
            },
            {
                "reviewer_name": "Wine Stock",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 10, 2025",
                "review_text": "I was disappointed that the computer I received did not look like the product pictured in the description. The keys are dark grey, not silver, as pictured. However, the keyboard works well, is fast, and will meet my needs. ONE THING TO NOTEthe USB-C port does not support charging or hooking up to a second monitor. These facts are not mentioned in the description. You will need a *barrel-to-USB-C adaptor* to charge with a USB-C cable, which can be purchased on Amazon for about $10.  I give the computer a 5-star rating and the *product description* on Amazon a 3-star rating."
            },
            {
                "reviewer_name": "Bobby Perez",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 17, 2025",
                "review_text": "HP is my go to when I need to upgrade my laptop. I use it everyday and it hasn't failed me at all. Runs great, fast modem, for a simple home laptop it is amazing. It doesn't have many bells and whistles; it's a simple laptop capable of doing big jobs. Great price and easy set up. This will fit all your simple home needs."
            },
            {
                "reviewer_name": "Tngal",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 17, 2025",
                "review_text": "This laptop has been a good buy. It works perfect and I do not have anything bad to say about it. It's easy to use & the screen quality if very nice."
            },
            {
                "reviewer_name": "Pev",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 12, 2025",
                "review_text": "Outstanding laptop with 2tb storage, 64gb. I had to return a Dell laptop for defective speakers.  Tried the HP and like it much better. Especially like the keyboard better than the Dell because it has the number pad."
            },
            {
                "reviewer_name": "Juan Arocho",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Producto de excelente calidad. Cumple con todos los datos de su descripcin."
            },
            {
                "reviewer_name": "Tom R.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 14, 2025",
                "review_text": "I paid a little more for a few options like the backlit keyboard and glad I did. I'm very happy with the purchase."
            },
            {
                "reviewer_name": "ORA: Paul H.",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 7, 2024",
                "review_text": "for the specs of the machine are great.It is easily the most powerful laptop I could buy for under $1000.Buying on black Friday made the purchase all them more sweet.I bought this specifically to support working from home and occasionally a laptop for hotel travel.Other reviews are only partially correct about external monitor support.Out of the box you can have only 1 external monitor (using the laptops only HDMI port).however if you buy a USB to HDMI hub such as amazon SKU B0D59XJ21H then laptop DOES support 3 external monitors + laptop for a total of 4 independent monitors.I have this configuration running as I type, it is working great.The speed of this machine is great. It multitasks very well. I like the backlit keyboard.As for what I do not like:*as a touch typist it is \"hard\" to find home because \"gh\" is not center line of laptop but offset a several inches left.  It is such a big un-natural shift  I ended up adding a 1/8\" strip of black tape under the space bar above the touch pad for my thumbs to have a tactile reference as well.* the USB-C port does not support laptop charging. For the price paid, the laptop should have this as it would have eliminated a cord entering the laptop.  It makes \"sense\" to me to have a USB hub  that everything connects to including power and then a single cord goes from hub into laptop thus minimizing the collection of cords tethering the laptop to the desk."
            },
            {
                "reviewer_name": "Jaydogg",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 10, 2025",
                "review_text": "What an absolute piece of garbage hardware.HP has always been terrible, but I figured I would try them again. That was a mistake.When the battery fails within less than one year, it also blows out your power supply.If you plan to order this, you should also plan to order the following replacement parts:- Mobik 41.04Wh HW03XL L97300-005 Laptop Battery Replacement for HP Pavilion 15-EG 15-eg0xxx 15-eg0073cl 15-eg0070wm 15-EH 17-CN 17-cn0xxx 17-CP 17-cpo700dx Series L96887-421 l97300-005 HW03041xl-pl- 45W 19.5V 2.31A Laptop Power Adapter Charger for HP 741727-001 721092-001 719309-001 HSTNN-DA40 ADP-45WD B, Pavilion TouchSmart 11 13 15 Stream 14 13 11 Notebook Charging Cord with Blue Tip, 45W maxThen because the built-in battery isn't really serviceable, you should plan on disassembling the laptop. There are four screws on the bottom. But they don't really open the laptop. You will then need to pry it apart, cracking and damaging the plastic casing around the keyboard area, and the edges. If you're lucky, you can replace the failed battery without damaging any other components or yourself in the process."
            }
        ],
        "review_summary": "The laptop offers impressive performance with powerful specs, a stunning touchscreen, and ample storage, though it has some drawbacks regarding the USB-C port and potential battery issues.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PERFORMANCE",
                "DISPLAY",
                "DESIGN",
                "PORTABILITY",
                "PRICE",
                "PRICE",
                "DISPLAY",
                "PORTABILITY",
                "AUDIO",
                "BUILD_QUALITY"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PERFORMANCE",
                "PRICE",
                "PORTABILITY"
            ],
            "neg_4_aspects": [
                "BUILD_QUALITY"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BATTERY",
                "BUILD_QUALITY"
            ]
        }
    },
    {
        "title": "HP Stream 14\" HD BrightView Laptop, Intel Celeron N4120, 16GB RAM, 288GB Storage (128GB eMMC + 160GB Docking Station Set), Intel UHD Graphics, 720p Webcam, Wi-Fi, 1 Year Office 365, Win 11 S, Silver",
        "product_id": "B0CZKPF2QH",
        "price": "$262.65",
        "image_url": "https://m.media-amazon.com/images/I/61Uw0-2+2YL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Stream-BrightView-N4120-Graphics/dp/B0CZKPF2QH/ref=sr_1_6?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-6",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "2,683 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "15%",
            "3_star": "7%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Brandi Bourne",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 20, 2025",
                "review_text": "So far so good, it's day 1 though I'll update further along. Set up was easy, didn't freeze on me. Switched out of S Mode easily to download Chrome. It's smaller than I was thinking but I could've measured properly and figured that out so that's on me. Not bad for the price honestly. Runs fine, decent speed. Haven't tried out the external storage but I mostly use online storage anyway so I doubt I'll need much. It's a little bulky, and of course a bit older you can tell but I wasn't expecting fancy at this price point."
            },
            {
                "reviewer_name": "Julie Loerwald",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 15, 2025",
                "review_text": "The HP Stream 14\" HD BrightView Laptop is a budget-friendly device designed for basic tasks such as browsing, emailing, and word processing. With its sleek silver design and impressive specs, this laptop is an excellent option for students, professionals, and anyone looking for an affordable yet reliable device.*Pros*1. *Affordable*: The HP Stream 14\" is an excellent value for its price, offering a range of features and specs that rival more expensive laptops.2. *Impressive Performance*: The Intel Celeron N4120 processor and 16GB RAM provide smooth performance for basic tasks, making it ideal for everyday use.3. *Ample Storage*: The combination of 128GB eMMC storage and a 160GB docking station set provides plenty of space for files, documents, and multimedia content.4. *Long Battery Life*: The HP Stream 14\" offers up to 14 hours of battery life, making it perfect for on-the-go use.5. *Office 365 Included*: The laptop comes with a 1-year subscription to Office 365, providing access to popular productivity apps like Word, Excel, and PowerPoint.*Cons*1. *Limited Upgrade Options*: The laptop's storage and RAM are soldered, making it difficult to upgrade or repair.2. *Basic Graphics*: The Intel UHD Graphics are sufficient for basic tasks but may struggle with demanding graphics-intensive applications.3. *720p Webcam*: The webcam resolution is relatively low, which may affect video conferencing quality.*Verdict*The HP Stream 14\" HD BrightView Laptop is an excellent choice for anyone seeking an affordable, reliable device for basic tasks. While it may not excel in demanding tasks or graphics-intensive applications, its impressive performance, ample storage, and long battery life make it a great value for its price.*Rating*: 4.5/5 stars*Recommendation*This laptop is ideal for:- Students seeking an affordable device for schoolwork- Professionals requiring a basic laptop for email, word processing, and browsing- Anyone looking for a reliable, easy-to-use device for everyday tasksHowever, if you're a gamer, graphic designer, or require a laptop for demanding tasks, you may want to consider other options."
            },
            {
                "reviewer_name": "Mrs. P",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 18, 2025",
                "review_text": "The laptop works great for my college student. She chose this versus getting a new Mac book and said it does ever She needs it to do. She has not had any problems"
            },
            {
                "reviewer_name": "Kirk Enoch",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 23, 2025",
                "review_text": "Been very happy with this computer. Size, speed and synced with my desktop HP to move all settings and favorites without much work."
            },
            {
                "reviewer_name": "Dany",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Sinceramente sper Buena hermosa y til para m qued encantada vino en perfecto estado gracias "
            },
            {
                "reviewer_name": "Renee M Petersen",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Lightweight, love it"
            },
            {
                "reviewer_name": "Natalyolivares08",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 15, 2025",
                "review_text": "Everythings great except the colorHonestly, this laptop was a pleasant surprise. It runs fast, doesnt lag (thanks to the 16GB of RAM), and has plenty of storage with the combined memory. I use it for studying, streaming, and video callseverything works smoothly. The screen looks good and the battery life is decent.The only thing I didnt love is the white color. It looks nice at first, but it gets dirty easily and just isnt my vibe. If there were other color options, it wouldve been perfect. Other than that, no complaints. Great value for the price!"
            },
            {
                "reviewer_name": "Jacqueline Brassard",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 23, 2025",
                "review_text": "The computer is great. I didnt receive the docking station that was supposed to come with it. Could someone tell me why?"
            },
            {
                "reviewer_name": "Sean B",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 19, 2025",
                "review_text": "It won't let me give a 0.5 on the stars, I'd give it a 3.5. I'll echo a few things that others have said. It's not fast. In fact, I got this to replace a YEARS OLD Chromebook. It's only so slightly faster than it. I does take quite a while to do any updates. Last night after about 15 minutes doing yet another update, it was sitting at 0%. After about 30 minutes when I left the house, it was at 12%. The feel of it is very \"cheap.\" Heck, just now, only days old, one of the keys on the keyboard stuck and I could not use the period button. Overall it is functional, but that's about it. The old adage is true, \"you get what you pay for.\" It's a cheap laptop and that's about it."
            },
            {
                "reviewer_name": "Liam",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 14, 2024",
                "review_text": "Mine just came in yesterday and I have started the process of setting it up today (only 2 days); Ive downloaded Google Chrome and a reputable subscription based VPN app (S mode was deactivated for the purpose of downloading Chrome). After downloading those two, I set up 2 administrator users and one standard user. In the process of setting up the other administrator user: the laptop crashed and the screen turned black. Ive tried hard resetting and am leaving it to charge overnight. My intended use was for education for when Im not at home (I have a desktop and obviously no one is going to bring a whole tower to every class they go to) so I wasnt planning to use anything fancy  word and chrome.In terms of performance before it crashed:1) CPU was at 100% and was still slow when opening up apps (I wasnt far from my main mesh router and my actual desktop works fine so cant be internet problem)2) It made me do a recovery startup when I first unpackaged and logged into my microsoft acccount and the startup took about 20 minutes3) Breeze it up  it felt warm on the bottom after an hourThinking about returning it if the laptop still doesnt turn on (Ive tried 2 different outlets in 2 different rooms  [wall plug] and [my extender that has anker charger and an air purifier plugged in]) tmr afternoon).Edit: Im returning it and getting a refund; had it plugged in for a couple of days now and have been attempting to turn it on daily  no success; laptop still does not turn on"
            }
        ],
        "review_summary": "The laptop is a budget-friendly option that offers decent performance for basic tasks, but some users have reported issues with speed, quality, and reliability, with at least one experiencing a total failure after a short period.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "PERFORMANCE",
                "PERFORMANCE",
                "PORTABILITY",
                "PORTABILITY"
            ],
            "neg_5_aspects": [
                "PERFORMANCE"
            ],
            "pos_4_aspects": [
                "PRICE",
                "PERFORMANCE",
                "BATTERY",
                "DESIGN",
                "BATTERY",
                "PERFORMANCE",
                "DISPLAY",
                "PRICE",
                "BUILD_QUALITY"
            ],
            "neg_4_aspects": [
                "BUILD_QUALITY",
                "DISPLAY",
                "DESIGN"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PRICE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BATTERY"
            ]
        }
    },
    {
        "title": "HP 250 255 G10 Business Laptop 15.6\" FHD Display, Intel Core i5-1334U (Beats AMD Ryzen 5 7530U) 16GB RAM, 512GB PCIe SSD for Home, Student, Webcam, Numeric Keypad, Windows 11 Pro",
        "product_id": "B0F1XCVS3X",
        "price": "$484.95",
        "image_url": "https://m.media-amazon.com/images/I/71YWN-1f0xL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-250-G10-Business-i5-1334U/dp/B0F1XCVS3X/ref=sr_1_7?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-7",
        "average_rating": "3.8 out of 5 stars",
        "review_count": "4 global ratings",
        "histogram": {
            "5_star": "69%",
            "1_star": "31%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "1_star": 3
        },
        "review": [
            {
                "reviewer_name": "Sho",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 4, 2025",
                "review_text": "I am an international student who desperately needed a laptop that would ship quickly, was sturdy but not heavy, and could keep up with my workload, and this laptop checked all those boxes and more. I am honestly shocked by how quickly it shipped and arrived to me, and when I got the box, I didn't even realize it was a laptop because of how light the box was. The laptop itself is solidly built, and I love the number pad on the side. Laptop is super functional and I great product, especially for the price point. 10/10 would buy again if I ever need another laptop!"
            },
            {
                "reviewer_name": "ANT HILL",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 21, 2025",
                "review_text": "The product description/ specifications what you will receive. The keyboard is advertised as backlit but it came with standard keyboard."
            }
        ],
        "review_summary": "The laptop is impressively lightweight and sturdy, shipping quickly and offering great functionality for its price, though it may not match advertised keyboard features.",
        "review_sentiments": {
            "pos_5_aspects": [
                "BUILD_QUALITY",
                "PORTABILITY",
                "PERFORMANCE",
                "PRICE"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [],
            "neg_4_aspects": [],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY"
            ]
        }
    },
    {
        "title": "HP 14\" Ultral Light Laptop for Students and Business, Intel Quad-Core, 8GB RAM, 192GB Storage(64GB eMMC+128GB Ghost Manta SD Card), 1 Year Office 365, USB C, Win 11 S",
        "product_id": "B0B2D77YB8",
        "price": "$249.99",
        "image_url": "https://m.media-amazon.com/images/I/81divYKpeTL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Students-Business-Quad-Core-Storage/dp/B0B2D77YB8/ref=sr_1_8?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-8",
        "average_rating": "4.0 out of 5 stars",
        "review_count": "2,371 global ratings",
        "histogram": {
            "5_star": "62%",
            "4_star": "14%",
            "3_star": "7%",
            "2_star": "3%",
            "1_star": "14%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Landy amazing ",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 23, 2025",
                "review_text": "I love it"
            },
            {
                "reviewer_name": "Sherrykay Malcolm",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "I Love This Laptop"
            },
            {
                "reviewer_name": "GC",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 17, 2025",
                "review_text": "Great laptop!! Works very well for it for my husband"
            },
            {
                "reviewer_name": "Jack Oliphant",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 3, 2025",
                "review_text": "Fast delivery.Everything workedWindows 11 install worked okOnly complaint is the paucity of instructions links."
            },
            {
                "reviewer_name": "servant of God",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 10, 2025",
                "review_text": "exactly what i needed"
            },
            {
                "reviewer_name": "Natika Walker",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 3, 2025",
                "review_text": "It has taken some getting used to, but it works."
            },
            {
                "reviewer_name": "Natalie Day",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 5, 2025",
                "review_text": "Not a lot of storage space, but it works nicely and is compatible with word. Charges fast!"
            },
            {
                "reviewer_name": "Marissa Person",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on September 19, 2024",
                "review_text": "This device seems to be OK. Its a little slow. I managed to get it late last night and immediately tried to set it up. However, they do advertise that they send you a SD card with 128 gigs. It does not say that the SD card varies and they advertise a manta SD card. However, they sent me a superior pro And it sticks out about 2 mm so one of the things I advertise is the fact that they give you more storage with this SD card. I cannot use this laptop until I receive the actual SD card thats compatible and not sticking out to millimeters and not even being read by the HP.  so I technically have no extra storage because of all the updates and everything that are done prior to them sending the laptop I only have 22.5 GB available out of 57.3. I am hoping that they send the correct SD card so that way I have maximum storage as the card that they should have sent seems to be compatible with the card that they did send that I Unfortunately, cannot use. The screen quality the display is also a bit dated but for the price itll work for now as long as I get the proper SD card."
            },
            {
                "reviewer_name": "an",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on September 2, 2024",
                "review_text": "I keep getting this pop up message: Because you're accessing sensitive info, you need to verify your password. And it's greatly interfering with my work. If this isn't fixed by tomorrow, I am returning this laptop. I am not contacting customer support wasting my time. The sellers should be monitoring the reviews and they should be fixing this issue on their end which I know they are very aware of it because the issue has been reported all over the internet in various forums. I am very upset they sold me a computer with this horrible glitch.Update*** still have the same problem, along with other problems as well. This laptop is a nightmare to do my work and school work on. I am going to list problems as I go along. One of many major problems I have is that you can barely find a black space to let the mouse rest while you work without it pulling down a drop down menu. I am so sick of these menus appearing any and everywhere.Next major problem is, if you go back to delete something you've written, which is what humas do many times, the backspace and cursor jump somewhere else which makes you have to wase time, your blood pressure rises because it makes no sense of why this happens. Every single time I have to delete something I've written it becomes a major problem.Another major problem, when you are sitting down and the laptop is resting on your lap, EVERY SINGLE TIME you get up from a seated position, moving your laptop, the mouse mechanism clicks itself so your browser closes out or your mouse clicks on something and you lose where your at or wind up sending something you didn't mean to which is A BIG NO NO.I REALLY, REALLY, REALLY DISKLIKE THIS LAPTOP. HORRIBLE!I feel very badly for kids whose parents make them use this laptop. I can only imagine the poor kids losing their work or their work getting messed up through NO fault of their own but they don't know how to convey that to the parents so it winds up being the kids fault according to the parents. I already know how many arguments this laptop has caused families.There is NO reason in this day in age for a laptop to be this horrible. As I am typing now, my cursor jumps everywhere and I had to restart what I'm writing 10 different times already in the last 5 minutes. I wish I could give this laptop negative stars!!!! I wouldn't take this laptop if it were for free!"
            }
        ],
        "review_summary": "The laptop has received mixed reviews, with many users appreciating its functionality and speed, while others experience significant frustrations due to software issues, limited storage, and hardware compatibility problems.",
        "review_sentiments": {
            "pos_5_aspects": [],
            "neg_5_aspects": [
                "PERFORMANCE",
                "BUILD_QUALITY"
            ],
            "pos_4_aspects": [
                "PERFORMANCE",
                "BATTERY"
            ],
            "neg_4_aspects": [
                "PRICE"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "DISPLAY",
                "PRICE",
                "PERFORMANCE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "DESIGN",
                "PORTABILITY"
            ]
        }
    },
    {
        "title": "HP Pavilion 16 Touchscreen Laptop  Intel Core 7 150U (Beats i7-1355U)  16\" WUXGA Display  AI Copilot, Backlit  Windows 11 Pro, Office Pro Lifetime 65W GaN Charging Sky Blue  32GB RAM | 1TB SSD",
        "product_id": "B0F5G5RB8K",
        "price": "$3,799.99",
        "image_url": "https://m.media-amazon.com/images/I/71iRbtov9oL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Pavilion-Touchscreen-Laptop-Charging/dp/B0F5G5RB8K/ref=sr_1_9?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-9",
        "average_rating": "4.8 out of 5 stars",
        "review_count": "23 global ratings",
        "histogram": {
            "5_star": "93%",
            "3_star": "7%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 9,
            "3_star": 1
        },
        "review": [
            {
                "reviewer_name": "Albert Wu",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 21, 2025",
                "review_text": "I bought this laptop mainly due to its touchscreen function, which, after using it for a while, I found very convenient. Meanwhile, I am very pleased with its streamline design, backlit keyboard and lightweight build, making the laptop very stylish. Really love it so far! Money well spent."
            },
            {
                "reviewer_name": "Wan-Ting L.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 20, 2025",
                "review_text": "I needed a good computer for schoolwork and gamingthis one is awesome! It runs fast, handles all my apps, and even play games without lag. Setup was super easy, and it looks really cool too. Totally happy with it and would recommend to friends!"
            },
            {
                "reviewer_name": "STAN",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Never thought I'd use the touchscreen much, but now I'm using it daily on this HP laptop. Great for quick editis in Excel or presentations in PowerPoint. Windows 11 pro is clean and smooth to work with."
            },
            {
                "reviewer_name": "Guo L.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 10, 2025",
                "review_text": "This HP Pavilion 16 is a beast for collegeIt handle all my tabs/projects, and the 16\" touchscreen is crisp for notes or Netflix. Love the backlit keyboard for late nights, and the tiny 65W GaN charger doesnt hog space in my bag. Sky blue looks slick, and 1TB SSD means Im never deleting filesno complaints!"
            },
            {
                "reviewer_name": "Alisha",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 15, 2025",
                "review_text": "I have had several HP computers in the past and liked each one of them. This one is no different. I really like it and it is easy to use."
            },
            {
                "reviewer_name": "jsl123456",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 17, 2025",
                "review_text": "strong processor and full-size keyboard make it ideal for productivity. Not flashym but gets the job done reliably every day."
            },
            {
                "reviewer_name": "Jamal",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "built-in webcam and mic are clear. Handles video conferencing without issues."
            },
            {
                "reviewer_name": "Dennis",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 22, 2025",
                "review_text": "Handles creative software and casual gaming better than expected."
            },
            {
                "reviewer_name": "Hanno Wu",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 4, 2025",
                "review_text": "This laptop is powerful, versatile, and quite user-friendly, with a sleek design. It handles multitasking with ease, making it ideal for both work and leisure. Overall, I would say that this laptop is worthy of the money spent."
            },
            {
                "reviewer_name": "brenty411",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 18, 2025",
                "review_text": "The new price is correct. The old price of $4,200 for this is clearly a marketing tactic. Anyone who knows computer hardware knows that it doesn't make sense at all. $4,200 and no gaming chip? HA!"
            }
        ],
        "review_summary": "The laptop is highly praised for its touchscreen functionality, sleek design, powerful performance for both work and gaming, ease of use, and overall value.",
        "review_sentiments": {
            "pos_5_aspects": [
                "DESIGN",
                "BUILD_QUALITY",
                "PORTABILITY",
                "PERFORMANCE",
                "DESIGN",
                "DESIGN",
                "PERFORMANCE",
                "DISPLAY",
                "PERFORMANCE",
                "PORTABILITY",
                "DESIGN",
                "PERFORMANCE",
                "AUDIO",
                "PERFORMANCE",
                "PERFORMANCE",
                "DESIGN",
                "PERFORMANCE",
                "PRICE"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [],
            "neg_4_aspects": [],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "PRICE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": []
        }
    },
    {
        "title": "HP 17 Laptop, 17.3 HD+ Display, 11th Gen Intel Core i3-1125G4 Processor, 32GB RAM, 1TB SSD, Wi-Fi, HDMI, Webcam, Windows 11 Home, Silver",
        "product_id": "B0C3RNRB8W",
        "price": "$533.98",
        "image_url": "https://m.media-amazon.com/images/I/71u1JLlgrgL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Display-i3-1125G4-Processor-Windows/dp/B0C3RNRB8W/ref=sr_1_10?dib=eyJ2IjoiMSJ9.beRx-Y9IbVB9cCNIQEuLhQ2C4G39-pdg6aUGn7c9uAfawodyaUFB9vZWLnn06_wCrfpvGDS6a-ZtAuNk-gnkKUZJFKjn36lyTvluNlXnrAN3wg85kKt3alhYvB1Ut9ggp6j5cpavqKHmPvxoHV6nJ7VHvYiNGugeE7OKq5N_q2_4_51iY3lOOQmYgr-ByAU7ErtQJOzL-yfa5PdhVdnsCNRNiyW4BKqh61meNX8sQh4.NtXuS2w14rZsU3W3o3o_HZnTYTe4RB7_vIxA9X8Iwyw&dib_tag=se&keywords=hp+laptop&qid=1748244601&refinements=p_123%3A308445&sr=8-10",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "2,107 global ratings",
        "histogram": {
            "5_star": "69%",
            "4_star": "13%",
            "3_star": "5%",
            "2_star": "2%",
            "1_star": "11%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 1,
            "3_star": 0,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Satisfecho con el producto, cmodo",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 19, 2025",
                "review_text": "Appear de su precio bajo es un buen producto. Muy bien el rendimiento."
            },
            {
                "reviewer_name": "Arcadiana Holdings LLC",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 21, 2025",
                "review_text": "Excelent Product"
            },
            {
                "reviewer_name": "Amy Strickland",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 21, 2025",
                "review_text": "I have already bought two of these laptops for my office, and about to buy a 3rd!  The set up is ease, the screen quality is excellent. The laptop is durable and very well made. I have no complaints on this product!!!"
            },
            {
                "reviewer_name": "Majordog",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on April 4, 2025",
                "review_text": "The laptop computer came quickly, and I do like it, but it came with the wrong processor. I ordered the 11gen Intel Core i3 and the one I received has the AMD Ryzen 5.  I decided to keep it and not return it because it seems to work OK. I also decided to still give it 5 stars."
            },
            {
                "reviewer_name": "Dan L.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 4, 2025",
                "review_text": "Quick and secure."
            },
            {
                "reviewer_name": "EFL",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 26, 2024",
                "review_text": "I saw a rather harsh review for this model somewhere.  It does everything I need except would have preferred a back-lit keyboard.  It was a small sacrifice so I'm not complaining.17.3 HD+ Screen  Perfect for my old eyes.Intel Core i3-1125G4 Processor  More than fact enough for anything I have done so far.32GB RAM  I keep a PC five to ten years.  Lots of elbow room for future OS that require more elbow room.2TB SSD  I have come to adore Solid State Drives.  I doubt I will ever fill ONE TERABYTE, so I paid a bit more and bought 2TB.  I ran \"HD Tune v2.55\" just a moment ago and I see an average transfer rate of 1.3 GigaBytes / Second."
            },
            {
                "reviewer_name": "slsmith",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 28, 2025",
                "review_text": "Ive had this laptop for a few months now. The battery life has been wonderful and was the biggest issue with others previously. Super easy set up and use. The screen quality is good and no freeze. For the money, I was not expecting this laptop to be so good. My husband is a program analyst and ended up buying one as well after using mine. The size is great for travel and its really the best value."
            },
            {
                "reviewer_name": "Jeff Hitchens",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on June 3, 2024",
                "review_text": "SOME WORDS TO THE WISE. Overall, I'm satisfied with these HP17x laptops. BUT!!! There are a couple things to be WELL AWARE of, before buying. First, and FOREMOST. A word of caution! As most everyone knows, Microsoft has, for quite some time, been transitioning truly from a software company into a retail sales company. That fact is abundantly clear! Now, be well aware of what Microsoft has done in its latest versions of WIN11-HOME. Many (perhaps most???, perhaps all???) Windows11-HOME based computers are delivered with the OS in \"S-Mode.\" We run HP desktop and laptop computers exclusively, so I can speak only to my several more recent HP purchases. However, I no longer subscribe to WIN11-HOME. All of my recent purchases have been ordered with the WIN11-PRO OS. My advice to those considering buying any computer preloaded with WIN11-HOME: \"stay well away.\" \"S-Mode\", does not allow the user to load any 3rd-party software. All software must be obtained (think $$$$$) from the MS Store. While MS claims that the procedure required to exit \"S-Mode\" is quite simple, in fact, we've found that it is nearly IMPOSSIBLE!!! And, it will require the involvement of MS 'off-shore' tech assistance, which is not necessarily easily obtained. One such call that I received, after HOURS of waiting, arrived at 2AM. If buying an HP17x laptop, order with WIN11-PRO. PRO versions are not restricted by \"S-Mode\" software. Now, to the computer. Typical of HP products, this laptop is well built, with an excellent display. Ports are somewhat limited, but, for me, that is not a deal-breaker. I like having the 32GB of RAM, and at least 1TB of storage. I expect these laptops to be more than adequate into the foreseeable future. My one complaint with these, and it is critical, is that the integral cooling system is WHOLLY inadequate. When used for long periods of time, especially on mains power, which we do, these computers will run HOT!!! My take on that is, putting an engineer and an accountant together, on any design project, inevitably results in trouble. In an effort to make this laptop as slim and as light-weight as possible, the internal cooling apparatus has suffered for it. In these, the CPU does generate a lot of heat. The air duct is quite small and narrow, and the internal fan is a joke, except that it's not. So!!! Buy a serious laptop cooler, to go along with your laptop purchase. And, I don't mean one of those multi-fan, USB powered units, that generate heat to remove heat. High quality, AC/DC-adapter powered gaming type coolers are available from Amazon. You'll be happy you made the purchase. At first, battery life is quite short, but we've seen that over time (repeated charge/discharge cycles) battery life does improve some. In our case, having to use mains powered coolers, we simply use mains power for our laptops, and we don't rely much on battery power. Of course, bear in mind that having to have access to AC power does diminish the practicability of using a laptop computer, in the first place. The HP17x series are big computers with a healthy display. One minor complaint is the lack of a backlit keyboard. But, for the money (around $500), these were still a good buy."
            },
            {
                "reviewer_name": "Amazon Customer",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on September 18, 2024",
                "review_text": "I never leave reviews, especially poor reviews, but NEED to share our story in case it helps you avoid what we just experienced.DO NOT buy this laptop. The price is *amazing* for its specs, and it is indeed too good to be true. Do not repeat my mistake.It is true this laptop is on the cheaper side - that was half the draw. While $500 is not much in the grand scheme of computers, it is still a lot of money. And, for that amount, it is fair to expect the machine to work properly right out of the box.I purchased this laptop (new) as a gift for my partner, to replace their old ASUS >10 years old. It was not intended for any intensive purpose. Truly, an Internet machine.We just returned it. My partner is upset, my gift to them ruined. I am despondent.Today is Tuesday. The laptop first arrived last Monday, and I completed initial Windows setup so it would be ready to go upon presentation of the gift later in the week. No issues during Windows setup that I could discern, so I replaced the packaging and wrapped it up pretty. Yay!This is where the joy stops.Within 24 hours of my partner receiving and starting to use the laptop (Thursday), it began to blue screen. Over, and over, and over. Even if nothing was running on the laptop.Countless hours my partner spent between Friday and Monday trying to fix the issue. Interestingly, System File Checker found corruptions on this brand new machine. Odd. Anyway, factory resets and Windows 11 re-installs did not stop the BSOD's, which all but confirms a hardware problem. The dump files (countless .dmp files) suggest power/circuitry malfunction. We did everything we could to fix this problem, short of opening up the laptop itself. Additionally, when the laptop was not BSOD-ing into oblivion, it would freeze entirely. WHY? It is new.Perhaps the CPU (Intel) was faulty. I heard about problems with  recent generations, so I went with this laptop that had an earlier (12th gen) CPU. Perhaps the 32GB RAM, which led me to buy this laptop, is cheaply made and caused the problem. Perhaps some other internal defect exists that we could not identify as we did not open up the machine. We'll never know why this was happening, unfortunately, because... The other half of this quandary is that HP restricts access to advanced BIOS settings so you cannot troubleshoot or fix issues. There is no way around it. Perhaps this is to keep an unsophisticated grandma from bricking her laptop. Perhaps this creates artificial necessity for HP's customer service, for which they charge more money. It is deplorable, regardless of the reason.Beyond the defective product, equally concerning is the return policy which states that a percentage (up to 50% of purchase price!) is withheld from the refund if seller and/or manufacturer decide the problem for which you returned the machine doesn't exist, and/or they dislike having to replace the original packaging. Insult to injury: if the laptop doesn't work, YOU MIGHT NOT GET YOUR MONEY BACK after you return it. My purchase was fulfilled through PCOnline US. I reserve comments until I see whether they choose to wrongly deprive me of a full refund. Even so, the policy should be called out as arbitrary, inconspicuous, and unfair to the consumer. When you buy a good, you are entitled to perfect tender. When you do not receive what you paid for, you are entitled to a refund.IN SHORT: A new laptop with these specs should not run this poorly. Period."
            }
        ],
        "review_summary": "The laptop offers great value for its price, with good performance and screen quality, but there are concerns regarding overheating, limited ports, potential hardware issues, and a troublesome return policy.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "PERFORMANCE",
                "DISPLAY",
                "BUILD_QUALITY",
                "DISPLAY",
                "PERFORMANCE",
                "PORTABILITY",
                "PRICE",
                "BATTERY",
                "DISPLAY",
                "PORTABILITY",
                "PRICE"
            ],
            "neg_5_aspects": [
                "PRICE",
                "PERFORMANCE"
            ],
            "pos_4_aspects": [
                "BUILD_QUALITY",
                "DISPLAY",
                "PERFORMANCE",
                "PRICE"
            ],
            "neg_4_aspects": [
                "BATTERY"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PRICE"
            ]
        }
    }
]