[
    {
        "title": "HP 15.6\" Business Laptop, Free Microsoft Office 2024 Lifetime License, Copilot AI Chat, HD Touchscreen Display, Intel 6-Core i3-1215U 4.4 GHz, 16GB RAM, 1TB SSD, Long Battery Life, Windows 11 Pro",
        "product_id": "B0CWN27G3V",
        "price": "$429.00",
        "image_url": "https://m.media-amazon.com/images/I/71xEfn8Qi8L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Business-Microsoft-Lifetime-Touchscreen/dp/B0CWN27G3V/ref=sr_1_1_mod_primary_new?dib=eyJ2IjoiMSJ9.N7rPr2rJGapA16SJOTJnROnZLELqHdBGIXdfpddbnBQOqe9MbVweFvDDx-FjgPXrlqFjvFIlX8OuBjNnkVxWNBuEj5auizwjJ2AaXjp6qs-q-L8UfJrwHo3vv_Mme6rXyvD3EmiAXt2PruiufTqAVOfF06qjtf45HleYglOVWvWH0MrZCZeZTV44FbgW4_RX4AYzQQsZlQWn5PQNRw6wZN2K6_jhBEKtM1SUzvNkdqU.FsHt7T_yKjgOIgwxvu4hvoWoYeE3-nmu7lH-Qg3xzgg&dib_tag=se&keywords=hp+laptop&qid=1742567739&refinements=p_123%3A308445&sr=8-1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "103 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "15%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Kathryn Johns-Hughes",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 17, 2025",
                "review_text": "I love this computer. It was easy to set up, it came with Microsoft Office installed (make sure to decline the option to buy 365 twice). Its light but not cheap feeling.  Great value for the money."
            },
            {
                "reviewer_name": "Grandma Sue",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 14, 2025",
                "review_text": "I am pleased with the quality of this computer. Sturdy, easy to set-up, happy to have Windows 11 pro and Microsoft Office 24 included. Only been using it for a week, so hoping it will continue to work as well as it has so far. Also delivered in just 3 days of ordering. Internet speed is good even with multiple windows open at once. I'm a retiree, so no gaming just email, shopping and research. But very happy with this purchase."
            },
            {
                "reviewer_name": "Abundance",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 6, 2025",
                "review_text": "This Laptop was bought for my husband,  we went for it because of the free office.I saw some review that the free Microsoft office didn't come with a license key. But the description on the product site says it comes preinstalled so there is no need for a license key.We set up the Laptop pretty easy, the windows update tool a while but other than that set up was a breeze.If this is your personal Laptop I advise you chose personal, hold off on using your work email until you are done setting up.To get free Microsoft working; When you get to the pary where you are offered free one month 365 you should decline it, it asks you like twice or thrice using different language,  decline it every time. Once you succeed,  it will take you straight to windows and you will find your free Microsoft there and all you have to do is click on word and accept license. (Also this process helps you get off windows s mood) That way you can enjoy your Laptop.Also, if you email is already tied to a 365 account it will be wise to use a neutral email as this may interfer with you getting the decline offer button. (You must use an email to sign into the laptop)I am not sure about battery life and other functionality but so far the Laptop is working fine."
            },
            {
                "reviewer_name": "Miss Mitzi",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 24, 2025",
                "review_text": "Just what I was looking for: a light-weight HP laptop that has Microsoft lifetime non-subscription,  upgraded features. I've been satisfactorily using Windows 10 on two 17-inch laptops (an HP and a Lenovo) for several years. But when Microsoft announced not supporting WIN 10 and encouraging the installation of WIN 11, I knew I would have to \"bite the bullet\" and upgrade before I ended up having to buy Windows 11. WIN 11 comes pre-installed. I've become accustomed to using Office suites since the mid-90s (okay, okay I'm now 78).  Free pre-installation of the latest of the non-subscription Office suites (2024) was a big plus when considering the purchase of this new laptop.  I hope I'm all set for the rest of my life.  I was also looking for a laptop that--as I age--I could much more easily carry around the house than I can right now carry my 17-inchers.  (It could also be easier to carry when I pack up other personals if ever notified to evacuate due to fire, wind, or earthquake.) Also, realizing that I didn't necessarily need a 17-inch laptop any longer, I chose a less expensive 15-incher. By the way, validating the pre-installed Office 2019 is easy. Just don't hurry, read everything on the screen as you work toward validation, and you'll be done with that step in four minutes! Watch that you do not install Microsoft 365 'cause you'll have to pay for and subscribe to it. If you don't need it, then Office is truly adequate for you. The legal pre-installed version of Office 2019 is genuine Microsoft software that does not come with a product key and, therefore, it does not need to be registered with Microsoft.  (If you have an online Microsoft account, it's up to you if you want to register the laptop itself.)  One more thing, once you're done with setup process, you'll notice that OneDrive is the default for synchronizing. If you're not familiar with OneDrive, go online to understand what it's for and how it works. Contact the seller via Amazon's communication feature for anything. Just click his name on the right side of the product description page and you'll arrive at the seller's profile with the link for communication in the upper right corner."
            },
            {
                "reviewer_name": "Janis",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 4, 2024",
                "review_text": "I have only had this laptop for a short time but it is fast, Holds a charge well, the camera for meetings is great and all is good! Good value for the money!"
            },
            {
                "reviewer_name": "I mistakenly ordered large and were too big",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 17, 2025",
                "review_text": "The laptop is great but the delivery by Fedex sucks. Found my package thrown in woods down from my house. Quit using Fedex "
            },
            {
                "reviewer_name": "Alex Buttons",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "I purchased this computer for my parents as a replacement for their outdated one.  It fulfills all their basic computing needs, and I was pleased with both its affordable price and its ready-to-use condition upon arrival."
            },
            {
                "reviewer_name": "JJ",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 8, 2025",
                "review_text": "I purchased three of these laptops (1 for me and 2 for my church) to replace non-upgradeable Windows 10 computers.  The hardware configuration and features makes this a very competent laptop.  Connecting to WiFi and downloading required updates was straightforward.  Following the instructions on the OUTSIDE of the HP box for Office 2024 was confusing.  It said to skip or reject the Office 365 Trial offer which I did.  Clicking on any Office app caused a screen to appear showing Office 365 that asked me to agee to the terms of use.  Not sure if I have Office 2024 or 365, or if they are one in the same."
            },
            {
                "reviewer_name": "d double-u",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 1, 2025",
                "review_text": "It has been so long since I bought a computer, that I did not notice that this portable had no RJ-45 port. When I bought previous computers, that port was an automatic on every computer since it was the only way to connect to the internet.  I bought an adapter to get internet access even thought I do have Wi-FI but I prefer the security of a wired hook-up.  Other than not having that port, this portable has all the features I need since I also bought an Excel software versus paying for 365 every year. Perhaps when I buy my next computer in another 10 years, wireless will be as safe as wired."
            },
            {
                "reviewer_name": "Sigmada",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 18, 2025",
                "review_text": "Personal email not loading and working properly.  UGH.  365 tries to takeover.  Will be going to repair place for fix or returning. ."
            },
            {
                "reviewer_name": "Sheryl S",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 25, 2025",
                "review_text": "Buyer beware. I purchased this as a new computer. First attempt at booting, got timeout error message. Second attempt, error said there was no operating system installed, contact HP. On HP website, was able to see that the computer had less than 10 months warranty. Contacted HP, they asked the size of hard drive. When I told them it was 1TB, they said that serial number machine was not a 1TB machine when it left them in October. I purchased in January. They said Amazon upgraded it and made an error. Bottom line is machine is inoperable. They suggested purchasing from Best Buy or HP directly. This one is going back."
            }
        ],
        "review_summary": "The laptop is praised for its lightweight design, quick setup, pre-installed Microsoft Office, and good performance, although there are some concerns about the delivery service and occasional issues with the software setup.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PORTABILITY",
                "PRICE",
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PORTABILITY",
                "PRICE",
                "PERFORMANCE",
                "BATTERY",
                "AUDIO",
                "PRICE",
                "PRICE"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PERFORMANCE",
                "PORTABILITY",
                "PORTABILITY"
            ],
            "neg_4_aspects": [
                "DESIGN",
                "DESIGN"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "PERFORMANCE",
                "BUILD_QUALITY"
            ]
        }
    },
    {
        "title": "HP 14 Laptop, Intel Celeron N4020, 4 GB RAM, 64 GB Storage, 14-inch Micro-edge HD Display, Windows 11 Home, Thin & Portable, 4K Graphics, One Year of Microsoft 365 (14-dq0040nr, Snowflake White)",
        "product_id": "B0947BJ67M",
        "price": "$169.00",
        "image_url": "https://m.media-amazon.com/images/I/815uX7wkOZS._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Micro-edge-Microsoft-14-dq0040nr-Snowflake/dp/B0947BJ67M/ref=sr_1_2_mod_primary_new?dib=eyJ2IjoiMSJ9.N7rPr2rJGapA16SJOTJnROnZLELqHdBGIXdfpddbnBQOqe9MbVweFvDDx-FjgPXrlqFjvFIlX8OuBjNnkVxWNBuEj5auizwjJ2AaXjp6qs-q-L8UfJrwHo3vv_Mme6rXyvD3EmiAXt2PruiufTqAVOfF06qjtf45HleYglOVWvWH0MrZCZeZTV44FbgW4_RX4AYzQQsZlQWn5PQNRw6wZN2K6_jhBEKtM1SUzvNkdqU.FsHt7T_yKjgOIgwxvu4hvoWoYeE3-nmu7lH-Qg3xzgg&dib_tag=se&keywords=hp+laptop&qid=1742567739&refinements=p_123%3A308445&sr=8-2",
        "average_rating": "4.1 out of 5 stars",
        "review_count": "2,603 global ratings",
        "histogram": {
            "5_star": "64%",
            "4_star": "13%",
            "3_star": "7%",
            "2_star": "3%",
            "1_star": "13%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Shannon Wilkins (Visual Media Focus)",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 2, 2025",
                "review_text": "HP 14 Laptop (14-dq0040nr)  Affordable and Portable, but with Some Trade-offs Rating: 4.0/5 Pros: Affordable Price  This HP 14 laptop is budget-friendly, making it a great option for students, light users, or those in need of a secondary device. Portable & Lightweight  The thin and lightweight design makes it easy to carry around, ideal for on-the-go use. Decent Display  The 14-inch HD micro-edge display offers clear visuals, though it's not full HD. Windows 11 Home  Comes with the latest OS, which is optimized for modern applications. 1-Year Microsoft 365 Subscription  A great addition for users who rely on Word, Excel, and other Office tools.Cons: Limited Performance  The Intel Celeron N4020 processor is okay for basic tasks like web browsing, email, and document editing, but struggles with multitasking or demanding applications. Only 4GB RAM  The memory is quite low for modern standards, leading to slower performance when multiple tabs or applications are open. Minimal Storage (64GB eMMC)  The storage space is extremely limited, meaning you'll need external storage or cloud solutions for larger files. Not Ideal for Heavy Use  Not recommended for gaming, video editing, or other intensive tasks. No Backlit Keyboard  Typing in low-light conditions can be challenging.Final Verdict:The HP 14 Laptop (14-dq0040nr) is a solid choice for those needing an affordable, portable device for light tasks like browsing, streaming, and office work. However, its limited RAM and storage make it less suitable for power users or heavy multitaskers. If you need a simple laptop for everyday use and don't mind relying on cloud storage, this could be a good pickbut if you need better performance, consider upgrading to a model with more RAM and SSD storage."
            },
            {
                "reviewer_name": "HCO3",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 22, 2025",
                "review_text": "I got this laptop for use while traveling. Will not use it for demanding software. It's slow. but in the acceptable range. It comes with Windows 11 Home in S mode. S mode limits the software you can use to those available in the Microsoft store. It wouldn't let me use LastPass or Dropbox. It came with Dropbox for S mode, but I couldn't get it to run.I removed S mode - once it's gone it can't be restored - and Dropbox and LastPass ran fine as did Chrome. It took several hours for Dropbox to sync my files, but it did so effectively. Thus, I have access to everything on my hard drive at home. I plugged in a tiny Samsung 256 GB flash drive (it costs $22 on Amazon) into a USB port and now I have far more storage than I'll ever need on this computer. The drive is so small that I'll leave it there for the life of the computer.All the programs I'll need when away from home run on this device. I wouldn't try to use it for gaming, but as a work away-from-home laptop for relatively simple tasks, it does the job at a very affordable price."
            },
            {
                "reviewer_name": "charlotte e gray",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 17, 2025",
                "review_text": "A real deal on a top flight brand of computer.  Lightweight, fully loaded, easy to use, has lots of helps.  Wireless built in, great screen size. Love it!"
            },
            {
                "reviewer_name": "Placeholder",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "Great laptop for the money. Does everything I need and then some. Very fast and responsive to the network. I highly recommend for a medium level lap top."
            },
            {
                "reviewer_name": "Linda Samplawski",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 12, 2025",
                "review_text": "This is a great deal for the money. I bought it for my granddaughter for her birthday and she loves it. Its slim, its lightweight and easy to set up."
            },
            {
                "reviewer_name": "Crystal",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 21, 2025",
                "review_text": "I like this laptop. I just need it to do online work and so far its doing a good job. Ordered today and received it today. Im very happy. And the color is so clean. Never had a white laptop before. Im just going to call this my late Valentines Day gift to myself "
            },
            {
                "reviewer_name": "Alana",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 19, 2024",
                "review_text": "Its a computer for $100 give or take. You really can expect only so much out of it. It does the trick. Only issue to me its that its a pain in the butt do download google chrome on it, which, I wouldnt care about using necessarily however apparently a lot of programs online only work with chrome. Not a dealbreaker though. Its a little slow but she gets the job done. If you want a computer to blow you away with how great it is, spend some more money and get a better one. BUT if you need a nice little laptop to get the essentials done, this will do the trick. But if youre going to get all nitpicky then invest some more cash in a different computer."
            },
            {
                "reviewer_name": "Jackie Glenn",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 18, 2025",
                "review_text": "You get what you pay for. This has a very sleek look but runs so slow. You have to be patient with this one but it will get the job done eventually."
            },
            {
                "reviewer_name": "Allan R",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 20, 2022",
                "review_text": "This is a shockingly terrible computer.  The look and feel is extremely cheap.  The thing felt incredibly flimsy, and the entire keyboard could be pushed in without much effort.  Awkward feeling keyboard feel and layout too.  The screen quality was awful.  If you weren't looking at the exact perfect angle, the screen would appear faded out and the color would change.  It has an extremely narrow range of viewing angles.  I could never adjust my eyes to the color, and photos would look simply terrible.  My Chromebook has vastly superior color rendering, and the screen looks good at a wide range of viewing angles.  The resolution was purported to be 1080, but the pixels seemed very large and most things appeared \"blocky\".  But the worst part of this computer was the performance.  Unbelievably slow!  Web pages would take forever to load, text would come in, and a bunch of white boxes would appear on screen until each image would load.  It is not my connection either, as I ran this computer right next to my Chromebook, which had none of these loading problems.  This computer was so slow that it would literally hang up while I was typing!  I would start to type a sentence, and nothing would happen on screen, then a few seconds later, the words would start to show up.  I closed everything but one web browser to compose an email, and I could not write simple text without the computer lagging behind.  It was beyond terrible to the point I may have just gotten a lemon.  But if this was not a broken machine, it's the worst computer I have ever used.  Returned it less than a week after using, I was fed up!"
            }
        ],
        "review_summary": "The laptop is an affordable and portable option suitable for basic tasks, but it faces significant limitations in performance, storage, and build quality, making it less ideal for heavy users.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "PORTABILITY",
                "DISPLAY",
                "PORTABILITY",
                "PRICE",
                "PORTABILITY",
                "DISPLAY",
                "PERFORMANCE",
                "PRICE",
                "PORTABILITY"
            ],
            "neg_5_aspects": [
                "BUILD_QUALITY",
                "DISPLAY",
                "PERFORMANCE"
            ],
            "pos_4_aspects": [
                "PERFORMANCE",
                "PRICE"
            ],
            "neg_4_aspects": [
                "PERFORMANCE",
                "PERFORMANCE"
            ],
            "pos_3_aspects": [
                "DESIGN"
            ],
            "neg_3_aspects": [
                "PERFORMANCE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": []
        }
    },
    {
        "title": "HP 17.3\" Business Laptop Computer, 64GB RAM 2.2TB Storage (2TB SSD+256GB Docking Station Set), 10-Core Intel Core i5, Windows 11 Pro Laptop with Microsoft Office License Included, PLUSERA Earphones",
        "product_id": "B0DTRQSHXJ",
        "price": "$899.00",
        "image_url": "https://m.media-amazon.com/images/I/81p4kEKMbtL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Business-Computer-Microsoft-Earphones/dp/B0DTRQSHXJ/ref=sr_1_3?dib=eyJ2IjoiMSJ9.N7rPr2rJGapA16SJOTJnROnZLELqHdBGIXdfpddbnBQOqe9MbVweFvDDx-FjgPXrlqFjvFIlX8OuBjNnkVxWNBuEj5auizwjJ2AaXjp6qs-q-L8UfJrwHo3vv_Mme6rXyvD3EmiAXt2PruiufTqAVOfF06qjtf45HleYglOVWvWH0MrZCZeZTV44FbgW4_RX4AYzQQsZlQWn5PQNRw6wZN2K6_jhBEKtM1SUzvNkdqU.FsHt7T_yKjgOIgwxvu4hvoWoYeE3-nmu7lH-Qg3xzgg&dib_tag=se&keywords=hp+laptop&qid=1742567739&refinements=p_123%3A308445&sr=8-3",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "13 global ratings",
        "histogram": {
            "5_star": "48%",
            "4_star": "22%",
            "3_star": "30%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 5,
            "4_star": 2,
            "3_star": 3
        },
        "review": [
            {
                "reviewer_name": "andy rentfrow",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 16, 2025",
                "review_text": "works like it it is supposed to"
            },
            {
                "reviewer_name": "Lester Robertson",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on August 22, 2022",
                "review_text": "It's a great laptop with all the features that you need that you need to do just about anything from school work to home to business"
            },
            {
                "reviewer_name": "Lisa Wilson",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 28, 2025",
                "review_text": "Just received my laptop, I cannot give 5 stars as it's still charging and I have not set up. However, it came with a set of ear buds, they are pink. As this is a laptop for my husband is there anyway to get a black set?"
            },
            {
                "reviewer_name": "EmilyOblad",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 7, 2025",
                "review_text": "You know it is a laptop, works like a laptop. Just not what I expected for a $900 laptop.Quality is kind of low. Instead of metal is hard plastic. The screen is poor quality.Otherwise its a HP laptop and works as such."
            },
            {
                "reviewer_name": "Eva R Garst",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 13, 2025",
                "review_text": "These laptops do not have HP warranty.  I believe this dealer is shipping rebuilt computers and selling them as new computers.  I checked on one of the laptops  through the HP support site. HP states there is no warranty!!!"
            }
        ],
        "review_summary": "The laptop performs adequately for most tasks, but has quality concerns including inferior materials and potential lack of warranty.",
        "review_sentiments": {
            "pos_5_aspects": [],
            "neg_5_aspects": [],
            "pos_4_aspects": [],
            "neg_4_aspects": [],
            "pos_3_aspects": [],
            "neg_3_aspects": [
                "BUILD_QUALITY",
                "DISPLAY"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": []
        }
    }
]