[
    {
        "title": "Lenovo Gen 12 ThinkPad X1 Carbon Laptop with Intel Ultra 7 165U vPro Processor, 14\" WUXGA 100% sRGB Touchscreen, 32GB 6400MHz RAM, 1TB Gen4 Performance SSD, FHD+ IR+ RGB Camera, and Windows 11 Pro",
        "product_id": "B0D1D5J1J1",
        "price": "$1,549.99",
        "image_url": "https://m.media-amazon.com/images/I/61GSvJjxBuL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Lenovo-ThinkPad-Processor-Touchscreen-Performance/dp/B0D1D5J1J1/ref=sr_1_1?dib=eyJ2IjoiMSJ9.aywXuoYbAww-vQR-zlfhy9Vb-kRmF8IoCsWeU_OduY-OTAh2jQNR-ymGM3A8MwnU46CbgTvsy7D3fHh97jya5DaQqZx5Gg3n2CNrcSG6mlN8trUge5qaLrfej_8nHWtt6JjOgXs8GsgqYGC_slq7TQHqpZWFt5xqP_k9lB73VCAQyQebAmUqLME98QPi6g8htf99CBdMpMOlYI4gVzOi0KnE7-LaW2QsyR2NcnUGOoc.gvhYZxOtXniGWN8BZzqrIRWVeGxmN56wCkVBk98D9sE&dib_tag=se&keywords=lenovo+laptop&qid=1742568364&refinements=p_123%3A391242&sr=8-1",
        "average_rating": "4.7 out of 5 stars",
        "review_count": "38 global ratings",
        "histogram": {
            "5_star": "89%",
            "4_star": "5%",
            "1_star": "6%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 9,
            "4_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Brian",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 17, 2024",
                "review_text": "I had an X1 Carbon a few years ago and was impressed.  I bought this latest model and I am blown away by the performance and the high quality of the PC.  Everything about it is five stars.  I highly recommend this laptop if you want great performance and the best quality you can find."
            },
            {
                "reviewer_name": "Chloe",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 6, 2025",
                "review_text": "Very happy with this, upgrading from a Gen 9 X1 Carbon to this. Feels very familiar, was able to drop right in and be comfortable with the size, feel of the keyboard, mousepad, etc. I use this to run dual monitors and a few USB devices, so it's nice to have all the ports right there since I don't use a base. I'm only a day in with this model, but since I liked my previous version, I'm expecting good things from this."
            },
            {
                "reviewer_name": "F Fahey",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 22, 2025",
                "review_text": "I was looking for a light-weight laptop for word processing and communication at a decent price. The Lenovo Gen 12 Thinkpad arrived a few weeks ago, and, so far, it has been exactly what I was looking for."
            },
            {
                "reviewer_name": "dhb",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 15, 2025",
                "review_text": "The best keyboard of any PC or Mac. Great screen. Lots of memory. Long lasting charge. High quality build. (you can actually stand on it!)It also provides both the TrackPoint and TrackPad pointing devices. I find the Track Point to be more precise and intuitive, (it's' that iconic red dot in the middle of the keyboard) so I disabled the trackpad. The TrackPad is Lenovo's name for the pointer that every other notebook uses.The only downside is that is a little heavier than similar models from other brands."
            },
            {
                "reviewer_name": "Jerry Hooper",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 27, 2024",
                "review_text": "Have a family member that needed a powerful, fast, portable PC for work.  This fit the bill perfectly..."
            },
            {
                "reviewer_name": "Francis",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 25, 2025",
                "review_text": "Extremely dependable, setup is straightforward, fantasic value, fantastic screen quality This was my second purchase to replace older units."
            },
            {
                "reviewer_name": "Francis",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 12, 2024",
                "review_text": "I have large spreadsheets which took several minutes to update on my old Toshiba.This Lenovo Thinkpad is much faster."
            },
            {
                "reviewer_name": "Ashley Vallee",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 21, 2025",
                "review_text": "The laptops are always great that we get from Amazon, exactly as shown in picture and description.  the value for the money is great"
            },
            {
                "reviewer_name": "Hannah",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 27, 2025",
                "review_text": "Super light weight. Easy to set up. I tripped up some concrete stairs on the first day having it and no issuesI bought this one because I commute by bike and didnt want a mega laptop on my back. Coupled with the port and a 1TB external drive, I dont even miss having a CPU."
            },
            {
                "reviewer_name": "Brandon Nessen",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 4, 2024",
                "review_text": "The facial recognition and fingerprint access features do not work. Lenovo was unable to address it even though the computer is under warranty and transferred me to a service that would charge additional fees to investigate the problem. Very disappointing and I'll be looking elsewhere for a new computer next time."
            }
        ],
        "review_summary": "The laptop impresses users with its high performance, quality build, and convenience for multitasking, though some have encountered issues with biometric features.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PERFORMANCE",
                "BUILD_QUALITY",
                "PORTABILITY",
                "PRICE",
                "DISPLAY",
                "BATTERY",
                "BUILD_QUALITY",
                "PERFORMANCE",
                "PORTABILITY",
                "PERFORMANCE",
                "DISPLAY",
                "PRICE",
                "PERFORMANCE",
                "PRICE",
                "PORTABILITY"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [],
            "neg_4_aspects": [],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BUILD_QUALITY"
            ]
        }
    },
    {
        "title": "Lenovo Legion 5i - 16 Display - Intel Core i9-14900HX - NVIDIA GeForce RTX 4070-32GB RAM - 512GB SSD - G-SYNC - Windows 11 Home - USB-A and USB-C Ports - Privacy Shutter Camera - Luna Grey",
        "product_id": "B0CZ28Z4LY",
        "price": "$1,560.01",
        "image_url": "https://m.media-amazon.com/images/I/815yFskJwhL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Lenovo-Legion-i9-14900HX-4070-32GB-USB/dp/B0CZ28Z4LY/ref=sr_1_2?dib=eyJ2IjoiMSJ9.aywXuoYbAww-vQR-zlfhy9Vb-kRmF8IoCsWeU_OduY-OTAh2jQNR-ymGM3A8MwnU46CbgTvsy7D3fHh97jya5DaQqZx5Gg3n2CNrcSG6mlN8trUge5qaLrfej_8nHWtt6JjOgXs8GsgqYGC_slq7TQHqpZWFt5xqP_k9lB73VCAQyQebAmUqLME98QPi6g8htf99CBdMpMOlYI4gVzOi0KnE7-LaW2QsyR2NcnUGOoc.gvhYZxOtXniGWN8BZzqrIRWVeGxmN56wCkVBk98D9sE&dib_tag=se&keywords=lenovo+laptop&qid=1742568364&refinements=p_123%3A391242&sr=8-2",
        "average_rating": "4.0 out of 5 stars",
        "review_count": "88 global ratings",
        "histogram": {
            "5_star": "64%",
            "4_star": "11%",
            "3_star": "7%",
            "1_star": "18%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "1_star": 2
        },
        "review": [
            {
                "reviewer_name": "Spills",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 7, 2024",
                "review_text": "So while the price of a little over 1,400 was a little on the cheaper side for a 40 series gaming laptop (which is what I was looking for) I was a bit hesitant because going through the store page it left some things not mentioned that made me question if I could trust this seller for such a big ticket purchase.Add that there were no reviews at the time and that just increased my anxiety.But I pulled the trigger and I am glad I did.I have been putting it through its paces for about a week now and love the performance bump I get from my previous 3060 laptop.So a few things that you may be interested in.First the display runs up to 165hz which isn't mentioned in the above page....this is more then I was willing to settle for and was happy to see it was above 120hz.It does have a second ssd slot for expansion which I added my 2tb from my old laptop....its a 2 minute install, very easy.Comes with a 4070 and a 14650hx cpu as advertised.Runs fantastic and Lenovo thankfully lets you press the gpu/cpu if your willing to do so right in there own program which lets you overclock if you want.The fan noise is perfectly in range when it is full blast and the laptop stays cool for a gaming laptop.Havent had an throttling or any issue with the way its designed.The laptop came double boxed so its not screaming to have someone walk off with it on your porch and the laptop box has an armory of foam securing and protecting it....I'm not one not to complain when I think something I purchase falls short....but for the life of me I simply haven't had a single negative issue with this laptop as of now....everything gets a checkmark and Im not new to gaming laptops....I know in general what is considered a pro or con.I suppose if you want an aluminum chasses like my older msi stealth that could be considered a con....but that one cost me $600 more and the hard plastic chasses on this is thick and durable....the inside is what counts and this laptop does gaming justice.I have no hesitation recommending it to anyone who wants a middle top of the line current series gaming laptop....this is a great choice!"
            },
            {
                "reviewer_name": "Totally satisfied with the laptop",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 4, 2024",
                "review_text": "I was looking for a good offer in a gaming laptop this last prime and I found this one for an incredible price to be honest. I was a little scared because it was the very first time that I ordered something like this online and some of the reviews made me feel insecure about this purchase, however I decided to trust and I ordered, now I can say that this is my best purchase ever. It has everything I want, It runs whatever game you want, the fans do their work perfectly, keeping the laptop in the perfect temperature (I was thinking of buying a cooling pad before buying the laptop just in case but this is not necessary at all, instead of that Im buying a 2TB SSD, thats the only thing youre gonna need if you want to download heavy programs). The laptop looks beautiful, I love the color, the details, the screen size, also the keyboard looks beautiful with the RGB and it is really soft when you type. So basically, if youre are looking for a top gaming laptop, I really doubt youre gonna find something better for this price, for me its an absolute YES, youre not gonna regret."
            },
            {
                "reviewer_name": "Henry M.",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 16, 2025",
                "review_text": "NO recomiendo compar este producto en esta seccion en especifico ya que como que es una loteria. En mi caso mi laptop solo a mostrado inestabilidad de la vram con short de youtube (estos de por si funcionan mal) pero por suerte solo es eso en ese caso especifico. Esto se vende como nuevo pero puede que sean productos reparados o que fuero devueltos y amazon esta intentando darle salida. lo que no entiendo es porque no simplemente manda a revicion el producto y lo reparan y lo venden como reparado-como nuevo. Si tienes oportunidad de devolverlo por que vives en EEUU puedes probar suerte. Si eres de fuera de EEUU mejor no te la jueges.Por otro lado la laptop es muy buena, tiene buen redimiento en todos mis juegos y lo mejor es que no se apaga por sobre temperatura como la HP Victus 16 que usaba para jugar. Para los que tienen esta lenovo les recomiendo configurar la patalla a 1920x1200  a una escala de windows a 125% esta es la resolucion mas adecuada para el tamao de la pantalla y no la recomendada de 2560x1600 por que hace que toda la interfas sea muy pequea. Recomiendo que uses una escala donde los iconos de windows sean del tamao de la llema de tu dedo.Un problema que siendo que es un fastidio es que la laptop se prende mientras esta guardad en un bulto o mochila, es decir, esta suspendida y con el movimiento esta se prende y comienza a calenta y a calentarse hasta que se activa la proteccion termica... asi que apagenla (aunque realmente lo que hace la lapto es hibernar) cuando la quieran transportar."
            },
            {
                "reviewer_name": "Kinsy",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 12, 2025",
                "review_text": "I have had this laptop for a year. I have had no issues with it. It does everything I need it to do. No complaints!"
            },
            {
                "reviewer_name": "Monsiuer Anime",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 3, 2025",
                "review_text": "This thing is an absolute beast of a machine. it's my current laptop and it has not let me down in any way shape or form. from gaming to schoolwork to video conferencing, this might be the best PC I have owned this far."
            },
            {
                "reviewer_name": "Frequent Amazon Buyer",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 16, 2025",
                "review_text": "Good experience. Liked it so much. I bought my wife one."
            },
            {
                "reviewer_name": "Nick",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 12, 2025",
                "review_text": "If you are looking for a mobile powerhouse, this laptop is for you. However, dont buy this expecting good battery life, you get around 3 hours of basic web use before it shuts down."
            },
            {
                "reviewer_name": "Zoro",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 5, 2025",
                "review_text": "Now this thing is amazing it plays better then my going to be really outdated desktop PC. Only thing that leaves it from being 5 stars is it comes with McAFee or whatever its called and even if you try to uninstall it it stays on your laptop. What I read was you have to make a account and ask the server to fully uninstall it, now that should illegal if anything being forced to make a account for a product you have no intention of using."
            },
            {
                "reviewer_name": "Lezlee",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 14, 2024",
                "review_text": "This is a very solid laptop. Absolutely beautiful. However, the unit I recieved had power issues. Out of the box the battery was dead (that's fine). Connecting it to the wall for power it took several tried to power on. On a full battery it refused to power on. After some research I did what is called a power purge. Sadly this had to be repeated several times before it would boot up completely. Then it finally stopped charging. This happened within 3 days of receiving it. I had a lot of issues trying to get it back to Amazon.com I eventually got through after speaking to 4 \"human\" CSRs including a supervisor.3 of the 4 refused to assist with a refund. Amir, one of the reps helped me as the laptop was sent back to amazon well within the window of return. I now own the Legion 7i which I got elsewhere. I'm a buyer outside of the US fyi."
            },
            {
                "reviewer_name": "Vince Serafini",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on September 27, 2024",
                "review_text": "Order the computer.  Received the computer.  Packaging was fine.  Used the computer.  Noticed that the power cable was not charging.  Contacted Amazon and Lenovo about just looking for a replacement power cable because the one provided did not work.  Got the run around by Amazon and Lenovo. Since I didn't purchase a \"premium warranty\" not much they could do.  I said- how about sending me correct working parts.  Didn't think you needed a warranty on something you received a day ago and didn't work from opening it.  Not like I'm trying to scam something 90 days in.  So I guess I'll figure it out myself.  I'll go with Dell next time,  since they stand behind their product."
            }
        ],
        "review_summary": "The laptop offers excellent gaming performance, a beautiful design, and strong cooling capabilities, though some users have reported issues with power and customer service experiences.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "PERFORMANCE",
                "DISPLAY",
                "BUILD_QUALITY",
                "PRICE",
                "PERFORMANCE",
                "BUILD_QUALITY",
                "DESIGN",
                "DISPLAY",
                "PERFORMANCE",
                "DISPLAY",
                "PERFORMANCE",
                "PORTABILITY"
            ],
            "neg_5_aspects": [],
            "pos_4_aspects": [
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "BATTERY"
            ],
            "pos_3_aspects": [
                "PERFORMANCE"
            ],
            "neg_3_aspects": [
                "BUILD_QUALITY"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "BATTERY",
                "PERFORMANCE",
                "PORTABILITY"
            ]
        }
    },
    {
        "title": "Lenovo V-Series V15 Business Laptop, 15.6\" FHD Display, AMD Ryzen 7 7730U, 40GB RAM, 1TB SSD, Numeric Keypad, HDMI, RJ45, Webcam, Wi-Fi, Windows 11 Pro, Black",
        "product_id": "B0D3JLHQ8K",
        "price": "$599.00",
        "image_url": "https://m.media-amazon.com/images/I/71TN6dLVcsL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/Lenovo-V15-Business-Display-Numeric/dp/B0D3JLHQ8K/ref=sr_1_3?dib=eyJ2IjoiMSJ9.aywXuoYbAww-vQR-zlfhy9Vb-kRmF8IoCsWeU_OduY-OTAh2jQNR-ymGM3A8MwnU46CbgTvsy7D3fHh97jya5DaQqZx5Gg3n2CNrcSG6mlN8trUge5qaLrfej_8nHWtt6JjOgXs8GsgqYGC_slq7TQHqpZWFt5xqP_k9lB73VCAQyQebAmUqLME98QPi6g8htf99CBdMpMOlYI4gVzOi0KnE7-LaW2QsyR2NcnUGOoc.gvhYZxOtXniGWN8BZzqrIRWVeGxmN56wCkVBk98D9sE&dib_tag=se&keywords=lenovo+laptop&qid=1742568364&refinements=p_123%3A391242&sr=8-3",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "166 global ratings",
        "histogram": {
            "5_star": "68%",
            "4_star": "13%",
            "3_star": "5%",
            "2_star": "2%",
            "1_star": "12%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 1,
            "3_star": 0,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "crasagam",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "Looks great, worked right out of the box after setup (easy setup if you're used to these things).  Performance was what I hoped for - nice and quick, the screen looks good, I'm a fan of these Lenovo keyboards (some are, some aren't - I am).  Over all very pleased with the purchase."
            },
            {
                "reviewer_name": "Chris Goggins",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 8, 2025",
                "review_text": "This is overall great.  The amount of RAM & Hard drive space was fantastic.  It's super light, too.  What I DISLIKE about it, but won't ding a star for it, is it is not touch screen & doesn't have a back lit keyboard.  These things should be standard nowadays!  Also, the ad shows a round 4mm charging port plus the USB-C port.  But when I got the laptop, the charger was USB-C.  This is a problem if you use a docking station or multi screen, which uses that port too.  I wish it had an extra 2nd USB-C port, and also I had to spend extra $10 for an adapter to make the charging cord use that 4mm port, to free up the 1 USB-C port for my extra screens.  I should ding a star for that, because it's basically false advertising.  If your cord is USB-C, then say that in your ad, don't show diagram showing 4mm port & then send a USB-C cord.  Charge an extra $10 and include an adapter & allow the consumer to use either port.  But \"overall\" the amount of RAM, Hard drive & the CPU being I7 just makes this the newest top notch components.  I feel I'll get great usage for years to come, so I will still give 5 stars.  Hope this honest review helps buyers.  (PS, get Amazon's extra 2 screen adapter & it gives you 3 screens and it's portable & AWESOME!)"
            },
            {
                "reviewer_name": "Elizabeth Phelps",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 9, 2025",
                "review_text": "Overall it is a great tool.  keyboard is easy to use which isn't always the case."
            },
            {
                "reviewer_name": "Frank",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 2, 2025",
                "review_text": "I'm pretty happy with this laptop. I've had no problems with it so far. It looks nice, has good performance, runs for a long time on the battery, and is definitely a good value for the price I paid."
            },
            {
                "reviewer_name": "Solid performance for work",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 14, 2025",
                "review_text": "Pleased with this laptop so far. Im running a docking station with 3 external monitors, other peripherals. Screen is not the brightest but I knew that going in. Boots up and runs quickly. Doesnt flinch with many programs/apps open. Great results for the $."
            },
            {
                "reviewer_name": "Jefferson Klauss",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "Good response. Better cost x benefitsNot for games, however for programming and BI is perfect"
            },
            {
                "reviewer_name": "Brad Puma",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 6, 2025",
                "review_text": "Great laptop bought this for my son in school he loves it and it has been excellent for him."
            },
            {
                "reviewer_name": "Rick Wilson",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on October 10, 2024",
                "review_text": "Product is a great product. The only problem is when I registered the laptop at Lenovo, I found out that 1 month of the warranty had already expired. I only have eleven months left. It made me wonder if the laptop was a return, re-formatted, and re-sold.I did notice the seal on the box was broken indicating someone had opened it before it was shipped, or it was inspected during shipment.  This was also another indication the laptop was tampered with or was re-formatted because it was a return.The computer seems to working fine, so I intend keeping it. I would caution anyone before purchasing from the vendor."
            },
            {
                "reviewer_name": "kate murphy",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on August 13, 2024",
                "review_text": "The camera does not work.  I spent hours attempting to get ahold of tech support to see if I was missing something.  It has a slide lock yet even when moved, there is just a blur.  The volume is very low and if there is any sound level changes, it is hard to listen to other person.  The microphone while on Zoom has a red exclamation mark, and no idea how to remove it as it is not muted.  Maybe only techies purchase this brand, it was my first and unfortunately will be my last.  Back to a more reliable brand.  Does have great storage. And is fast and great colors."
            }
        ],
        "review_summary": "The laptop offers excellent performance, a lightweight design, and good storage capacity, but users have raised concerns about issues like the lack of a touch screen, a misleading charging port design, and problems with the camera and microphone.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PERFORMANCE",
                "DISPLAY",
                "PORTABILITY",
                "PERFORMANCE",
                "PERFORMANCE",
                "BATTERY",
                "PRICE",
                "PERFORMANCE",
                "PRICE",
                "PRICE",
                "PERFORMANCE"
            ],
            "neg_5_aspects": [
                "AUDIO"
            ],
            "pos_4_aspects": [
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "BUILD_QUALITY",
                "PRICE"
            ],
            "pos_3_aspects": [],
            "neg_3_aspects": [],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "DISPLAY",
                "PERFORMANCE"
            ]
        }
    }
]