[
    {
        "title": "HP Stream 14\" HD BrightView Laptop, Intel Celeron N4120, 16GB RAM, 288GB Storage (128GB eMMC + 160GB Docking Station Set), Intel UHD Graphics, 720p Webcam, Wi-Fi, 1 Year Office 365, Win 11 S, Gold",
        "product_id": "B0CZL2SLCJ",
        "price": "$309.00",
        "image_url": "https://m.media-amazon.com/images/I/61QuxlKVZbL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Stream-BrightView-N4120-Graphics/dp/B0CZL2SLCJ/ref=sr_1_1?dib=eyJ2IjoiMSJ9.qy3vRYf_Xs1hn4SacKtXFeRmgXLNOf6yY4SKH6y-8nBasVg940GTC33DWvkfKtMBErTkp9MbrB5W6usmIE0YE0OnqgbNUkIvLFP_BNq6k6cB23fL6a7XN3JZShNSZXp0i4r7ag1nk-ZyGxF1_FGnM-Gip1g3tIT8IQe1QLYoprgOPbtvg8YesOu-5NUiDO-t8x2BKVlP3buILeSJObKNbuYUJ0M7c3KmwywdZdzcALI.HflJk_toEPbV6Jp_XvwvJnFGCDpfGz8u4fRtQH3vYvk&dib_tag=se&keywords=hp+laptop&qid=1742382331&refinements=p_123%3A308445&sr=8-1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "2,425 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "15%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Julie Loerwald",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 15, 2025",
                "review_text": "The HP Stream 14\" HD BrightView Laptop is a budget-friendly device designed for basic tasks such as browsing, emailing, and word processing. With its sleek silver design and impressive specs, this laptop is an excellent option for students, professionals, and anyone looking for an affordable yet reliable device.*Pros*1. *Affordable*: The HP Stream 14\" is an excellent value for its price, offering a range of features and specs that rival more expensive laptops.2. *Impressive Performance*: The Intel Celeron N4120 processor and 16GB RAM provide smooth performance for basic tasks, making it ideal for everyday use.3. *Ample Storage*: The combination of 128GB eMMC storage and a 160GB docking station set provides plenty of space for files, documents, and multimedia content.4. *Long Battery Life*: The HP Stream 14\" offers up to 14 hours of battery life, making it perfect for on-the-go use.5. *Office 365 Included*: The laptop comes with a 1-year subscription to Office 365, providing access to popular productivity apps like Word, Excel, and PowerPoint.*Cons*1. *Limited Upgrade Options*: The laptop's storage and RAM are soldered, making it difficult to upgrade or repair.2. *Basic Graphics*: The Intel UHD Graphics are sufficient for basic tasks but may struggle with demanding graphics-intensive applications.3. *720p Webcam*: The webcam resolution is relatively low, which may affect video conferencing quality.*Verdict*The HP Stream 14\" HD BrightView Laptop is an excellent choice for anyone seeking an affordable, reliable device for basic tasks. While it may not excel in demanding tasks or graphics-intensive applications, its impressive performance, ample storage, and long battery life make it a great value for its price.*Rating*: 4.5/5 stars*Recommendation*This laptop is ideal for:- Students seeking an affordable device for schoolwork- Professionals requiring a basic laptop for email, word processing, and browsing- Anyone looking for a reliable, easy-to-use device for everyday tasksHowever, if you're a gamer, graphic designer, or require a laptop for demanding tasks, you may want to consider other options."
            },
            {
                "reviewer_name": "A. Smieja",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 19, 2025",
                "review_text": "I've had it now for a while but just started using it full time.  Great little laptop and very lightweight.  The only thing I've noticed is that the left-hand shift key has gotten stuck a few times and all my letters stay upper case.  Battery life has been awesome so far, but all laptops start out that way.  We'll see."
            },
            {
                "reviewer_name": "rick ellen mcintyre",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 18, 2024",
                "review_text": "list of reasons why this deserves 5 stars.1. looks cool.  it looks like carbon fiber.2. it's really fast.  don't know if it's because of the 16 gigs of ram or the 4 core processor but  it's really quick.3. the price.  this cost a little more than a notebook and you get a lot for it.4. all the connections i needed. .  hdmi for a second monitor ,  high speed 3.0 usb's to run my interface and a 3.0 usb-c.5. the hotface usb hard disc and power hub are really handy.  thanks for the great deal"
            },
            {
                "reviewer_name": "KKN",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 29, 2025",
                "review_text": "This is what I was looking for.  Price point, simple, compact, decent speed.  I use HP at home and at work for 20ish years.  Only had one hardware issue in all those years which was covered by warranty.  All else was replaced due to age."
            },
            {
                "reviewer_name": "Haylee Hanzel",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 10, 2025",
                "review_text": "So cute, my fav HP by fav!"
            },
            {
                "reviewer_name": "Wislineda soly",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "It’s very good, I don’t regret I bought it, it gave me a lot of good service, if you’re looking for a good laptop, l advise you to get one, you’ll be satisfied thank you"
            },
            {
                "reviewer_name": "Leighton",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 21, 2025",
                "review_text": "The HP Stream 14\" Laptop is a solid option if you need a basic laptop for light use. It offers excellent value for the price, especially with 16GB of RAM and 288GB of storage. However, if you need more power for intensive tasks, you may want to consider a more powerful machine. It’s a great choice for students or anyone looking for a low-cost, everyday laptop."
            },
            {
                "reviewer_name": "MelloPi",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 25, 2024",
                "review_text": "Windows S Mode and McAfee are glitchy performance killers and restrictive applications.  Switching out of Win 11 S mode should be a straight forward process but it just does not work as it should, along with McAfee installed, whether you want it or not.  McAfee acts like a worm virus, intrusively imbedding itself deep into system architecture instead of being a gate keeper like other anti-virus apps.  Windows S Mode dose not allow you to install and run any app that is not Microsoft verified and found on the Microsoft Store.  In S Mode, you cannot install and run any browser other than MS Edge or Bing.  There is an app within the MS Store to switch out of S mode but it will not work because, I suspect, of the bloated software that launches when you first turn on and set up this laptop.  Switching out of S Mode is permanent.  All the advise and direction I found to get this switch to work had failed.  Lots of frustrated people out there with the same issue.  I finally got MS Support on the phone and they told me this is a very common problem with this product and the only way to resolve it was to reset the PC.  A total reset, wiping the OS and all files you may have added.  No big deal as this is a new PC and I did not transfer anything from my old PC.  After the PC was reset, I was able to switch out of S mode so that I now have Win 11 Home instead of Win 11S Home.  At the same time, a McAfee install popup was automatically prompted so I could select Do Not Install.  This was all a bit of a pain but other than that, this laptop is not so bad.  The display colors are not as vibrant as I hoped but with a resolution of only 1365 x 768, I should have expected that.  However, the graphics display very well on a connected higher resolution monitor and it handles steaming video from Amazon Prime Video beautifully.  I hope this information can help someone avoid the frustration of dealing with what was intentionally sold as a very restrictive operating environment.  Getting rid of S Mode and McAfee gives you back unrestricted use of your laptop.One more annoying detail is that, by default, this operating environment is set to save everything to the MS cloud. The default storage of Document, Downloads, Pictures, etcetera, are all MS cloud folders which is where every file is stored unless you go through a few more clicks to store the files on your local laptop drive.  By default, initially you cannot even boot up this laptop without entering your MS PIN to log onto your laptop, and thereby logging into your MS account at the same time.  I found this a bit presumptuous that MS thought this was a good idea.  Perhaps good for their own marketing efforts though, as some bot scans your files for things you do in order to tailor marketing ad pushes to you personally, but I digress.  If you do not want Big Brother holding on to all your personal, professional, private, or other data, then you need to go in to system settings and turn off the MS log in PIN.  Doing so allows you to boot up your laptop to your local drive account only.  You can always log in and log out of your MS account if and when you choose at any time.  Of course, you can even turn off your own laptop log in password so it just simply turns on. without a password.  Your choice, as it should be."
            },
            {
                "reviewer_name": "Kevin",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 13, 2025",
                "review_text": "Computer works decent for basic functionality.  I primarily use it for surfing the net and flashing maestro modules for car radios and remote starters.However, the 128 gb flash drive/ssd whatever it comes with is JUNK.  3 out of 4 files i try to transfer to it go corrupt.  Cost me a lot of time and  labor to figure this out…….reason for 4 star vs 5.  Computer is fine but toss that drive in the trash."
            },
            {
                "reviewer_name": "An enlightened customer",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 15, 2025",
                "review_text": "I initially wrote a scathing review of this laptop because without even having done anything with it, it was incredibly sluggish, embarrassingly slow and terribly frustrating to use. Turns out after uninstalling Microsoft Copilot EVERYTHING sped up amazingly! I'll keep at 3 stars after using for a few days to confirm, but that seems to have been the trick to make this machine with its somewhat limited resources work much, much better. Stay tuned, folks."
            },
            {
                "reviewer_name": "Liam",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 14, 2024",
                "review_text": "Mine just came in yesterday and I have started the process of setting it up today (only 2 days); I’ve downloaded Google Chrome and a reputable subscription based VPN app (S mode was deactivated for the purpose of downloading Chrome). After downloading those two, I set up 2 administrator users and one standard user. In the process of setting up the other administrator user: the laptop crashed and the screen turned black. I’ve tried hard resetting and am leaving it to charge overnight. My intended use was for education for when I’m not at home (I have a desktop and obviously no one is going to bring a whole tower to every class they go to) so I wasn’t planning to use anything fancy — word and chrome.In terms of performance before it crashed:1) CPU was at 100% and was still slow when opening up apps (I wasn’t far from my main mesh router and my actual desktop works fine so can’t be internet problem)2) It made me do a recovery startup when I first unpackaged and logged into my microsoft acccount and the startup took about 20 minutes3) Breeze it up — it felt warm on the bottom after an hourThinking about returning it if the laptop still doesn’t turn on (I’ve tried 2 different outlets in 2 different rooms — [wall plug] and [my extender that has anker charger and an air purifier plugged in]) tmr afternoon).Edit: I’m returning it and getting a refund; had it plugged in for a couple of days now and have been attempting to turn it on daily — no success; laptop still does not turn on"
            }
        ],
        "review_summary": "The laptop HP Stream 14\" HD BrightView is praised for its affordability, lightweight design, and decent performance for basic tasks, but it struggles with restrictive software, limited upgrade options, and some users have experienced technical issues including storage corruption and performance slowdowns.",
        "review_sentiments": {
            "pos_5_aspects": [
                "PRICE",
                "BATTERY",
                "DESIGN",
                "PORTABILITY",
                "PERFORMANCE"
            ],
            "neg_5_aspects": [
                "DISPLAY",
                "PERFORMANCE"
            ],
            "pos_4_aspects": [
                "DISPLAY",
                "PRICE",
                "BATTERY",
                "DESIGN",
                "PERFORMANCE"
            ],
            "neg_4_aspects": [
                "DISPLAY",
                "BUILD_QUALITY",
                "PRICE"
            ],
            "pos_3_aspects": [
                "PERFORMANCE"
            ],
            "neg_3_aspects": [
                "PERFORMANCE"
            ],
            "pos_2_aspects": [],
            "neg_2_aspects": [],
            "pos_1_aspects": [],
            "neg_1_aspects": [
                "PORTABILITY",
                "BATTERY"
            ]
        }
    },
    {
        "title": "TESTING123",
        "product_id": "B0CZL2SLCJ",
        "price": "$309.00",
        "image_url": "https://m.media-amazon.com/images/I/61QuxlKVZbL._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Stream-BrightView-N4120-Graphics/dp/B0CZL2SLCJ/ref=sr_1_1?dib=eyJ2IjoiMSJ9.qy3vRYf_Xs1hn4SacKtXFeRmgXLNOf6yY4SKH6y-8nBasVg940GTC33DWvkfKtMBErTkp9MbrB5W6usmIE0YE0OnqgbNUkIvLFP_BNq6k6cB23fL6a7XN3JZShNSZXp0i4r7ag1nk-ZyGxF1_FGnM-Gip1g3tIT8IQe1QLYoprgOPbtvg8YesOu-5NUiDO-t8x2BKVlP3buILeSJObKNbuYUJ0M7c3KmwywdZdzcALI.HflJk_toEPbV6Jp_XvwvJnFGCDpfGz8u4fRtQH3vYvk&dib_tag=se&keywords=hp+laptop&qid=1742382331&refinements=p_123%3A308445&sr=8-1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "2,425 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "15%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 7,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "reviewer_name": "Julie Loerwald",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 15, 2025",
                "review_text": "The HP Stream 14\" HD BrightView Laptop is a budget-friendly device designed for basic tasks such as browsing, emailing, and word processing. With its sleek silver design and impressive specs, this laptop is an excellent option for students, professionals, and anyone looking for an affordable yet reliable device.*Pros*1. *Affordable*: The HP Stream 14\" is an excellent value for its price, offering a range of features and specs that rival more expensive laptops.2. *Impressive Performance*: The Intel Celeron N4120 processor and 16GB RAM provide smooth performance for basic tasks, making it ideal for everyday use.3. *Ample Storage*: The combination of 128GB eMMC storage and a 160GB docking station set provides plenty of space for files, documents, and multimedia content.4. *Long Battery Life*: The HP Stream 14\" offers up to 14 hours of battery life, making it perfect for on-the-go use.5. *Office 365 Included*: The laptop comes with a 1-year subscription to Office 365, providing access to popular productivity apps like Word, Excel, and PowerPoint.*Cons*1. *Limited Upgrade Options*: The laptop's storage and RAM are soldered, making it difficult to upgrade or repair.2. *Basic Graphics*: The Intel UHD Graphics are sufficient for basic tasks but may struggle with demanding graphics-intensive applications.3. *720p Webcam*: The webcam resolution is relatively low, which may affect video conferencing quality.*Verdict*The HP Stream 14\" HD BrightView Laptop is an excellent choice for anyone seeking an affordable, reliable device for basic tasks. While it may not excel in demanding tasks or graphics-intensive applications, its impressive performance, ample storage, and long battery life make it a great value for its price.*Rating*: 4.5/5 stars*Recommendation*This laptop is ideal for:- Students seeking an affordable device for schoolwork- Professionals requiring a basic laptop for email, word processing, and browsing- Anyone looking for a reliable, easy-to-use device for everyday tasksHowever, if you're a gamer, graphic designer, or require a laptop for demanding tasks, you may want to consider other options."
            },
            {
                "reviewer_name": "A. Smieja",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 19, 2025",
                "review_text": "I've had it now for a while but just started using it full time.  Great little laptop and very lightweight.  The only thing I've noticed is that the left-hand shift key has gotten stuck a few times and all my letters stay upper case.  Battery life has been awesome so far, but all laptops start out that way.  We'll see."
            },
            {
                "reviewer_name": "rick ellen mcintyre",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on November 18, 2024",
                "review_text": "list of reasons why this deserves 5 stars.1. looks cool.  it looks like carbon fiber.2. it's really fast.  don't know if it's because of the 16 gigs of ram or the 4 core processor but  it's really quick.3. the price.  this cost a little more than a notebook and you get a lot for it.4. all the connections i needed. .  hdmi for a second monitor ,  high speed 3.0 usb's to run my interface and a 3.0 usb-c.5. the hotface usb hard disc and power hub are really handy.  thanks for the great deal"
            },
            {
                "reviewer_name": "KKN",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on January 29, 2025",
                "review_text": "This is what I was looking for.  Price point, simple, compact, decent speed.  I use HP at home and at work for 20ish years.  Only had one hardware issue in all those years which was covered by warranty.  All else was replaced due to age."
            },
            {
                "reviewer_name": "Haylee Hanzel",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 10, 2025",
                "review_text": "So cute, my fav HP by fav!"
            },
            {
                "reviewer_name": "Wislineda soly",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "It’s very good, I don’t regret I bought it, it gave me a lot of good service, if you’re looking for a good laptop, l advise you to get one, you’ll be satisfied thank you"
            },
            {
                "reviewer_name": "Leighton",
                "star_rating": "5.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 21, 2025",
                "review_text": "The HP Stream 14\" Laptop is a solid option if you need a basic laptop for light use. It offers excellent value for the price, especially with 16GB of RAM and 288GB of storage. However, if you need more power for intensive tasks, you may want to consider a more powerful machine. It’s a great choice for students or anyone looking for a low-cost, everyday laptop."
            },
            {
                "reviewer_name": "MelloPi",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on May 25, 2024",
                "review_text": "Windows S Mode and McAfee are glitchy performance killers and restrictive applications.  Switching out of Win 11 S mode should be a straight forward process but it just does not work as it should, along with McAfee installed, whether you want it or not.  McAfee acts like a worm virus, intrusively imbedding itself deep into system architecture instead of being a gate keeper like other anti-virus apps.  Windows S Mode dose not allow you to install and run any app that is not Microsoft verified and found on the Microsoft Store.  In S Mode, you cannot install and run any browser other than MS Edge or Bing.  There is an app within the MS Store to switch out of S mode but it will not work because, I suspect, of the bloated software that launches when you first turn on and set up this laptop.  Switching out of S Mode is permanent.  All the advise and direction I found to get this switch to work had failed.  Lots of frustrated people out there with the same issue.  I finally got MS Support on the phone and they told me this is a very common problem with this product and the only way to resolve it was to reset the PC.  A total reset, wiping the OS and all files you may have added.  No big deal as this is a new PC and I did not transfer anything from my old PC.  After the PC was reset, I was able to switch out of S mode so that I now have Win 11 Home instead of Win 11S Home.  At the same time, a McAfee install popup was automatically prompted so I could select Do Not Install.  This was all a bit of a pain but other than that, this laptop is not so bad.  The display colors are not as vibrant as I hoped but with a resolution of only 1365 x 768, I should have expected that.  However, the graphics display very well on a connected higher resolution monitor and it handles steaming video from Amazon Prime Video beautifully.  I hope this information can help someone avoid the frustration of dealing with what was intentionally sold as a very restrictive operating environment.  Getting rid of S Mode and McAfee gives you back unrestricted use of your laptop.One more annoying detail is that, by default, this operating environment is set to save everything to the MS cloud. The default storage of Document, Downloads, Pictures, etcetera, are all MS cloud folders which is where every file is stored unless you go through a few more clicks to store the files on your local laptop drive.  By default, initially you cannot even boot up this laptop without entering your MS PIN to log onto your laptop, and thereby logging into your MS account at the same time.  I found this a bit presumptuous that MS thought this was a good idea.  Perhaps good for their own marketing efforts though, as some bot scans your files for things you do in order to tailor marketing ad pushes to you personally, but I digress.  If you do not want Big Brother holding on to all your personal, professional, private, or other data, then you need to go in to system settings and turn off the MS log in PIN.  Doing so allows you to boot up your laptop to your local drive account only.  You can always log in and log out of your MS account if and when you choose at any time.  Of course, you can even turn off your own laptop log in password so it just simply turns on. without a password.  Your choice, as it should be."
            },
            {
                "reviewer_name": "Kevin",
                "star_rating": "4.0 out of 5 stars",
                "review_date": "Reviewed in the United States on March 13, 2025",
                "review_text": "Computer works decent for basic functionality.  I primarily use it for surfing the net and flashing maestro modules for car radios and remote starters.However, the 128 gb flash drive/ssd whatever it comes with is JUNK.  3 out of 4 files i try to transfer to it go corrupt.  Cost me a lot of time and  labor to figure this out…….reason for 4 star vs 5.  Computer is fine but toss that drive in the trash."
            },
            {
                "reviewer_name": "An enlightened customer",
                "star_rating": "3.0 out of 5 stars",
                "review_date": "Reviewed in the United States on February 15, 2025",
                "review_text": "I initially wrote a scathing review of this laptop because without even having done anything with it, it was incredibly sluggish, embarrassingly slow and terribly frustrating to use. Turns out after uninstalling Microsoft Copilot EVERYTHING sped up amazingly! I'll keep at 3 stars after using for a few days to confirm, but that seems to have been the trick to make this machine with its somewhat limited resources work much, much better. Stay tuned, folks."
            },
            {
                "reviewer_name": "Liam",
                "star_rating": "1.0 out of 5 stars",
                "review_date": "Reviewed in the United States on December 14, 2024",
                "review_text": "Mine just came in yesterday and I have started the process of setting it up today (only 2 days); I’ve downloaded Google Chrome and a reputable subscription based VPN app (S mode was deactivated for the purpose of downloading Chrome). After downloading those two, I set up 2 administrator users and one standard user. In the process of setting up the other administrator user: the laptop crashed and the screen turned black. I’ve tried hard resetting and am leaving it to charge overnight. My intended use was for education for when I’m not at home (I have a desktop and obviously no one is going to bring a whole tower to every class they go to) so I wasn’t planning to use anything fancy — word and chrome.In terms of performance before it crashed:1) CPU was at 100% and was still slow when opening up apps (I wasn’t far from my main mesh router and my actual desktop works fine so can’t be internet problem)2) It made me do a recovery startup when I first unpackaged and logged into my microsoft acccount and the startup took about 20 minutes3) Breeze it up — it felt warm on the bottom after an hourThinking about returning it if the laptop still doesn’t turn on (I’ve tried 2 different outlets in 2 different rooms — [wall plug] and [my extender that has anker charger and an air purifier plugged in]) tmr afternoon).Edit: I’m returning it and getting a refund; had it plugged in for a couple of days now and have been attempting to turn it on daily — no success; laptop still does not turn on"
            }
        ],
        "review_summary": "The laptop HP Stream 14\" HD BrightView is praised for its affordability, lightweight design, and decent performance for basic tasks, but it struggles with restrictive software, limited upgrade options, and some users have experienced technical issues including storage corruption and performance slowdowns.",
        "review_sentiments": {
            "pos_5_aspects": [
              "DISPLAY",
              "BUILD_QUALITY",
              "AUDIO"
            ],
            "neg_5_aspects": [
              "PRICE",
              "PORTABILITY"
            ],
            "pos_4_aspects": [
              "PERFORMANCE",
              "DESIGN"
            ],
            "neg_4_aspects": [
              "BATTERY"
            ],
            "pos_3_aspects": [
              "PORTABILITY"
            ],
            "neg_3_aspects": [
              "AUDIO",
              "DISPLAY"
            ],
            "pos_2_aspects": [
              "BATTERY"
            ],
            "neg_2_aspects": [
              "PERFORMANCE"
            ],
            "pos_1_aspects": [
              "PRICE"
            ],
            "neg_1_aspects": [
              "BUILD_QUALITY",
              "DESIGN"
            ]
          }
    }
]