[
    {
        "title": "Dell Inspiron Touchscreen Laptop, 15.6\" Business & Student Laptop Computer, Windows 11 Pro Laptop 32GB RAM 1TB SSD, Intel i5-1155G7 Processor, Full HD IPS Display, Numeric Keypad, HDMI, Carbon Black",
        "product_id": "B0CTPCTW66",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "246 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "17%",
            "3_star": "5%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R24HE42Z7Y4D7A",
                "reviewer": "TJ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great LAPTOP!!!",
                "review_date": "Reviewed in the United States on February 16, 2025",
                "review_text": "I bought the 40GB RAM with 2TB and I love it.  Fairly easy to set up, speed is awesome, very light weight, battery life is pretty good.  I would highly recommend this as a great deal for the price."
            },
            {
                "source": "main",
                "review_id": "RD8MN42K6UCLH",
                "reviewer": "Angel A. O. Ortiz",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great laptop",
                "review_date": "Reviewed in the United States on February 26, 2025",
                "review_text": "A great price for a 40 GB Ram and 2 TB memory. Great for all purposes, business, trading, emulators, Google meet and all features."
            },
            {
                "source": "main",
                "review_id": "RODQOGE9CED5K",
                "reviewer": "AnMo917",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Effective & Reliable Laptop",
                "review_date": "Reviewed in the United States on March 1, 2025",
                "review_text": "Ease of use for high school or college student. It's light weight and a nice resolution touch screen. The 15.6 inch screen size is perfect it's not too big or too small. Not the best graphics card but not bad if used for simple videos or zoom. Great work laptop."
            },
            {
                "source": "main",
                "review_id": "R3HXGZO4BWYQ6B",
                "reviewer": "Rebecca Jacobson",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Works great for work and school",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Great product and a decent price…"
            },
            {
                "source": "main",
                "review_id": "R2CMZ5DJEWFR1S",
                "reviewer": "Thomas Going",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars BUYER BEWARE OF DELL, AMAZON AND THIRD PARTY SELLERS ON AMAZON!",
                "review_date": "Reviewed in the United States on January 9, 2025",
                "review_text": "BUYER BEWARE OF DELL, AMAZON AND THIRD PARTY SELLERS ON AMAZON.  And extended warranty company Asurion. Amazon's  practice of listing and selling products like Dell computers for third party sellers seems like a scam, since the third party seller can sell old products on Amazon where the warranty is already expired or almost so.  And I saw nothing on AMAZON's site when I bought the DELL computer that things like an expired or limited time warranty could be an issue when buying ON AMAZON from a third party seller. Bought this Dell computer on Amazon, July 16, 2024, and Jan.3, 2025 the screen separated from the cover.  Contacted Dell, and they advised the WARRANTY was EXPIRED!  That's less than 6 months.  Dell said the AMAZON third party seller resold the computer on AMAZON months after it bought the computer, and the warranty began to run earlier when the third party seller bought the computer. Not when I purchased the computer on Amazon! Spent hours on the phone with Dell, and they know about this issue with third party sellers.  Even after providing them with the Amazon invoice and receipt of when I took possession of the computer, they would not help me and apply and run the warranty to the date I bought the computer from Amazon. Amazon's rep basically said sorry, but that's my problem for buying from a third party seller. Say what?  I bought the computer on AMAZON and paid AMAZON.  Now I'm out of luck? To make matters worse, I bought an extended warranty on Amazon from Asurion on the same day I bought the Dell computer on Amazon.  When I tried to make a claim, Asurion auto responded that the Dell computer still has the manufactures warranty and to contact Dell, seemingly as a result of only having purchased the computer from Amazon in July.  And not taking into account that the warranty started to run when the third party seller bought the computer months earlier. Shame on Dell, Amazon, and Asurion."
            },
            {
                "source": "main",
                "review_id": "R300XWB9WNPTGR",
                "reviewer": "Old JW",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Functional and Easy to use.",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "I am enjoying this new computer. It is much quicker than my previous computer and it has many more features for me to use and enjoy. It was priced right and delivered as promised."
            },
            {
                "source": "main",
                "review_id": "RPOPWL1EMHMT0",
                "reviewer": "Claus R. Martel",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Fantastic!!",
                "review_date": "Reviewed in the United States on February 23, 2025",
                "review_text": "Arrived on time, perfect condition. 40GB RAM and a 2 TB HD. Lightning fast. Love this one!! And for the price? Unbeatable."
            },
            {
                "source": "main",
                "review_id": "R2WGN3FEF5QY3S",
                "reviewer": "g4bryan",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Quality Quality",
                "review_date": "Reviewed in the United States on January 18, 2025",
                "review_text": "Just put this Dell in service (always used HP) and I LOVE IT !! Great quality fit and finish.  Light weight with great battery live so far. Easy to configure with all my old stuff (most all transfered right to my home page once I got on WIFI) Dell is a good bit less expensive for the same unit but NO sacrifice for speed or storage space...."
            },
            {
                "source": "main",
                "review_id": "R27NFST5OVLQCQ",
                "reviewer": "Smiles005",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars WATCH OUT EVERYONE!!!",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "WATCH OUT EVERYONE!!! Amazon's practice of listing and selling products like Dell computers for third party sellers seems like a scam, since the third party seller can sell old products on Amazon where the warranty is already expired or almost so. And I saw nothing on AMAZON's site when I bought the DELL computer that things like an expired or limited time warranty could be an issue when buying ON AMAZON from a third party seller. Bought this Dell computer on Amazon, February 24, 2025, delivered just a couple days ago and today on March 4, 2025 I checked the WARRANTY which only had less than 6 months LEFT. Dell said the AMAZON third party seller resold the computer on AMAZON months after it bought the computer, and the warranty began to run earlier when the third party seller bought the computer. Not when I purchased the computer on Amazon! This should not be HAPPENING. I contacted the Company and they said nothing was wrong! It came saying the last time it had been updated was August 18th and took the entire first day to get up to date. In regards to the Computer, it runs super fast. It has a battery that dies really quickly which is why I was checking the warranty. The Power in this computer dies so fast and the fans are always running. It the touch screen is nice and it seems to have a good quality. The Sound is pretty good after it is updated. It seems to have more durability than most computers but time will tell."
            },
            {
                "source": "main",
                "review_id": "RDNCQJPT41X77",
                "reviewer": "Power",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Outstanding, but no backbiting keyboard",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Everything is good, speed, memory, Battery life and responsive, the only thing I had a problem was when its dark I wish I had a backbiting keyboard"
            },
            {
                "source": "main",
                "review_id": "R1L278FHOCXI19",
                "reviewer": "JAT",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Some issues with new Dell laptop",
                "review_date": "Reviewed in the United States on January 31, 2025",
                "review_text": "This item was advertised as having Microsoft 11 pro. It is 11 home.  Upon initial set up was unable to login to welcome screen. Took it to a local tech to fix this - paid out of pocket for repair. On board speakers did not work. Went to Dell support to download a new driver which resolved the problem. Otherwise, so far, I like the screen size and performance of the laptop. My intended use is casual, personal for home."
            },
            {
                "source": "main",
                "review_id": "R1I6ZZY61HLEY6",
                "reviewer": "Francisco Rivera",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars DELL laptop black",
                "review_date": "Reviewed in the United States on February 28, 2025",
                "review_text": "Waoo awesome Laptop. Like it a lot"
            },
            {
                "source": "main",
                "review_id": "R1KONMF02AHS2Q",
                "reviewer": "J. Adams",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Decent laptop, just not was advertised for CPU",
                "review_date": "Reviewed in the United States on February 13, 2025",
                "review_text": "Not the specs that were advertised. Received a Dell Inspiron 15 i5-1235U 32GB ram with 1TB ssd. Touchscreen."
            },
            {
                "source": "main",
                "review_id": "R2QJJWMHAPT1Q2",
                "reviewer": "Amazon Customer",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excellent",
                "review_date": "Reviewed in the United States on February 23, 2025",
                "review_text": "I love this laptop I had it for maybe 6 months my one problem."
            },
            {
                "source": "main",
                "review_id": "R265OQI0I4A22P",
                "reviewer": "Michele Blair",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars School/personal",
                "review_date": "Reviewed in the United States on February 17, 2025",
                "review_text": "Got this computer for school use in cyber security and will use for personal use as well. Love that it’s touch screen."
            },
            {
                "source": "main",
                "review_id": "R19A90WGTY3NHF",
                "reviewer": "Mike Thomas",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell Inspiron 15",
                "review_date": "Reviewed in the United States on February 23, 2025",
                "review_text": "Great out of the box computer. turn it on and follow instructions."
            },
            {
                "source": "main",
                "review_id": "R3EICVTCHC2V4E",
                "reviewer": "robin hatfield",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Fast startup, like the touchscreen.",
                "review_date": "Reviewed in the United States on December 25, 2024",
                "review_text": "I want a relatively low cost new laptop to replace my old one. It has a lot of memory and speed. I unfortunately am not a big fan of windows 11,its hard to get used to, that's not the fault of the computer though."
            },
            {
                "source": "main",
                "review_id": "R2AI864H1UI5YI",
                "reviewer": "Amazon Customer",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Does everything I need",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Fast"
            },
            {
                "source": "main",
                "review_id": "R3ANC4OE0BS0UN",
                "reviewer": "Dietrich",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Love it",
                "review_date": "Reviewed in the United States on February 23, 2025",
                "review_text": "Brought it for my son and he loves it"
            },
            {
                "source": "main",
                "review_id": "R3QWGBQ1S8RR3A",
                "reviewer": "steve steinbach",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars No backlight",
                "review_date": "Reviewed in the United States on January 5, 2025",
                "review_text": "I like it but no backlight"
            },
            {
                "source": "main",
                "review_id": "R1KY2OVTMP8LO8",
                "reviewer": "Johnson",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars It's a Dell",
                "review_date": "Reviewed in the United States on November 23, 2024",
                "review_text": "It works.  All programs and internet work great.  Camera for virtual meetings is nice and clear.  Pretty lightweight.  Battery life seems a little lacking.  I haven't used a complete cycle but the indicator says 3 hrs remaining when I unplug it."
            },
            {
                "source": "main",
                "review_id": "R2LCL39MTXZOQI",
                "reviewer": "Mimi",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great purchase",
                "review_date": "Reviewed in the United States on February 18, 2025",
                "review_text": "Great laptop"
            },
            {
                "source": "main",
                "review_id": "R7RXYS622GY0D",
                "reviewer": "John T Melvin",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Awesome",
                "review_date": "Reviewed in the United States on February 11, 2025",
                "review_text": "Item came on time and as described"
            },
            {
                "source": "main",
                "review_id": "R32XKMUEG47LLJ",
                "reviewer": "Wilman Sosa",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Compu laptop",
                "review_date": "Reviewed in the United States on February 10, 2025",
                "review_text": "Llegó en buen estado el producto"
            },
            {
                "source": "main",
                "review_id": "R196ND4Y8S2RNN",
                "reviewer": "Castro jessica",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excelente la recomiendo",
                "review_date": "Reviewed in the United States on February 12, 2025",
                "review_text": "Muy buena"
            },
            {
                "source": "main",
                "review_id": "RG98V5XAT8P8T",
                "reviewer": "Jessica",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Does the Job",
                "review_date": "Reviewed in the United States on June 21, 2024",
                "review_text": "Nice labtop for what it is. My Acer is like 15 years old and I needed a new computer for Nursing school. Storage and speed wide, this does the job. Only had it since 6/15/24, and had to buy a cooling stand (6/19/24) already because it gets hot. Also, the battery dies fast. Unplugged at 100% and 3 hours into school work it said low battery 19%. Will have to carry the cooling stand and charger with me on school nights. Another odd quirk, I've have to reset the time almost everytime I sign in. It's either an hour ahead or an hour behind. It's on the correct time zone (EST) and I've played with the daylight saving toggle and manually reset the time to correct the time, but once it's closed and turned back on, it's a different time. Should be good enough to get me through the next 2 years of nursing school, though."
            },
            {
                "source": "main",
                "review_id": "R26763GIGF907A",
                "reviewer": "Michael C. Poole",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Runs great... but where's the keyboard?",
                "review_date": "Reviewed in the United States on October 29, 2024",
                "review_text": "Works like a dream. And it's fast! I love the touchscreen and the 15.6in screen. My biggest issue is the lack of a backlit keyboard. This makes it extremely difficult to type in dim/ dark light. Could use a few more usb ports too."
            },
            {
                "source": "main",
                "review_id": "R3C6REEO1JSP1Y",
                "reviewer": "Jack",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars TB",
                "review_date": "Reviewed in the United States on October 16, 2024",
                "review_text": "I bought as 1 TB but when I received the laptop it was 256gb and it changed later I don’t know why. Sometimes touchpad stops working and guves me hard time. There is no shortcut as button this is horrible problem if u don’t have a mouse But generally it is good enough for my needs"
            },
            {
                "source": "main",
                "review_id": "R1DBQKFQ0BCLVH",
                "reviewer": "Bob",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Hinges broke in 6 mo",
                "review_date": "Reviewed in the United States on February 12, 2025",
                "review_text": "The old dell broke, ordered new dell and in 6 months this one  broke waiting for its return on being fixed ( we got insurance on it. First pic is old one second is new one don’t buy a dell"
            },
            {
                "source": "main",
                "review_id": "RM07JYQSJ8E8B",
                "reviewer": "Manuel Vargas",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars A Beast",
                "review_date": "Reviewed in the United States on November 1, 2024",
                "review_text": "This is a quick a d fast machine a monster in speed."
            },
            {
                "source": "main",
                "review_id": "R3AEW15MVW4D5F",
                "reviewer": "Harold c.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars computer",
                "review_date": "Reviewed in the United States on January 16, 2025",
                "review_text": "this is a well put together computer and a nice buy for this price."
            },
            {
                "source": "main",
                "review_id": "R2OAP41QRCGNHN",
                "reviewer": "BOC",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Reliability",
                "review_date": "Reviewed in the United States on January 21, 2025",
                "review_text": "Reliable Home and Office system. Fast, accurate, dependable"
            },
            {
                "source": "main",
                "review_id": "RYHA89IKL4H7Y",
                "reviewer": "Mildred Jefferson",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars New Laptop",
                "review_date": "Reviewed in the United States on December 24, 2024",
                "review_text": "I am generally a Dell operator but tried a Lenovo laptop a few years ago. Fast forward and the motherboard is gone after only 2.5 years and it was not used everyday. Needless to say I  back with Dell. I won’t stray again."
            },
            {
                "source": "main",
                "review_id": "R1667ZB8MHGZR2",
                "reviewer": "Phil Metzinger",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell Laptops are Excellent!",
                "review_date": "Reviewed in the United States on January 15, 2025",
                "review_text": "Very pleased with our new Laptop."
            },
            {
                "source": "main",
                "review_id": "RCYHM5N378G96",
                "reviewer": "Randy Jones",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great machine for wife to use daily.",
                "review_date": "Reviewed in the United States on January 12, 2025",
                "review_text": "Plenty of ram and fast enough, she is very happy with it."
            },
            {
                "source": "main",
                "review_id": "R33AM4O0OLLMUL",
                "reviewer": "Abe Frohman",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good laptop",
                "review_date": "Reviewed in the United States on January 12, 2025",
                "review_text": "Nice laptop for non gaming applications. Good for work and school."
            },
            {
                "source": "main",
                "review_id": "R3FDA79ITTHI2R",
                "reviewer": "Laraquel",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Lo dejaron en la puerta correcta",
                "review_date": "Reviewed in the United States on January 17, 2025",
                "review_text": "Excelente"
            },
            {
                "source": "main",
                "review_id": "R3977828PB2FPC",
                "reviewer": "Diana",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Mi mejor laptop",
                "review_date": "Reviewed in the United States on January 7, 2025",
                "review_text": "Excelente y satisfecho con el producto"
            },
            {
                "source": "main",
                "review_id": "R3MWGH0TUVX45Y",
                "reviewer": "tpatt",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good product",
                "review_date": "Reviewed in the United States on December 29, 2024",
                "review_text": "This laptop was very easy to set up and is working great.  A good solid product."
            },
            {
                "source": "main",
                "review_id": "R3EKK8RC140EMI",
                "reviewer": "Tadpols",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Laptop",
                "review_date": "Reviewed in the United States on July 12, 2024",
                "review_text": "The media could not be loaded. Received in a pretty mangled box, thankfully the inside box was in good shape.  Started using the computer and it's great.  After initially charging the laptop it didn't want to hold a charge.  Charged it a couple nights ago...now it's holding and working great."
            }
        ]
    },
    {
        "title": "Dell Latitude 5550 15 Business AI Laptop, 15.6\" FHD Computer, Intel Ultra 7 155U (Beat i7-1355U), 32GB DDR5 RAM, 1TB SSD, WiFi 6, Backlit Keyboard, Fingerprint Reader, Windows 11 Pro",
        "product_id": "B0DQWTH2NM",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "25 global ratings",
        "histogram": {
            "5_star": "73%",
            "4_star": "8%",
            "1_star": "19%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R25RECL56UKOOZ",
                "reviewer": "Suzanne Davis",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excellent machine, great value!",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "Excellent machine. Very happy with it. Super speedy and easy to set up. So glad I pulled the trigger and bought it. Comes with a mouse and charger. Delivery and packaging could not have been better. I bought the Asurion protection and received an email with details about how to file a claim."
            },
            {
                "source": "main",
                "review_id": "R1JACJMV99304R",
                "reviewer": "WILLIAN",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excelente computadora",
                "review_date": "Reviewed in the United States on February 10, 2025",
                "review_text": "Excelente Laptop"
            },
            {
                "source": "main",
                "review_id": "R3JUQ10MRIAPD9",
                "reviewer": "PAUL Billue",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Customer service, and compatibility with hardware.",
                "review_date": "Reviewed in the United States on March 6, 2025",
                "review_text": "Was over priced, didn't work with my DJ equipment, the screen kept flipping. Why would you have a computer with a screen flip option like a cell phone. Then was charged a 200.00 restocking fee and taxes to send it back. Will buy from Best buy Next time."
            },
            {
                "source": "main",
                "review_id": "R3A5POPSCYIMTI",
                "reviewer": "Thmoas ma",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Low cost",
                "review_date": "Reviewed in the United States on June 11, 2024",
                "review_text": "It is a office laoptop.It works for all daily works that i need"
            },
            {
                "source": "main",
                "review_id": "R38QI19X37VNPX",
                "reviewer": "Bob",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Authentic Laptop Computer at Super Affordable Price. Such a steal~",
                "review_date": "Reviewed in the United States on February 12, 2024",
                "review_text": "The laptop I received was brand new and authentic. The seller shipped right after I placed the order. It was a very pleasant shopping experience."
            },
            {
                "source": "main",
                "review_id": "R18ZKLZ1678P6O",
                "reviewer": "Kenji",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Worth Every Penny",
                "review_date": "Reviewed in the United States on January 31, 2020",
                "review_text": "This runs very well! It can even play some of the newest games on low graphics! It was definitely worth every dollar!"
            },
            {
                "source": "main",
                "review_id": "R146TE4VX7DKG0",
                "reviewer": "Bruce Williamson ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Loads quickly and no issues!",
                "review_date": "Reviewed in the United States on January 8, 2020",
                "review_text": "The laptop is great!  It loads quickly and there are no issues!  Would recommend and would buy this again!"
            },
            {
                "source": "main",
                "review_id": "R3UQQOEGFU1ZX9",
                "reviewer": "Carley",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars A lot of function for a little price",
                "review_date": "Reviewed in the United States on February 10, 2020",
                "review_text": "Great small laptop. Looks better in person than I thought it would look from the pictures."
            },
            {
                "source": "main",
                "review_id": "R33QJOQ3OPVH9K",
                "reviewer": "Mick",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Five Stars",
                "review_date": "Reviewed in the United States on April 4, 2015",
                "review_text": "Awesome computer!!"
            },
            {
                "source": "main",
                "review_id": "R2KK0RPZ59UPOR",
                "reviewer": "Dhiraj",
                "rating": null,
                "review_title": "",
                "review_date": "Reviewed in Australia on February 7, 2020",
                "review_text": "IT looks very good product with great price"
            }
        ]
    },
    {
        "title": "Dell Inspiron 15 3520 Laptop for Business, with Office Pro Lifetime License, 15.6\" FHD+ Touch Screen, Intel 10-Core i5-1235U, 32 GB RAM, 1 TB SSD, Windows 11 Pro, Wi-Fi 6, w/Jawfoal Accessories",
        "product_id": "B0BCFX1BZG",
        "average_rating": "4.1 out of 5 stars",
        "review_count": "23 global ratings",
        "histogram": {
            "5_star": "63%",
            "4_star": "17%",
            "2_star": "8%",
            "1_star": "12%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R3TOXVL48CFRA0",
                "reviewer": "Johnny L",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Reliable Workhorse of a Laptop",
                "review_date": "Reviewed in the United States on January 22, 2025",
                "review_text": "I can begin to list out all the great things about this laptop 1. Fast Processing 2. Excellent Sounding Speakers 3. Open and close application with ease And many more."
            },
            {
                "source": "main",
                "review_id": "R1EIF8WN6NIVBV",
                "reviewer": "Yazheng T.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Very good business latptop",
                "review_date": "Reviewed in the United States on January 31, 2025",
                "review_text": "I use it when im out. Very easy to carry and the battery runs long."
            },
            {
                "source": "main",
                "review_id": "R157SOYO00RQS8",
                "reviewer": "Don",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Mislead by Advertisement",
                "review_date": "Reviewed in the United States on February 3, 2025",
                "review_text": "Beautiful laptop and I think it's probably a good buy.  But I've never owned a laptop and the learning curve is not what I expected. However, I'm a tad disappointed in that within 45 minutes of booting it up for the first time, I was asked to register a credit card for licensing for the Microsoft Office licensing - $129.00 to be exact. What gives?  I thought a was guaranteed \"lifetime\" licensing upon my initial purchase.  Will someone please explain?"
            },
            {
                "source": "main",
                "review_id": "R11S3JSBLUJNJU",
                "reviewer": "D.B.",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars No Backlit Keyboard as described.",
                "review_date": "Reviewed in the United States on February 26, 2025",
                "review_text": "Returned computer.  It did not have a Backlit keyboard as described.  Note: It did not arrive with \"Office Pro\",  \"Window 11 Pro System\", and 7 in one Cleaning Kit\".  as advertised.  It did arrive with  ADATA micro SDXG 64 GB, which I returned with the computer.  Its a very nice computer, but if you need a Backlit keyboard, this is not the one to purcahse."
            },
            {
                "source": "main",
                "review_id": "R37YRRO2KZD79Z",
                "reviewer": "Will",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars User friendly",
                "review_date": "Reviewed in the United States on January 28, 2025",
                "review_text": "It handles several tasks efficiently, battery life is good, easy to charge."
            },
            {
                "source": "main",
                "review_id": "R1PC91RE9RS6J4",
                "reviewer": "G. Patten",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great Laptop",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "Love the price and easy set up of this Dell Laptop. Comes with Microsoft office for life. Can’t beat that!"
            },
            {
                "source": "main",
                "review_id": "R13Q01ZDS9Y2XM",
                "reviewer": "Jim",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars Good but not as advertised",
                "review_date": "Reviewed in the United States on March 6, 2025",
                "review_text": "Good laptop at a decent price, but doesn't include all items advertised.  Does not include the Jawfoal package, the lifetime Office license or flash drive.  This model also does not have the USB-C port - only has USB-A and HDMI (and an SD Card slot, which is pretty obsolete). The keyboard is not backlit - if that's an important feature for you, look for a different model."
            },
            {
                "source": "main",
                "review_id": "R7F7ZMNFC159E",
                "reviewer": "Stephen Lousteau",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Software",
                "review_date": "Reviewed in the United States on March 6, 2025",
                "review_text": "Unclear how to install the word and spreadsheet software."
            },
            {
                "source": "main",
                "review_id": "R3AYXFRK1MCWBM",
                "reviewer": "Lisa W.",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Missing some items, no backlit keyboard",
                "review_date": "Reviewed in the United States on March 5, 2025",
                "review_text": "I ordered the Dell with 1T storage and 32G ram and that's what I got. MS Office is actually pre-installed, so no need to download anything. However, I read the in-depth description before ordering because I specifically wanted a backlit keyboard and it was definitely listed as such, both on the phone app and PC format. It didn't come with one, however, and it also was missing the jump drive and the cleaning kit. I was going to return it, but felt that re-ordering would still get me the same thing anyway so I didn't bother. I liked the laptop enough to keep it as is, though BEWARE that you may have the same issues ordering from this seller. I did contact them with a heads up of the missing items and never got them. Otherwise, it's a solid workhorse, easy to use, super fast, and I love all the storage. The screen is really lovely and hi-def, colors are amazing! Speakers are great for a laptop. I'm happy with it!"
            },
            {
                "source": "main",
                "review_id": "R80DF73KQY1K7",
                "reviewer": "Roy McCammon",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Just as advertised",
                "review_date": "Reviewed in the United States on February 15, 2025",
                "review_text": "Works great for my daughter's remote job."
            },
            {
                "source": "main",
                "review_id": "R4IYNY9YCMCGA",
                "reviewer": "Adam",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Powerful laptop",
                "review_date": "Reviewed in the United States on January 23, 2025",
                "review_text": "This laptop is an excellent item for people who require a high-performing machine with large storage and memory. Recommend it for work and study!"
            },
            {
                "source": "main",
                "review_id": "R1WVDUYDIKP3IJ",
                "reviewer": "Jackie",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Nice to have",
                "review_date": "Reviewed in the United States on January 16, 2025",
                "review_text": "Fast and slight weight"
            },
            {
                "source": "main",
                "review_id": "R1Y4CA1RCDW94E",
                "reviewer": "Justin Morris",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Overall good, overheating issue.",
                "review_date": "Reviewed in the United States on March 15, 2024",
                "review_text": "Got this for my son. Everything is great, but sometimes it overheats and shuts down when he's playing some games. We looked it up online, used tips to change fan speed to cool and turned off turbo. Helped, may still need a cooling pad."
            },
            {
                "source": "main",
                "review_id": "RHQF6GRPABVN8",
                "reviewer": "Henry Morel",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell 2021 Newest G5 Laptop",
                "review_date": "Reviewed in the United States on January 5, 2024",
                "review_text": "PROS: This laptop is a powerful with a  non-glossy display. Delivers excellent performance and runs cool under pressure and has great battery life. The packaging is top-notch, and the overall experience is excellent. CONS: The power supply is a bit bulky but it justifies for the massive performance the laptop delivers. TO THE SELLER: Thank you for making this purchase possible. FINAL THOUGHTS: A powerhouse laptop that delivers on performance."
            },
            {
                "source": "main",
                "review_id": "R10H3994IOVAI1",
                "reviewer": "Linda ",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Too hot to handle??",
                "review_date": "Reviewed in the United States on March 6, 2025",
                "review_text": "No sound, but otherwise worked great for first two weeks.  Has now overheated twice in the past 4 days.  Waiting to hear from seller as to how to proceed."
            }
        ]
    },
    {
        "title": "Dell Inspiron 15 3511 15.6 Inch Laptop, Full HD LED Non-Touch WVA Display - Intel Core i3-1115G4, 8GB DDR4 RAM, 256GB SSD, UHD Graphics, Windows 11 Home - Carbon Black",
        "product_id": "B09GYN91J9",
        "average_rating": "4.0 out of 5 stars",
        "review_count": "434 global ratings",
        "histogram": {
            "5_star": "64%",
            "4_star": "13%",
            "3_star": "6%",
            "2_star": "2%",
            "1_star": "15%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R41K9WSLLMRU4",
                "reviewer": "Anthony",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Cheap but effective Laptop - Recommended",
                "review_date": "Reviewed in the United States on November 24, 2024",
                "review_text": "I bought this for my wife to use in doing her job which included a lot of RAM loading for use by two or three types of management software. Love the keyboard which is nice and tight and includes a dedicated number pad to the right side. The core i3 processor is decent and doesn't get overloaded until you really push it which is expected at this price pt. Sometimes it may approach its memory limit but gives decent service - for just 8GB of RAM it works well and the sound quality isn't amazing but adequate. I consider it great value for money. I recommend it but probably with 16GB RAM and at least 500GB of SSD Storage. While in Miami to the end of March this year, we visited 3 retailers of tech products and were amazed at the oversell of sub-standard electronics. When we found this after spending 1/2 day searching at major retailers, we grabbed it! Delivery took under two days and we were impressed with the performance of the laptop and we were able to avoid the over-sell and condescending attitude of poorly trained tech experts who seemed to know much less than me about their own products."
            },
            {
                "source": "main",
                "review_id": "R1A5BHMGHS87SB",
                "reviewer": "Carmen",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great replacement laptop for mom and dad",
                "review_date": "Reviewed in the United States on February 24, 2025",
                "review_text": "If you need a replacement for a win 10 laptop that can't be upgraded, this is a solid choice.  It isn't going to be a gamer laptop but if you need a computer for email, browsing, etc., this is a great choice."
            },
            {
                "source": "main",
                "review_id": "R3876WBEZK3KHA",
                "reviewer": "mrah",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Hinges, keyboard, and mouse all failed within two years",
                "review_date": "Reviewed in the United States on December 12, 2024",
                "review_text": "Garbage quality. Within months of purchase the over-tightened hinges made the screen pop apart. Months later one pair of keys after another started failing, not due to damage, just poor quality. Now the mouse sporadically fails. I have tried every troubleshooting and it’s clearly hardware issues. Dell is well aware of all of these issues, they are just an evil corporation like all of the others. Selling poor quality products that fail. I’m never buying Dell again."
            },
            {
                "source": "main",
                "review_id": "RCFGRZ88W43CW",
                "reviewer": "Karrie",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell laptop",
                "review_date": "Reviewed in the United States on January 4, 2025",
                "review_text": "I wish I could have had a color.  This was only available in black.  Sold out fast because it was a good reasonable price. I only bu/y dell.  Very easy to use if you are not too computer savey.  They last a long time with no problem with the mechanics of use.  Definitely recommend.  Dell has great prices."
            },
            {
                "source": "main",
                "review_id": "R6ILYJJHJNGB",
                "reviewer": "Mary G",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Ok for small jobs.",
                "review_date": "Reviewed in the United States on July 5, 2024",
                "review_text": "Works well for small jobs.  Don't like that it records everything to the cloud.  Have to remove often to make room for things you wish to store. After awhile it is necessary to save items to external drives."
            },
            {
                "source": "main",
                "review_id": "R1NQRBJYGE1ZC0",
                "reviewer": "Murf205",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great laptop but.....",
                "review_date": "Reviewed in the United States on December 24, 2024",
                "review_text": "I love the computer but it comes with Windows 11 loaded which is probably the worst rendition of Windows 8. Difficult to navigate, probably because I was used to Windows 7 which actually made use of logic."
            },
            {
                "source": "main",
                "review_id": "RX7VIQL355G72",
                "reviewer": "Heather",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars So fast and easy!",
                "review_date": "Reviewed in the United States on August 10, 2024",
                "review_text": "If you don’t need a touch screen, this laptop is the best deal.  Has all the fast new cool things like Windows 11 and so easy to set up.  Never a better time to get a low cost high power laptop."
            },
            {
                "source": "main",
                "review_id": "ROYE8HAUBOMUN",
                "reviewer": "Marion",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars sound device driver",
                "review_date": "Reviewed in the United States on October 26, 2024",
                "review_text": "My sound device driver went out and I can't get help from anyone!!!!"
            },
            {
                "source": "main",
                "review_id": "R1K718B6791XDQ",
                "reviewer": "Amazon Customer",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Dell laptop computer",
                "review_date": "Reviewed in the United States on July 20, 2024",
                "review_text": "I like windows 11 and the dell performance is really fast and good"
            },
            {
                "source": "main",
                "review_id": "R16SRVIXIYGWL5",
                "reviewer": "D. Towe",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Have have bought many of these",
                "review_date": "Reviewed in the United States on June 15, 2024",
                "review_text": "Have have purchased about ten of these and for the price they can't be beat."
            },
            {
                "source": "main",
                "review_id": "RN26CYCJS47E6",
                "reviewer": "Mycole Brown",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Slowest laptop since around 2003",
                "review_date": "Reviewed in the United States on February 3, 2025",
                "review_text": "I've been using laptops for over 20 years and I haven't had one this slow since like 2003. I wanted to return it but my life was too busy so I'm stuck with it and will maybe try to sell it. I was going to write this review on that laptop but it was so slow that I decided to buy a different laptop and write the review on it. Imagine trying to type on your laptop and sometimes having to wait 40 seconds repeatedly for text to appear. In the future I'm thinking I should never buy a used laptop that's this old on here."
            },
            {
                "source": "main",
                "review_id": "R2W74VQZRF8FGA",
                "reviewer": "Elizabeth Young",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars love it",
                "review_date": "Reviewed in the United States on October 26, 2024",
                "review_text": "works great so far no proplems"
            },
            {
                "source": "main",
                "review_id": "R3UXRZTLZ6APNW",
                "reviewer": "Ashley H. Harris",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Junk",
                "review_date": "Reviewed in the United States on January 27, 2025",
                "review_text": "The right hinge broke from normal use. After doing some research on the issue, it seems to be a common problem with Dell and is complicated to fix. Also, every time the computer goes to sleep when it's not plugged in, it doesn't come back up. I have to power on the computer and it says it wasn't shut down correctly. If it's plugged in, it works fine."
            },
            {
                "source": "main",
                "review_id": "R1LLXJM5SFTD23",
                "reviewer": "Eric Miller",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars new programs",
                "review_date": "Reviewed in the United States on May 2, 2023",
                "review_text": "Whne you buy this you are buying stuff Microsoft wants to sell you or get you to use.  Be prepared to need help getting back to what you once had!  Pain in the butt!"
            },
            {
                "source": "main",
                "review_id": "R1VA7F78612D8Z",
                "reviewer": "Allen Peachy",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Please adjust screen hinge tension!",
                "review_date": "Reviewed in the United States on June 10, 2022",
                "review_text": "First order of business.  Adjust hinge tension. If you can't open it with 1 hand, it's too tight. There's a great video on YouTube called Dell inspiron hinge calibration. Mine lasted less than 6 months before the plastic broke. Thankfully the screen was unharmed. I was able to repair it with the super glue - Baking soda trick. Otherwise, it's a great laptop."
            },
            {
                "source": "main",
                "review_id": "R1EMTUC3A904PL",
                "reviewer": "Azucena Rodríguez",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars buen producto",
                "review_date": "Reviewed in the United States on August 25, 2024",
                "review_text": "funciona bien llego en perfecto gracias Amazon"
            },
            {
                "source": "main",
                "review_id": "R1CF84BYEP0ELC",
                "reviewer": "Amazon Customer",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Microsoft  software",
                "review_date": "Reviewed in the United States on February 26, 2024",
                "review_text": "Very unhappy with MSFT taking over the operating systems. Microsoft to the exclusion of others is cutting off choices of using other sioftesre."
            },
            {
                "source": "main",
                "review_id": "R3L5JKT8ZMJ0B6",
                "reviewer": "Dennis N Linden",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Great laptop",
                "review_date": "Reviewed in the United States on March 4, 2023",
                "review_text": "Design and build quality is excellent with a great touch keyboard. I'd recommend buying the 1TB SDD, the 256 GB one included is a low cost entry product.  I changed it to 1TB."
            },
            {
                "source": "main",
                "review_id": "R35SR9B2YF62PL",
                "reviewer": "Amazon Customer",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Windows 10 installed not Windows 11",
                "review_date": "Reviewed in the United States on December 31, 2022",
                "review_text": "The description of the product stated that it came with Windows 11 Home.  It is Windows 11 compatible but it came with Windows 10 Home installed.  Except for that I am totally satisfied with the product."
            },
            {
                "source": "main",
                "review_id": "R128UCAF8XEO2L",
                "reviewer": "Heriberto C.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excellent equipment",
                "review_date": "Reviewed in the United States on September 10, 2024",
                "review_text": "Excellent computer"
            },
            {
                "source": "main",
                "review_id": "R1E12TYUJNSNVI",
                "reviewer": "BOBBY McALPIN",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars JUNK",
                "review_date": "Reviewed in the United States on February 6, 2025",
                "review_text": "order this laptop monday got it wed and started to set it up at 230 pm and 2am next day still couldnt get it do all updates and anything else so i wouldnt buy this junk laptop"
            },
            {
                "source": "main",
                "review_id": "R3LR060PHG09WS",
                "reviewer": "Julie C.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good value for routine use",
                "review_date": "Reviewed in the United States on June 16, 2024",
                "review_text": "I like Dell products and this machine does everything I need it for very well."
            },
            {
                "source": "main",
                "review_id": "R2D1WIJ94XEJ9G",
                "reviewer": "robert beasley",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Trash",
                "review_date": "Reviewed in the United States on October 31, 2024",
                "review_text": "Purchased 3 years ago for home use on desk. That is all it has been used for, has not been out of the house. Rarely closed. The screen has become detached at hinges, cannot close it and must prop up the screen to use it, as I am now. OS seems to be ok. I didn't buy the $ 95 protection agreement, so I am screwed ! Research now tells me that this is a recuring Dell problem. wish I had done my research prior to purchase. So, I now have an expensive laptop that only can sit on my desk. Very, very unhappy."
            },
            {
                "source": "main",
                "review_id": "R10E2LZFOLL7UF",
                "reviewer": "rsa",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars Hummmm",
                "review_date": "Reviewed in the United States on August 20, 2024",
                "review_text": "This PC keeps shutting down and refuses to start normally.  It was not a refurbished model, as far as I knew.  It was discounted because of a return."
            },
            {
                "source": "main",
                "review_id": "R267Z3C1SU4Q4P",
                "reviewer": "Cheryl Vick",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Arrived early",
                "review_date": "Reviewed in the United States on July 19, 2024",
                "review_text": "Very pleased"
            },
            {
                "source": "main",
                "review_id": "R48I59J4CS9OH",
                "reviewer": "island shopper",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell, the best!",
                "review_date": "Reviewed in the United States on October 28, 2023",
                "review_text": "I've been buying Dell for over 15 years and it is my favorite brand. I usually change computers every 5 years. I bought this one to my teenage daughter for school and she loves it. It is the perfect size for her backpack and lightweight."
            },
            {
                "source": "main",
                "review_id": "R3NLXKW6415BJN",
                "reviewer": "juanbaldo",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars el servicio",
                "review_date": "Reviewed in the United States on June 19, 2024",
                "review_text": "la calidad y excelente marca 'dell'"
            },
            {
                "source": "main",
                "review_id": "RSQJIJ4Q2UH7G",
                "reviewer": "Hhager",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars laptop",
                "review_date": "Reviewed in the United States on February 18, 2024",
                "review_text": "So far, so good.  This is my first laptop, so don't have anything to compare.  Keyboard is taking some getting used to, but so far I'm very pleased."
            },
            {
                "source": "main",
                "review_id": "R2H0FRDJWXGFG9",
                "reviewer": "David L Alstadt",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell",
                "review_date": "Reviewed in the United States on June 19, 2024",
                "review_text": "Just what I wanted"
            },
            {
                "source": "main",
                "review_id": "R1TWLMXXHQIFJN",
                "reviewer": "Donna301",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great for the price!",
                "review_date": "Reviewed in the United States on August 16, 2022",
                "review_text": "This laptop is a great value. I use it for basic stuff and don't take it anywhere. The lid/screen is somewhere flexible and when you press the keys, you can see the case press down as well, so I'm not sure it would hold up to a lot of rough use. But if you're looking for a good, basic laptop for home computing, this model is a great value."
            },
            {
                "source": "main",
                "review_id": "R3QKUFZQRWV8MH",
                "reviewer": "Gilberto Z Gonzalez",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars very nice computer",
                "review_date": "Reviewed in the United States on January 11, 2024",
                "review_text": "Just when my laptop broke, I ordered this laptop, and it works great. Thank you so much for suppling this nice laptop. Its Awesome!!!"
            },
            {
                "source": "main",
                "review_id": "R2PFCACYKLGC7P",
                "reviewer": "William Nas",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell Quality",
                "review_date": "Reviewed in the United States on March 27, 2024",
                "review_text": "Dell is all I buy, excellent quality and service."
            },
            {
                "source": "main",
                "review_id": "RSKIALF6Q3TQW",
                "reviewer": "Kratos70",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Disappointed",
                "review_date": "Reviewed in the United States on November 23, 2024",
                "review_text": "Don't make them like they use to. My last laptop i had for 15 years dropped twice. Still worked fine till fan stopped working. This. I barely had for 2 months.  Touch pad stopped working. Buy something else."
            },
            {
                "source": "main",
                "review_id": "R9UXN4G8BFYCW",
                "reviewer": "AZ Seany",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Nice Quality",
                "review_date": "Reviewed in the United States on March 12, 2023",
                "review_text": "Nice home laptop."
            },
            {
                "source": "main",
                "review_id": "R1FSUTUO1U3YHA",
                "reviewer": "Paul K",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars Cheaply made.",
                "review_date": "Reviewed in the United States on April 28, 2023",
                "review_text": "Purchased this laptop in September 2022 for personal use and am not a heavy user.  One of the hinges has broken. Amazon will not help because it's past their 30 day return policy The unit was advertised as used but in good condition.  This particular model is cheaply made and the reason I purchased it was it's a Dell and I thought they made good quality products. Buyer be where when purchasing used items from Amazon."
            },
            {
                "source": "main",
                "review_id": "R346WJU1D5L7KU",
                "reviewer": "Mikey likes it",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Fast delivery and works well",
                "review_date": "Reviewed in the United States on March 21, 2024",
                "review_text": "Replaced last frozen laptop."
            },
            {
                "source": "main",
                "review_id": "R3G1FJY5B2O8PQ",
                "reviewer": "Laura M.",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars No Ethernet Jack & Known issue with hinge breaking",
                "review_date": "Reviewed in the United States on March 17, 2022",
                "review_text": "I downgraded this review. See below. I didn't read the specs carefully enough. This does not have an Ethernet jack to plug into the internet.  I was able to order an adapter to plug the Ethernet cable into a USB port. I could have ordered the dock, but that would have added an extra $250 and at that price I should have just bought the upgraded version. The cheaper models of Dell have a known issue where the hinge on the monitor breaks. The screws come loose and if you are not watching, it will damage the plastic around the monitor. I leave my computer on a desk. When I do travel with it, I carry it in a padded laptop case. After 5 months of gentle use, this should not be a problem. I'm shipping it off to Dell for a repair. Technically I'm still under Basic warranty but we know they will still charge me for it. There is a long list of these complaints on the Dell support site about this and the company is not doing anything about it."
            },
            {
                "source": "main",
                "review_id": "RBJDONAVDLS67",
                "reviewer": "Larry Williams",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great shipping time",
                "review_date": "Reviewed in the United States on February 24, 2024",
                "review_text": "Love it, the main uses is business."
            },
            {
                "source": "main",
                "review_id": "R2B1INZNDTTMEO",
                "reviewer": "Donald Castellano-Hoyt",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell settings",
                "review_date": "Reviewed in the United States on October 24, 2023",
                "review_text": "I love that Dell has a button to assist in updates."
            },
            {
                "source": "main",
                "review_id": "R3MC54Y8JN1UQP",
                "reviewer": "Patrick Thomas",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Laptop for Son",
                "review_date": "Reviewed in the United States on December 20, 2023",
                "review_text": "This was a prefect gift for my son"
            }
        ]
    },
    {
        "title": "Dell Inspiron 3511 Laptop, 15.6\" Full HD Touchscreen, Intel Core i5-1135G7 (Beats Intel i7-1065G7), 32GB DDR4 RAM, 1TB PCIe SSD, SD Card Reader, HDMI, Wi-Fi, Windows 11 Home, Black",
        "product_id": "B0BRT67MWZ",
        "average_rating": "4.0 out of 5 stars",
        "review_count": "741 global ratings",
        "histogram": {
            "5_star": "61%",
            "4_star": "15%",
            "3_star": "5%",
            "2_star": "2%",
            "1_star": "17%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R24747UKBREA68",
                "reviewer": "Pris",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good Deal!",
                "review_date": "Reviewed in the United States on January 24, 2025",
                "review_text": "Extremely happy with my purchase of the Dell 15in laptop. Ordered on a Monday and received it on the following Sunday. I ordered 32gig RAM and 1TB SSD. The product description claimed “in stock” but I assume the seller had to build it to my specs so it took a few days. The laptop arrived in an original Dell box and the machine inside was NEW! I was half expecting to find a refurbished laptop. In addition, a Dell 3511 was advertised but I received a 3520. A Dell warranty screen popped up during the setup and I was able to register with Dell. The machine itself… The Dell 15 3520 is light but sturdily built. It has a good feel. I’ve had other laptops that were built with soft flexible plastic. That’s not the case with this one; it feels solid. Keyboard action is good to the touch. The display is clear and bright. I would say it is generally fast. I don’t use it for anything that taxes the processer too heavily, but I do considerable work in graphics (Photoshop and CAD.) The only lag or latency I found is in Windows 11 processing not the machine itself. The battery life seems adequate, but I haven’t had it long enough to be exact. Under light to moderate usage, I think you can expect to get about 3 to 4 hours. Battery life, of course, always depends on how hard you push your machine. Be aware that this model of Dell laptop does not have a “num lock” indicator, not on the key nor on the screen. You just have to guess if “num lock” is on or off. Dell… what were you thinking?!! I solved this by finding a third-party widget on the web. (keyboard-leds.com) I now have a visual indicator in the system tray. If you’re a mouse user be aware that there is no keyboard method to easily toggle the touchscreen or touchpad on and off. You’ll have to use “device manager” to control the touchscreen and “settings” for the touchpad. Windows 11 does, however, have a nice feature in “settings” which automatically turns off the touchpad when a mouse is detected. The setup process… Set up was easy except for Microsoft’s poorly designed OneDrive feature. Be aware that if you are a Microsoft 365 subscriber, like me, Microsoft forces you to use OneDrive with Windows 11. I first tried to setup my new laptop as a “new PC” without OneDrive and that cost me untold hours of frustration. If you already have a PC using OneDrive, Microsoft ignores the fact you are setting up a different machine and will automatically start loading your new machine with your other PC’s contents. Even if you turn off OneDrive, it will turn itself back on without notification. The point here is that Microsoft will corrupt both machines and there is no fix or workaround until you remove your other PC from your OneDrive account. By then it’s too late, you must then reconfigure and reorganize both machines. While setting up this new laptop I watched Microsoft delete the desktop and other files from my old laptop. BEWARE OF ONEDRIVE! If you don’t want a mess, remove your old laptop or PC from your OneDrive account before starting setup on a new one. OneDrive could be a wonderful tool if Microsoft knew how to implement it. And don’t think you can call Microsoft to get help. They do not offer support on what they sell. If you can’t find help on the web you are out of luck. You will spend hours on the internet searching and finding possible solutions that, in the end, don’t apply to your situation and Microsoft’s web-based support is an endless loop of worthless patronization that basically says, “We’ve already got your money, you are now on your own.” Overall… Good machine, Good Price, Good Seller!"
            },
            {
                "source": "main",
                "review_id": "R3DGLUM19G6A5J",
                "reviewer": "TClark",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excellent Laptop",
                "review_date": "Reviewed in the United States on December 23, 2024",
                "review_text": "I purchased this for my busy, adult daughter. She is more than thrilled with the speed, reliability and particularly the touch screen. She brags about no longer needing a mouse. I would buy another if the need arises."
            },
            {
                "source": "main",
                "review_id": "R1KR2ZLJKX6U0A",
                "reviewer": "Paul Stephens",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Dead within 7 weeks. Amazon vendor not helpful. Six months later, still not repaired by Dell.",
                "review_date": "Reviewed in the United States on November 5, 2024",
                "review_text": "Make sure you know from who and what you are purchasing. I purchased this laptop on Amazon thru Top Electronic store on May 3, 2024. The laptop worked fine for 7 weeks. Then one day, it wouldn't power on.  No screen, no lights, no activity.  Since it was already out of the 30 day return window, I contacted Dell directly for repair and mailed it to them under warranty repair. After receiving it, Dell told me that they would not repair it since a different SSD drive had been installed. At the time, I was under the assumption that I had purchased it directly through Dell on Amazon.  So I called Amazon. They put me in touch with Top Electronic store, the seller.  In communicating with them about the problem, they admitted that they put different SSD in the computer.  I told them I wanted a full refund because Dell would not do the repair on the laptop until I paid them $170 to put the stock SSD back into the computer after which Dell would diagnosed and repair the computer.  Top Electronic store refused and stopped communicating with me. The interesting thing in dealing directly with Dell, was that I learned that the one year warranty had started ticking in December 2023, not in May 2024 when I purchased it.  This tells me that the laptop was not a new laptop as advertised and likely a used or refurbished laptop.  Completely fraudulent in my opinion. After this, I spent a couple weeks trying to work with Amazon directly for a refund.  Ultimately, Amazon didn't refund it since it was out of the 30 day window.  In the meantime, Dell ships the laptop back unrepaired. So I decide to contact Dell again since technically it is still under warranty.  Now it's November 2024 and a local vendor for Dell is working on it. I will likely need to pay $170, but it is still not fixed. Truly one of the worst customer service experiences I have ever had.  In my communication with all of these groups and I have be civil and patient.  It has gotten me no where.  In my opinion this seller is selling used electronics at full price as new. I have now read other similar reviews with similar issues.  Buyer beware!!!"
            },
            {
                "source": "main",
                "review_id": "R3P7C0D8QMHPCB",
                "reviewer": "Byron Tyler",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Good Computer",
                "review_date": "Reviewed in the United States on January 19, 2025",
                "review_text": "It is a good computer. Works good for everything i need to do."
            },
            {
                "source": "main",
                "review_id": "R15GHYDRKSG2WG",
                "reviewer": "Louis D.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars It delvers decent performance",
                "review_date": "Reviewed in the United States on February 18, 2025",
                "review_text": "For its price I cannot think of anything better in what it should be doing. There are more expensive laptops that perform better, but for the price of this laptop in my opinion it is a total  steal."
            },
            {
                "source": "main",
                "review_id": "R1U5SWVTJGATKE",
                "reviewer": "Christian Emerson Rodriguez Corpus",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Laptop dell",
                "review_date": "Reviewed in the United States on January 12, 2025",
                "review_text": "Todo ok, excelente producto."
            },
            {
                "source": "main",
                "review_id": "R2KV02AI2UINO3",
                "reviewer": "William C",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars well packed",
                "review_date": "Reviewed in the United States on February 11, 2025",
                "review_text": "well packed and it was perfect when they both arrived"
            },
            {
                "source": "main",
                "review_id": "R118NKW7JHVFY7",
                "reviewer": "Garth Hassel",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Not 100% Dell led to problem",
                "review_date": "Reviewed in the United States on May 1, 2024",
                "review_text": "Worked great for exactly 2 months. Suddenly, the system did not even recognize that the display is a touch screen. Rolling back Win 11 update, having device manager human interface search for hardware changes, doing Dell-recommended hard reset did nothing. Dell support arranged shipping to them. Dell was good about handling this promptly. Dell replaced the FACTORY 256GB SSD and removed the NOT-FACTORY Kingston 1TB SSD (yes, there are two SSD slots). It shipped the 1TB back with the unit in a separate bag. I replied to Dell support email that I received it back and had questions. Dell rep called me and patiently answered my questions. Though his accent was strongly far-eastern, I could understand most of what he said and he kindly repeated when asked. In short, 3rd party retailers will supe up a Dell product (in this case) to upgrade its specifications. I've used Kingston drives many times with no issues, so this is not a criticism of Kingston per se.  But for whatever reason it was either faulty or incompatible. This purchase was a good deal even if it turns out to be 256 GB rather than 1TB. The problem is it wasted a ton of my time to resolve. See images for Dell return letter and Dell rep reply to my questions after we spoke on the phone. My only annoyance with Dell is that when they reinstalled Windows 11 home on the new SSD, they installed the S version. Windows claims the S stands for more \"secure.\" Perhaps, but you can ONLY install 3rd party apps downloaded from the Microsoft store. So, I could not install Zoom! That's unacceptable. I googled how to remove the S \"feature\" permanently. That worked, and I could then install the Zoom app."
            },
            {
                "source": "main",
                "review_id": "R1I66L59WE9N57",
                "reviewer": "Bobby",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Nice laptop with plenty of storage",
                "review_date": "Reviewed in the United States on July 1, 2024",
                "review_text": "I like the Inspiron laptop in all regards so far, except the keyboard.  The letters & symbols on the keys are pretty dim, and I am not a touch typist!  I have to always have a light on to type on it.  Otherwise I'm quite satisfied at the moment. The real problem I had was with delivery!  It was promised as a 2-day delivery and was supposed to be here June 4th.  Well, somebody lost or stole it, either going out the door at the vendor or at FedEx.  After waiting until June 10th as instructed, and then saying I still wanted it, UPS delivered the one I got on June 17th.  In the meantime my old laptop's keyboard was dead, and I was having to type using On-Screen Keyboard!  Try that sometime - it sucks!"
            },
            {
                "source": "main",
                "review_id": "R3RGIPV8R285C1",
                "reviewer": "Shailesh Mishra",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Working fine",
                "review_date": "Reviewed in the United States on July 12, 2024",
                "review_text": "I received the product in good condition, but I encountered an issue with Dell maintenance support after my screen stopped working a few days later. Although I got it replaced and paid for it, the entire process took about 50 days to get my unit repaired and restored to normal working condition. Unfortunately, the team did not thoroughly inspect the unit after replacing the screen and sent it back in a faulty condition, requiring me to resend the system again. This experience was somewhat painful. Otherwise, the laptop is now working perfectly fine."
            },
            {
                "source": "main",
                "review_id": "R43FFB6MPQJ6Y",
                "reviewer": "SweetEvan",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Very happy",
                "review_date": "Reviewed in the United States on December 27, 2024",
                "review_text": "We are very happy with the laptop we received. Setting it up was difficult but everything worked as it should. We have had the laptop for a few months now and have had no issues up to now. I would recommend to another for purchase."
            },
            {
                "source": "main",
                "review_id": "R1O57WSER41IFF",
                "reviewer": "Beverly Marshall",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dependable!",
                "review_date": "Reviewed in the United States on December 26, 2024",
                "review_text": "This is my 2nd Dell laptop in seven years and I can already see it will be reliable for many years to come. Plenty of memory and speed.  Battery is everthing it claims and so much lighter than my old Dell. Couldn’t be happier!"
            },
            {
                "source": "main",
                "review_id": "R3XSB9GPKVXLM",
                "reviewer": "BargainHunter",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Pretty good specs for the price",
                "review_date": "Reviewed in the United States on March 28, 2024",
                "review_text": "This laptop had 32 GB DDR4 ram and 2 TB SSD hard drive as well as a touch screen.  You will need to update windows 11 home.  There were problems with the touchpad turning off quite often.  Even after I deleted and updated the Dell drivers and updated Windows 11 Home it continued.  They were driver issues and Microsoft support finally connected and changed the drivers and did some kind of Windows update that fixed the problem.  These issues should have been taken care of by the seller before shipping in my opinion.  That has been the only issue so far."
            },
            {
                "source": "main",
                "review_id": "R2MBH9NK4GN0MO",
                "reviewer": "Kevin Arceneaux",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Light weight",
                "review_date": "Reviewed in the United States on January 14, 2025",
                "review_text": "Great picture and all my software works on it"
            },
            {
                "source": "main",
                "review_id": "RXIR3DUP1JJZP",
                "reviewer": "Strawberry 🍓",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars I am fairly happy with this purchase",
                "review_date": "Reviewed in the United States on June 10, 2024",
                "review_text": "I am not very pleased with the battery life on this laptop. Also, I didn't realize it did not have a speaker.  But other than that, I feel it is a decent laptop. I have touch screen and like the option on it.  Love the keyboard set up with the 10 key available. Major plus!"
            },
            {
                "source": "main",
                "review_id": "RPTT73UJ8XK1M",
                "reviewer": "jatacol12",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars issue with few keys of keyboard not working, and broken hinge",
                "review_date": "Reviewed in the United States on September 4, 2024",
                "review_text": "About 6 months after purchase, 4 keys on keyboard not working. 9 months after purchase, the right hinge suddenly break. I contact Dell support, and since it's still under warranty, they fix the issue. It takes about 10 days. Then, when i received my laptop and turn it on, it gave me blue screen. I contacted Dell again, and they asked me to send it back again, said that motherboard need to be replaced. I was perplex how Dell technician manage to break the motherboard while fixing the hinge. Then, Dell inform me that they found out that my laptop is missing rubber (feet), and since it's not cover by warranty, it will cost me $50+ to replace it. Again, i was amazed how can they charge me $50+ just to replace rubber feet. You can find it in amazon for less than $10. I said i don't need them to be fixed as it's not affect any functionality of this laptop. Couple days later, they send me message \"Because of an issue that requires your attention, our repair technician is unable to begin your system repair. This issue might be related to your software or system password, or it may be something else.\" I called Dell and asked for my password to login to my account. I refuse to give it, and tell Dell to do hard reset to factory default. It's been almost a month (rather than 5 - 10 business days, Dell promise to fix my laptop). I also found that apparently there's a class action lawsuit against Dell hinge issue (you can google Dell hinge class action lawsuit) going on. Apparently, Dell (may) aware of this defect hinge, but they continue to use it on their laptop. My old Dell was about 6 years before the (right) hinge broken. Then, i purchase this one. The hinge broke less than a year, make me suspicious and google the issue, and found out about this class action lawsuit. It's been very disappointed with this product. Nothing good i can give, other than 1 star (zero if i can)."
            },
            {
                "source": "main",
                "review_id": "RSFXU058UFC32",
                "reviewer": "Steve",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars fast and easy to work with",
                "review_date": "Reviewed in the United States on January 6, 2025",
                "review_text": "so far no dislikes"
            },
            {
                "source": "main",
                "review_id": "RXPT6L67OEG7T",
                "reviewer": "Dan Amazon 2021",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars computer is stuck in safe mode and is totally useless to me, I can't even install google chrome.",
                "review_date": "Reviewed in the United States on June 20, 2024",
                "review_text": "I can't even install google chrome. I've spent two entire days trying to resolve, including all of the microsoft forums. Totally, frustrating - i would never recommend this product. I'm trying to return it, no luck so far tho the seller responded quickly and helped me resolve what is/was clearly a microsoft issue. hopefully they stop selling such a flawed operating sytem, or make it crystal it ships with Win11 locked into safe mode i'm upgrading mt rating from a 1 to a 3 as i'm still totally unhappy to had to go through all of this"
            },
            {
                "source": "main",
                "review_id": "R2GXLQGRKR1LD2",
                "reviewer": "T.H.",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Read about multiple monitors",
                "review_date": "Reviewed in the United States on February 9, 2024",
                "review_text": "This laptop does not have a usb-c port with video for a third monitor. It has one hdmi port to hook to one monitor. Had to buy this other part which plugs into the usb port and outputs video to to monitors, for extended display. WAVLINK USB 3.0 or USB C to HDMI Adapter for Dual Monitors, Universal Video Graphics Adapter for Mac and Windows, Thunderbolt 3/4, USB 3.0 or USB-C,"
            },
            {
                "source": "main",
                "review_id": "R3G81968NOX4C0",
                "reviewer": "Marcia L. Meldrum",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Customer support not great",
                "review_date": "Reviewed in the United States on March 23, 2024",
                "review_text": "The laptop is less than three months old, and there is a problem with one of the hinges; the frame is separating from the screen.  When I called Dell, they were first rude and then, when I reached a polite rep, she nevertheless could not suggest any action other than my boxing it up and returning it.  Since I cannot be without a laptop for the 10 days (at least) it would take to fix the small hinge problem, this is not feasible.  So now I have a practically new laptop with a broken frame (No I didn't drop it).  My opinion of Dell has dropped quite a bit."
            },
            {
                "source": "main",
                "review_id": "R1XBZ9MJJJGIYA",
                "reviewer": "Mary",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Great value, but POOR battery life",
                "review_date": "Reviewed in the United States on May 22, 2024",
                "review_text": "Great value for the money, but battery life is POOR.  You're lucky if you get 2 hours of battery life before it dies."
            },
            {
                "source": "main",
                "review_id": "R3MW1WRGX9FBTQ",
                "reviewer": "R. Maston",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars warranty voided",
                "review_date": "Reviewed in the United States on December 4, 2024",
                "review_text": "Purchased this in Feb 2024 here it is November I open the laptop and nothing happens. I try a few more times and finally I get the dell logo and then I have an error screen. No problem I call Dell and they tell me yes its under warranty so I send it in. A few days later I get a call from India? telling me they have determined that the warranty is void due to something having been installed NOT FROM DELL! What!? No way I have never opened it to install anything. We go back and forth for awhile but I loose in the end as they will do nothing. Then I do my research because I purchased it from Amazon....NOPE not really! All the time I buy from Amazon I never thought that I would have to research the individual sellers like I have to do other places but yep you sure do! I find the \"actual\" seller and find they only have an 80% rating from buyers!!! Woe is me!? Hmm not YET! My next contact is with Amazon. Not sure what their position will be but I have hope...still. Oh the seller? Yes there are quite a few complaints about not getting what people pay for and voided warranties  etc...."
            },
            {
                "source": "main",
                "review_id": "R3RG02IN3WF3BX",
                "reviewer": "Mk",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Descent for the price",
                "review_date": "Reviewed in the United States on April 13, 2024",
                "review_text": "Have had some sound issues with it at set up and once after. Just getting sound to work at all from the laptop itself was the issue. Once beyond that it's been fine."
            },
            {
                "source": "main",
                "review_id": "RYYDSRRO2DK7T",
                "reviewer": "Dillard Henderson",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Quick shipping",
                "review_date": "Reviewed in the United States on December 14, 2024",
                "review_text": "Great replacement for my old one"
            },
            {
                "source": "main",
                "review_id": "R3UZSQYHFY83CO",
                "reviewer": "Magnetic Dave",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Works well. No complaints.",
                "review_date": "Reviewed in the United States on August 2, 2024",
                "review_text": "Works well. No complaints."
            },
            {
                "source": "main",
                "review_id": "R31E1UBJNIRHSJ",
                "reviewer": "Jeff L",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Came in Windows S-Mode, and warranty started 3 months before I received it.",
                "review_date": "Reviewed in the United States on July 12, 2024",
                "review_text": "Came in Windows S-Mode, I've tried everything to get it taken off. (This only allows you to install Microsoft apps, no third party apps allowed). Also, the warranty was already initiated 3 months before we received it. Everything was packaged nicely, had all the literature, etc., but just not what was expected/paid for."
            },
            {
                "source": "main",
                "review_id": "R258NSIVZGKMR7",
                "reviewer": "Diana S",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Love my Dell",
                "review_date": "Reviewed in the United States on June 18, 2024",
                "review_text": "Was in need of a computer up grade.  It had been almost 10 years. I've never had a Dell but have used it a couple of months now and I LOVE it! I've been using it since late February and I like it better each time I start it up to use. It has everything on it I need for working, social media, online shopping, and things I am still learning to use. Seemed like a good value.  Thanks Dell (and Amazon)"
            },
            {
                "source": "main",
                "review_id": "R1V12ZFDBOMW37",
                "reviewer": "Mark",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Good performance",
                "review_date": "Reviewed in the United States on June 10, 2024",
                "review_text": "Runs great, no issues. Battery life good Touch screen is a plus Good size"
            },
            {
                "source": "main",
                "review_id": "R1ZRHABSBXGT4N",
                "reviewer": "Edgar Allen Poor",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars slow",
                "review_date": "Reviewed in the United States on May 14, 2024",
                "review_text": "it’s a good functional attractive laptop. That being said, considering the components. It is extremely slow."
            },
            {
                "source": "main",
                "review_id": "RZ987EQCXEMVH",
                "reviewer": "Ángel Del Rosario ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Buena capacidad en esta pc",
                "review_date": "Reviewed in the United States on December 8, 2024",
                "review_text": "Me gustó mucho"
            },
            {
                "source": "main",
                "review_id": "R7BS0YYWHQTVZ",
                "reviewer": "grangke1",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great laptop",
                "review_date": "Reviewed in the United States on May 12, 2024",
                "review_text": "This is a very nice Dell laptop. It has the speed , storage and memory I needed to do spreadsheets, email, etc for home office. The touch screen is very nice. I bought a portable dvd drive (cheap) and an Ethernet adapter for one of the usb ports and voila, it has everything I needed. I particularly like the light weight. The old laptop I replaced probably weighed twice as much. I  searched a while before deciding on this one…. Glad I found it!"
            },
            {
                "source": "main",
                "review_id": "RT9QL5J8A5VZ9",
                "reviewer": "JRMix",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars Window 11 arrives in \"S mode\"",
                "review_date": "Reviewed in the United States on May 11, 2024",
                "review_text": "I wouldn't if the hardware is any good because the OS is comes with is locked in S mode which only allows us to run apps from the windows store.  Cutting 90% of it's utility.  I'm supposed to be able to turn off S mode and get into grown up windows from the system settings but every time I try it, I'm told \"something happened and we couldn't start the upgrade\". I can only run the update from the windows store, and that's not working.  I just want a regular full access windows 11 license, locking me into the garbage windows curated store is anti-consumer bullshit. I'm about to blow away the entire OS with an external install media and re-load windows fresh but this has ruined the experience for the person this was a gift for, I HATE that Microsoft's effort to corral me into their piece of crap windows store makes this much work needed, and I resent Dell for letting them do it."
            },
            {
                "source": "main",
                "review_id": "REHQTLKAVYOEW",
                "reviewer": "Caffeinated",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Good computer.  The HDMI port seems to be video only.",
                "review_date": "Reviewed in the United States on August 12, 2023",
                "review_text": "Usually the HDMI port is both video and audio, but when I hook into a projector that has audio too (through the HDMI port) the sound doesn't work.  I've tried it on different systems and it just hasn't worked.  Other than that minor problem, it works great and it was a good price.  Under most circumstances, I don't even notice it because I would play the sound out of external speakers."
            },
            {
                "source": "main",
                "review_id": "R1F486SECY1A8J",
                "reviewer": "Amazon Customer",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars great",
                "review_date": "Reviewed in the United States on December 4, 2024",
                "review_text": "great"
            },
            {
                "source": "main",
                "review_id": "R1H4M6FGAPPK19",
                "reviewer": "J. L Kelly",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Very Poor Battery Life",
                "review_date": "Reviewed in the United States on March 18, 2024",
                "review_text": "Very good screen resolution, bright and sharp definition.  Touch screen highly sensitive, I had to set on lowest sensitivity.  Likewise the keyboard and touchpad also extremely sensitive, expend a lot of time correcting false key strokes. Worst feature is TERRIBLE BATTERY LIFE,  less than 2 hours with normal use even with battery saver on.  Don't buy unless you can keep it plugged in most of the time."
            },
            {
                "source": "main",
                "review_id": "R1BHI10UDDD81Q",
                "reviewer": "Jeff White",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Powerful",
                "review_date": "Reviewed in the United States on October 23, 2024",
                "review_text": "Set up was smooth. Data restored through OneDrive quickly. Intense-data programs launched quickly - much faster than my older laptop."
            },
            {
                "source": "main",
                "review_id": "R2PDMZ7IYDSZ7L",
                "reviewer": "Robert Olson",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great",
                "review_date": "Reviewed in the United States on November 16, 2024",
                "review_text": "I like it very much."
            },
            {
                "source": "main",
                "review_id": "RWZ0Y49BWC701",
                "reviewer": "Tony Leist",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Quality",
                "review_date": "Reviewed in the United States on May 4, 2024",
                "review_text": "Capacity Setup ease Touch screen"
            },
            {
                "source": "main",
                "review_id": "R19TKXZ8352T2G",
                "reviewer": "Barb T.",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Great price but keyboard is not lighted.",
                "review_date": "Reviewed in the United States on December 11, 2023",
                "review_text": "Perfect replacement laptop for our aging one. But it does not have a lighted keyboard.  So, we purchased a separate bar to illuminate the keyboard surface.  Big drawback.  Investigated replacing the keyboard. Unsure if it is advised."
            },
            {
                "source": "main",
                "review_id": "RPKRB4U23VLD2",
                "reviewer": "FRANCISCO LOPEZ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Luce bonita y buena, pero no barata",
                "review_date": "Reviewed in the United States on August 31, 2024",
                "review_text": "Me gustó que tiene sensor de huella digital, se pueden bloquear el micrófono y/o la cámara con una tecla de función, pantalla táctil y se puede desdoblar. Velocidad de procesamiento bastante buena. La pila dura muy poco."
            }
        ]
    },
    {
        "title": "Dell Inspiron 15 3000 3520 Business Laptop Computer[Windows 11 Pro], 15.6'' FHD Touchscreen, 11th Gen Intel Quad-Core i5-1135G7, 16GB RAM, 1TB PCIe SSD, Numeric Keypad, Wi-Fi, Webcam, HDMI, Black",
        "product_id": "B0CC936WF1",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "358 global ratings",
        "histogram": {
            "5_star": "66%",
            "4_star": "15%",
            "3_star": "5%",
            "2_star": "2%",
            "1_star": "12%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R244CE157YYP5M",
                "reviewer": "P Brac",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great laptop. Great price",
                "review_date": "Reviewed in the United States on January 22, 2025",
                "review_text": "I like Dell laptops, with touchscreen, runs faster than my old machine. All the features I wanted ."
            },
            {
                "source": "main",
                "review_id": "R3SCKYHTDCBIV1",
                "reviewer": "Angela Conti",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great little laptop.",
                "review_date": "Reviewed in the United States on February 25, 2025",
                "review_text": "My business laptop's hard drive crashed. I ordered this one until I could find another. It's fast and has a nice battery life for a second work laptop."
            },
            {
                "source": "main",
                "review_id": "R1V5OUSCE2UM9H",
                "reviewer": "Jeff",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Always a good product",
                "review_date": "Reviewed in the United States on January 6, 2025",
                "review_text": "I've had several Dell computers over the years.  My last laptop was an hp and broke after only three years.  The back of the base cracked.  It was usable but I could not close the cover.  The speed was also slow.  After doing some research, I found this Dell model.  The hp was bigger and that posed some problems.  This size is better.  The only drawback that I didn't notice when I ordered is that it does not have backlit keys.  Other dells have had this and once you have, it you get spoiled.  For now, it's been great."
            },
            {
                "source": "main",
                "review_id": "R2ATLKKUFGIWVX",
                "reviewer": "M. Pelland",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Nice one",
                "review_date": "Reviewed in the United States on January 7, 2025",
                "review_text": "I returned three \"refurbished\" Amazon laptops--very annoying and time consuming. Each had problems. In days gone by, refurbished or renewed electronics were a good value and dependable. I gave up and chose the new model of this Dell. Win 11. It is exactly what I need with no issues, no problems. The keyboard lights up. The cover is attractive. The unit works perfectly. Buy new--it's worth it."
            },
            {
                "source": "main",
                "review_id": "R3CYSD4VLZLHPU",
                "reviewer": "Capt. C.",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars DO NOT BUY FROM THIS SELLER !!!",
                "review_date": "Reviewed in the United States on June 11, 2024",
                "review_text": "I can only begin this review with serious misgivings about this particular Dell Inspirion laptop.  When one purchases a product from a \"Dell Vendor\", one presumes it is a 100% Dell product.  Apparently this was not the case with this laptop.  Exactly 3 days after the Amazon/Vendor's return policy ran out, this laptop stopped working.  The error message was \"Corrupt Hard Drive\".  I can understand electronic devices will sometimes have issues.  I can also understand manufacturers and vendors need to have a limit on how long they will allow items to be returned.  So we called Dell Warranty Service, and they were very helpful.  They sent a box, pre-paid shipping label and we thought that would be the end of it.  Wait a reasonable time for the laptop to be repaired under warranty, and we could go on with our lives.  NOT SO.  According to the Dell Warranty Center, this particular laptop has a 3rd Party Hard Drive.  Not a hard-drive provided by Dell or installed by Dell or used by Dell.  So... our laptop was... in fact... not able to be repaired under warranty.  Dell has offered to fix the laptop and install the correct, but the repair is nearly as much as the laptop cost new from Amazon.  This is totally unacceptable!  When we bought the laptop, we presumed it was a new Dell Laptop with appropriately sourced and installed electronics that would be approved by Dell (or installed by Dell)... BUYER BEWARE of ROKC Electronics.  They have offered NO Help,  NO Sympathy,  and we are now completely out of the money we spent, and have a laptop that is absolutely Useless!!!!  I can only imagine if we were still in the window for return, they would put the same Non-Dell parts back in, and we would be facing similar issues down the road.  This is not the way to run a business.  And certainly not the way an Amazon vendor should be doing business.  Very Very Very Disappointed!"
            },
            {
                "source": "main",
                "review_id": "R37SKWAUTFQOFH",
                "reviewer": "Mark F.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell is the way",
                "review_date": "Reviewed in the United States on December 11, 2024",
                "review_text": "I've been using Dell laptops, workstations and servers and network switches for 3 decades. In this time, I've had one server motherboard replaced under warranty and all the other hardware goes way past its life expectancy with some equipment running a decade or more without issues. You simply can't go wrong with a Dell product. My laptop has been running flawless and the build quality is outstanding as with all of their other products. Buy it !"
            },
            {
                "source": "main",
                "review_id": "R24I4F3C6JGN1Z",
                "reviewer": "Karmen KG",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars fast",
                "review_date": "Reviewed in the United States on January 29, 2025",
                "review_text": "this is very fast, light, and small not too small but enough to read well"
            },
            {
                "source": "main",
                "review_id": "R1G1222BHINDIH",
                "reviewer": "annefleischmann",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Worked well out of the box",
                "review_date": "Reviewed in the United States on January 12, 2025",
                "review_text": "Like the Win 11 and touchscreen works well. Very thin and lightweight."
            },
            {
                "source": "main",
                "review_id": "R4LF6I648JWA0",
                "reviewer": "Joe Bios",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Happy with purchase - A few helpful things to know",
                "review_date": "Reviewed in the United States on December 21, 2024",
                "review_text": "I purchased a Dell 3520 Win 11 Pro from a reseller \"Like New\". A few things folks might find helpful. 1. Dell sells a limited set of configurations (Memory, SSD, etc), so resellers open the laptop to \"upgrade\" memory, SSD to offer more choice in configurations. Of course, this begs the question what components are being installed. In my case the components were reasonable: 16GB Samsung DDR4 3200 memory and WD Green 1TB SSD, but its \"reasonable\" to check the delivered system. 2. Microsoft defaults to keeping a \"remarkable\" amount of information about your activities, like every app installed, every webpage viewed, etc., so I strongly suggest logging into your Microsoft account (account.microsoft.com) and turn on every privacy control they provide. Then clear the accumulated history and log into the account in a day or so and check if they stopped accumulating data. 3. Windows PRO provides S Mode which is a restrictive version of Windows (only M$ store apps, lighter weight process controls etc). This is mostly for PCs going to less than trusted employees. Turning off S Mode is a one-way trip, i.e. it cannot be reenabled (essentially forever). The system I receive had S Mode off. This is something I would have done anyway, but it's something to consider if you need S Mode for employee users."
            },
            {
                "source": "main",
                "review_id": "R3HZFA9T8M03QL",
                "reviewer": "Wendell Cortes",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Feedback",
                "review_date": "Reviewed in the United States on February 4, 2025",
                "review_text": "I didn't give 5 stars due to discrepancies with the Dell Inspiron 15 3000 3520 Business Laptop. I received Windows 11 Pro N instead of Windows 11 Pro, lacking features like Windows Media Player, Camera, and Skype. The laptop also has a standard SSD instead of the advertised NVMe PCIe. However, it did come with a 12th Gen processor instead of the expected 11th Gen, which was a pleasant surprise. Although, not sure if I should be worried about the processor having a 1.30ghz of base speed when it was advertised as having a 4.5ghz of speed. Any thoughts on that?"
            },
            {
                "source": "main",
                "review_id": "R3DVJ65F3HTRDO",
                "reviewer": "David Hayes",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Dell Inspiron",
                "review_date": "Reviewed in the United States on February 23, 2025",
                "review_text": "I was disappointed when the keyboard did not light up.  Everything else about this laptop is great. The light bar I purchased was a game changer."
            },
            {
                "source": "main",
                "review_id": "R2HL8M899T9C4S",
                "reviewer": "Amazon Customer",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars dell computer",
                "review_date": "Reviewed in the United States on February 6, 2025",
                "review_text": "this dell computer does work well. the volume keys do not work, I downloaded an app and have problems with it. I would like to return this dell computer. I can not get the apps. that I am use to. I need a computer that I can the apps. that I need. I also need to update my grand daughter Tandem insulin pump and can do it on this computer. I can do this on a computer that has play store on it. The pump need to be updated before the end of this month. I have 2 computers picked out in my cart to choice from. THIS IS VERY IMPORTANT THAT I GET INSULIN PUMP IS VERY NECCESARY TO MY GRAND DAUGHTER.  THANK YOU VERY MUCH I am so sorry, I did see your  report and credit to my account. I would like to send back to you. please send me a return label so I can print it out and send back to you.  Like I said I AM SO SORRY I DID SEE THE RETURN TO ME  THANK YOU VERY MUCH I received the new computer and returning the dell computer in the box the new computer was in.  How do i return it back, do I need a return label"
            },
            {
                "source": "main",
                "review_id": "RAO43HABJPXA6",
                "reviewer": "Kenneth Wright",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Work as detailed",
                "review_date": "Reviewed in the United States on January 17, 2025",
                "review_text": "It would be nice to have more colors available"
            },
            {
                "source": "main",
                "review_id": "R1V5SPLXNI16C4",
                "reviewer": "Omar",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excelente calidad precio",
                "review_date": "Reviewed in the United States on February 7, 2025",
                "review_text": "Excelente equipo,tiene muy buenas propiedades, muy rapida,buen precio la recomiendo 100%"
            },
            {
                "source": "main",
                "review_id": "R55RRJG7TMYH6",
                "reviewer": "Chad",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars My first",
                "review_date": "Reviewed in the United States on January 22, 2025",
                "review_text": "This arrived FAST!! I was very surprised. First laptop Ive ever owned!! Nice!"
            },
            {
                "source": "main",
                "review_id": "R24P7TPGQBUIQM",
                "reviewer": "Dora Edvalson",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars The advertisement was inaccurate and misleading",
                "review_date": "Reviewed in the United States on September 14, 2024",
                "review_text": "1. The ad did not say anything about the computer being a windows 11 pro N.  Pro N does not have any of the technologies such as media playback or movies and videos.  Pro N is primarily for business.  This was important information to know prior to purchase, as the features that were not standard with the computer were the exact features we needed. 2. The computer was advertized as new, which was accurate, but the OS that was installed is an old version of Windows Pro N 21 H 2.version.  It took hours to update to 23 H 2.  In addition, we had to manually add all the missing technology components for the use of Media compatibility; the components had been moved from where they were originally placed, and we had to search through windows to find them. 3. The delivery was delayed which sometimes does happen"
            },
            {
                "source": "main",
                "review_id": "R2WYCGMY4GKUNF",
                "reviewer": "Gwen Eagle",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good laptop",
                "review_date": "Reviewed in the United States on January 14, 2025",
                "review_text": "For my law school granddaughter.  She is happy with it.  Uses it every day."
            },
            {
                "source": "main",
                "review_id": "R66XKRIOJUB1Z",
                "reviewer": "jeviloriar",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars muy buena y su relación precio beneficio es insuperable",
                "review_date": "Reviewed in the United States on December 20, 2024",
                "review_text": "soy un poco exigente con los equipos tecnológicos, pero esa laptop me dejó sorprendido, su excelente pantalla táctil, su velocidad al correr aplicaciones y su elegante diseño me convencieron, mi hija la disfruta mucho en su universidad, estoy muy satisfecho con el rendimiento de la laptop."
            },
            {
                "source": "main",
                "review_id": "R3J2T5FJIZWO6N",
                "reviewer": "JennyH",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great Laptop",
                "review_date": "Reviewed in the United States on January 11, 2025",
                "review_text": "The laptop was shipped right away and It came 2 days early. It is a wonderful laptop."
            },
            {
                "source": "main",
                "review_id": "RZ4VKXR2A2XI3",
                "reviewer": "meir samila",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Very satisfied, very good value for the money paid",
                "review_date": "Reviewed in the United States on December 19, 2024",
                "review_text": "I love Dell computers and for the past ten years I have only bought Dell computers and I have never been disappointed and I am very satisfied. You get good value for the money you pay and I am also very satisfied with my latest purchase."
            },
            {
                "source": "main",
                "review_id": "R27IH2D3QGOYND",
                "reviewer": "Dave T",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Laptop Computer",
                "review_date": "Reviewed in the United States on September 27, 2024",
                "review_text": "I feel the product will do just what I expected. Delivery was fine"
            },
            {
                "source": "main",
                "review_id": "RCB123328P9MV",
                "reviewer": "Satisfied Customer",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Exactly what I ordered, thank you!!",
                "review_date": "Reviewed in the United States on December 23, 2024",
                "review_text": "LAPTOP is exactly what I ordered, runs great, and delivered by the time I needed it. Couldn't be any happier! Thank you!"
            },
            {
                "source": "main",
                "review_id": "R2Z9Q4PAIQFO84",
                "reviewer": "Gerardo Amico",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excelente",
                "review_date": "Reviewed in the United States on January 8, 2025",
                "review_text": "muy buen producto."
            },
            {
                "source": "main",
                "review_id": "R1X3VFWTEC1XYK",
                "reviewer": "Scory",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars Cheap Materials, poor warranty from Dell, Amazon so far not much better. Should buy from Costco.",
                "review_date": "Reviewed in the United States on June 19, 2024",
                "review_text": "Cheap materials includes the plastic area of the hinges and where the hinges connect to the lid. The lid and monitor began to separate and crack due to the hinge being very tight and cracking, putting extra stress on the lid when opening. Also the keyboard is very loud and cheap in comparison to another, more expensive laptop that I own. It was difficult to find how to get support for the cracked lid case, I settled for chat through text. Several times the support people said they needed to check with \"the team\" and would be right back, but I would not hear from them until the next day when they said that because they have not heard from me, they will soon close the ticket. Finally their solution is for me to answer a list of questions that have nothing to do with my issue so that they can set me up with sending the laptop to be repaired. This experience with Dell support does not give me confidence that the laptop will be repaired in a timely manner. I have now reached to Amazon support to see if Amazon will stand behind the product. They gave me a return pickup and said they will give credit once they receive the laptop (I plan to purchase a different laptop with the credit). The product was picked up by UPS and delivered to Amazon two days ago, but Amazon has not acknowledged the return yet. Now, despite what the website and the Amazon employee said, I read that they can take up to 30 days to refund me. Costco stands behind what they sell, give instant credit when you are in the store, and doubles the warranty. Next time I am going back to purchasing electronics from Costco."
            },
            {
                "source": "main",
                "review_id": "R3HEVADDRQGWLR",
                "reviewer": "twig51",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars good",
                "review_date": "Reviewed in the United States on September 11, 2024",
                "review_text": "good"
            },
            {
                "source": "main",
                "review_id": "R2216LRK08FQ7W",
                "reviewer": "Private",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Missing a few things",
                "review_date": "Reviewed in the United States on November 9, 2024",
                "review_text": "Did not have backlit keyboard as advertised and was windows 11 pro N  not windows 11 pro which does not have media pack on it."
            },
            {
                "source": "main",
                "review_id": "R2NPZKIQ8V0DMU",
                "reviewer": "GreenWay",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Inaccurate Discription",
                "review_date": "Reviewed in the United States on June 13, 2024",
                "review_text": "On the Spec sheets it showed the processor at 4.2 but its only 2.5 when I questioned them this was the response  Even though they did offer to take it back I just put a couple of expensive programs on the computer, photo editing is why I checked the speed.  I will be out that cost..  Even though they agree the discription is wrong they have yet to change or clarify.  Still like the computer but I would have bought something a little faster had I known This computer's base frequency is 2.5 GHz and can run up to 4.2 GHz on a single core when the system demands it. The product description is indeed inaccurate."
            },
            {
                "source": "main",
                "review_id": "R2DWZOUPON055T",
                "reviewer": "Sugars",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great purchase!",
                "review_date": "Reviewed in the United States on November 11, 2024",
                "review_text": "Have always love Dell laptops. I have had no issues thus far. I would. Have been great if a case/ carrier was added, to encourage sales. Speed and storage excellent. Worth it."
            },
            {
                "source": "main",
                "review_id": "R2GXADWQ5JSYSR",
                "reviewer": "HP Printer User",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Very good so far!!",
                "review_date": "Reviewed in the United States on May 23, 2024",
                "review_text": "I really needed a new laptop and so upgraded to Windows 11 that might be real issue ......not sure if I got enough RAM but will have to see.....I prefer logictech mouse instead of Dell's Dell is suppose to be much better computer than Asus"
            },
            {
                "source": "main",
                "review_id": "R2CHN9NH45U3DX",
                "reviewer": "Samuel's Facts.",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good value.",
                "review_date": "Reviewed in the United States on December 10, 2024",
                "review_text": "Very good value. The seller is quite kind and decent as well."
            },
            {
                "source": "main",
                "review_id": "R2JSJMDIGYFHXB",
                "reviewer": "Shannon",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell inspirion laptop",
                "review_date": "Reviewed in the United States on November 17, 2024",
                "review_text": "Product arrived. And I am happy so far with the functionality of the product. Meets my expectations. Light weight and i like the touch Screen."
            },
            {
                "source": "main",
                "review_id": "RTXN9A8WHBLND",
                "reviewer": "Anne Westphal",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Easy to set up and use",
                "review_date": "Reviewed in the United States on November 6, 2024",
                "review_text": "I love the touchscreen and the ease of use.  The quality of the computer is great and I am pleased with the product for the price."
            },
            {
                "source": "main",
                "review_id": "R1WQ45RWNH0YPV",
                "reviewer": "Cliente de Kindle",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excelente",
                "review_date": "Reviewed in the United States on December 15, 2024",
                "review_text": "Excelente computadora"
            },
            {
                "source": "main",
                "review_id": "R1HX6I51Z0IUQW",
                "reviewer": "liliana",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Buen producto",
                "review_date": "Reviewed in the United States on December 12, 2024",
                "review_text": "Excelente 👌"
            },
            {
                "source": "main",
                "review_id": "R3KQBPZEQU8WTJ",
                "reviewer": "Jaime González",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Hola",
                "review_date": "Reviewed in the United States on December 5, 2024",
                "review_text": "Exelente"
            },
            {
                "source": "main",
                "review_id": "R1XXK2UJR575AH",
                "reviewer": "Sanvhi",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars Slow performance",
                "review_date": "Reviewed in the United States on February 18, 2025",
                "review_text": "This laptop feels pretty slow, especially when loading data. It takes longer than it should, which makes working on it a bit frustrating."
            },
            {
                "source": "main",
                "review_id": "R20TU1Y4Y0J9VT",
                "reviewer": "Amazon Customer",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars No keyboard backlight",
                "review_date": "Reviewed in the United States on February 2, 2025",
                "review_text": "Had this laptop for a couple months. There is no backlight. Keyboard is starting to go back. Not typing correctly."
            },
            {
                "source": "main",
                "review_id": "R19GFQTHKZA69C",
                "reviewer": "Melissa Ryan",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars New Computer",
                "review_date": "Reviewed in the United States on October 21, 2024",
                "review_text": "Very nice product for the money. Very sleek and the perfect size for me!"
            },
            {
                "source": "main",
                "review_id": "R1S56GFPWNPOZ2",
                "reviewer": "Chele4k4g",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars Defective unit",
                "review_date": "Reviewed in the United States on June 7, 2024",
                "review_text": "I bought this based on performance, touchscreen and RAMs available. The touchscreen started zigzagging and then the unit wouldn’t turn on, so I’ve retrieved it. I will buy another Dell in a store because they are a great brand. I think I just received a lemon. Thank you, Amazon for an easy return."
            },
            {
                "source": "main",
                "review_id": "R2POKRX1VJ6YE6",
                "reviewer": "3pirates",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Dell follow up support, hardrives and software loads",
                "review_date": "Reviewed in the United States on July 10, 2024",
                "review_text": "This was the second Dell Inspiron 3520 I have tried. I also purchased an Asurion support plan as well.  From the initial software load (nothing had been added) Both units mysteriousy powered themselves on to a system login screen at 12:50 pm or 01:30am everyday. They were in a hard shutdown phase. I worked in IT for 40 years could not solve it, tempted to do a full system reload ( but did not it is a new system).  Tried a System reset and Windows load, that did not work, there were no entries in  the BIOS menus to address this either.  Contacted Asurion, they ran the same processes and test with the same results. Recommended returning to Amazon. When the second unit arrive with the same issue. I reached out to Dell support. After reviewing the system and checking the Dell system hardware page they determined the system was shipped orginally with 8 GB of memory and a 256 GB SSD drive. When ordering the system from Amazon I had chosen 16 GB and 1 TB. All that to SAY DELL WOULD NOT HELP AS THE SYSTEM HARDWARE HAD BEEN UPGRADED FROM ORIGINAL SPECIFICATIONS.  They recommended a full system format and reload if this 1 TB harddrive was to be used.  Net result the system has been returned to Amazon.  Not all systems will experience this but  I have seen 2 systems that had the same issue. That is a pattern my  friends."
            }
        ]
    },
    {
        "title": "Dell Inspiron 3520 15.6\" Touchscreen i7 Laptop, 15.6\" FHD Touchscreen, Intel Core i7-1255U, 32GB RAM, 1TB SSD, Numeric Keypad, Webcam, SD Card Reader, HDMI, Wi-Fi, Windows 11 Home, Black",
        "product_id": "B0D951M4F8",
        "average_rating": "4.0 out of 5 stars",
        "review_count": "58 global ratings",
        "histogram": {
            "5_star": "60%",
            "4_star": "17%",
            "3_star": "4%",
            "2_star": "2%",
            "1_star": "17%"
        },
        "review": [
            {
                "source": "main",
                "review_id": "R1VYEWDIR2B4ND",
                "reviewer": "Jenny",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Very good and smooth laptop!",
                "review_date": "Reviewed in the United States on February 25, 2025",
                "review_text": "This is a very nice laptop! It runs very smoothly and has a ton of capacity. Excellent value and good battery life! The speakers might ring a bit if you’re playing very loud music from it."
            },
            {
                "source": "main",
                "review_id": "RDAW8KN7LN3MR",
                "reviewer": "Tech Savvy",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Best laptop out there at this price",
                "review_date": "Reviewed in the United States on February 5, 2025",
                "review_text": "For the price, this is the best laptop I’ve owned in a while. No complaints at all."
            },
            {
                "source": "main",
                "review_id": "R3UJCFG444CUD8",
                "reviewer": "Timothy Ludwig",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Doesn’t even work",
                "review_date": "Reviewed in the United States on January 4, 2025",
                "review_text": "I bought this laptop because I am unemployed software developer and I wanted to learn some new technologies while I have the time but this laptop only turned on once, the day I got it and even that was after I hit the power button a couple times. So I charged it over night and now it doesn’t work at all. I noticed when I plug in power cord the power light only charges for a moment and then disappears. The laptop also seems extremely hot this morning. I am going to return this at this point. The last thing I saw was several WiFi networks (when it did work) that were setup by company which tells me this is not a new laptop (which it was suppose to be) but a refurbished one."
            },
            {
                "source": "main",
                "review_id": "R2TOHHSTG915WW",
                "reviewer": "Happy Designer",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Great laptop",
                "review_date": "Reviewed in the United States on February 17, 2025",
                "review_text": "Work great"
            },
            {
                "source": "main",
                "review_id": "R24FYR2ASMSM2G",
                "reviewer": "Hannah Celine",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great Battery life works well!",
                "review_date": "Reviewed in the United States on January 2, 2025",
                "review_text": "Love the screen quality, battery life and ram storage! I edit videos so the speed is necessary! The touch screen is good too but I don't use it often"
            },
            {
                "source": "main",
                "review_id": "R1WHDKQX33P3NC",
                "reviewer": "MOZ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Nice fast laptop",
                "review_date": "Reviewed in the United States on January 9, 2025",
                "review_text": "So far it's been exactly as advertised - 32 gb of ram, 12th gen i7, touchscreen, etc. All for only $600. Great deal & so far I love it! Will update if there is anything to report down the line."
            },
            {
                "source": "main",
                "review_id": "R3MWUGHABDU2CZ",
                "reviewer": "Kindle Customer",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars What I wanted",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "I'm enjoying this product."
            },
            {
                "source": "main",
                "review_id": "R3T4STD9F6YHB0",
                "reviewer": "Gary J Pasewark",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars \"buyer be aware\"",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "The Dell Computer is good, but the company selling on Amazon got low end machines and added third party memory, disk, etc.  The memory failed in first month.  Sent for repair to Dell who rightly said no warranty due to selling company modes. Fixed myself.  Dell computer is good, company selling on Amazon is bad.  Review is for Company not computer. I expected a warrantied system.  Another case of \" let the buyer to aware\""
            },
            {
                "source": "main",
                "review_id": "R6UDUM0BKI1FZ",
                "reviewer": "New Hampshire USA.",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars my mac air",
                "review_date": "Reviewed in the United States on March 3, 2025",
                "review_text": "Nice computer, but too difficult for an 81-year-old man to set up."
            },
            {
                "source": "main",
                "review_id": "R17SK5HZZWL81D",
                "reviewer": "M. R. H",
                "rating": "4.0 out of 5 stars",
                "review_title": "4.0 out of 5 stars Good Basic Windows 11 machine",
                "review_date": "Reviewed in the United States on January 18, 2025",
                "review_text": "This is a Good Basic Dell computer but One thing I overlooked when I bought it, it didn't have a lighted Keyboard. So I designed my own way to light up the keyboard. I bought a Clip-on LED Book Light from Amazon and adapted it to fit the Laptop as in the picture. It was only $8.00 and solved my minor problem."
            },
            {
                "source": "main",
                "review_id": "R1M46D2M012CBO",
                "reviewer": "Kimberly Rogers",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Super Happy with this laptop",
                "review_date": "Reviewed in the United States on February 2, 2025",
                "review_text": "This has been perfect for me.  I use it for social media, writing in Word, online shopping, email, etc.  Has been wonderful.  Light weight for travel and big screen.  I love it."
            },
            {
                "source": "main",
                "review_id": "R22SCZ9970H42P",
                "reviewer": "Nixxz",
                "rating": "3.0 out of 5 stars",
                "review_title": "3.0 out of 5 stars It gets the job done nothing fancy!",
                "review_date": "Reviewed in the United States on January 2, 2025",
                "review_text": "I'm not particularly impressed with the build quality of this laptop—it feels cheaply made, and the design seems a bit outdated, especially with the inclusion of a USB 2.0 Type-A port instead of a Type-C. However, in terms of performance and specs, it's been fine so far, though I have noticed that the screen becomes a little dull when multiple tabs are open. My biggest disappointment is that I was under the impression it had a backlit keyboard, which was an important feature for me. I'm not returning it, though, since I'm based in the Caribbean, and the shipping process would be too much of a hassle."
            },
            {
                "source": "main",
                "review_id": "R1BSRJ0GN79CEN",
                "reviewer": "catman",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars laptop",
                "review_date": "Reviewed in the United States on February 20, 2025",
                "review_text": "first time with touchscreen,i like it."
            },
            {
                "source": "main",
                "review_id": "R8S0SIFKQ9IIC",
                "reviewer": "Wayne Gushard",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Delivered ahead of schedule",
                "review_date": "Reviewed in the United States on February 15, 2025",
                "review_text": "Product works well."
            },
            {
                "source": "main",
                "review_id": "R1N0KGEK4PWXOJ",
                "reviewer": "L. Cassidy",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Dell Inspiron 3520 15.6\" Touchscreen i7 Laptop",
                "review_date": "Reviewed in the United States on January 19, 2025",
                "review_text": "The Dell Inspiron 3520 15.6\" Touchscreen i7 Laptop is excellent. I strongly recommend it to anyone seeking a fast computer processor and an exceptionally lightweight and easy-to-handle laptop."
            },
            {
                "source": "main",
                "review_id": "R2Q4HOVNGEFD0R",
                "reviewer": "Bob",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars So far, so good.",
                "review_date": "Reviewed in the United States on January 15, 2025",
                "review_text": "Using the purchased computer to write this review. So far, so good (have only had the computer for a week)."
            },
            {
                "source": "main",
                "review_id": "R1TNR31LDU9CVU",
                "reviewer": "Me encantó ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Muy buena",
                "review_date": "Reviewed in the United States on January 27, 2025",
                "review_text": "Me gustó"
            },
            {
                "source": "main",
                "review_id": "R3CUHW97Q7FQQH",
                "reviewer": "Steve",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars great product",
                "review_date": "Reviewed in the United States on January 17, 2025",
                "review_text": "my wife loves her new laptop"
            },
            {
                "source": "main",
                "review_id": "R2E8XYESL52TEE",
                "reviewer": "Roy Sanchez Valerio",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Buena computadora",
                "review_date": "Reviewed in the United States on January 9, 2025",
                "review_text": "Computadora rápida y a un buen precio, la recomiendo"
            },
            {
                "source": "main",
                "review_id": "R31AV7BH78JFAW",
                "reviewer": "Enmanuel Reyes ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Excellente",
                "review_date": "Reviewed in the United States on January 1, 2025",
                "review_text": "Me gustó, llegó a tiempo buen servicio"
            },
            {
                "source": "main",
                "review_id": "R28YTEMILXI9WC",
                "reviewer": "crystal lilys",
                "rating": "2.0 out of 5 stars",
                "review_title": "2.0 out of 5 stars battery life is very bad",
                "review_date": "Reviewed in the United States on February 14, 2025",
                "review_text": "the life of the battery won’t last long"
            },
            {
                "source": "main",
                "review_id": "R183YD4KQ239S6",
                "reviewer": "Cheryl",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Good quality",
                "review_date": "Reviewed in the United States on November 18, 2024",
                "review_text": "Good upgrade from my seven year old windows 10 laptop."
            },
            {
                "source": "main",
                "review_id": "R3A1K4E1LJ1RBK",
                "reviewer": "Christopher",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Producto defectuoso",
                "review_date": "Reviewed in the United States on February 25, 2025",
                "review_text": "Producto defectuoso! He tenido problemas desde que lo recibí, utilice los recursos de soporte en línea de Dell esperando que mejorará pero aun así la laptop sigue dando problemas de \"pantallazo azul\". Se apaga y reinicia de repente si previo aviso. Ya realice el reporte por medio de Amazon sin embargo espero que el vendedor me contacte para encontrar una solución."
            },
            {
                "source": "main",
                "review_id": "R3N9HZD6VFUBXY",
                "reviewer": "Auriperalta",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Me encanta",
                "review_date": "Reviewed in the United States on October 10, 2024",
                "review_text": "Excelente laptop, muy contenta con ella"
            },
            {
                "source": "main",
                "review_id": "R2495YIFXOYDU",
                "reviewer": "Elias Robinson Perozo",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Mala calidad del producto Laptop Dell Inspiron 15 3520",
                "review_date": "Reviewed in the United States on March 4, 2025",
                "review_text": "El comprar este producto fue un fiasco, la computadora viene con el Windows 11 home instalado y tiene un problema, ya que hay actualizaciones de Windows que no se realizan y siempre dan un error de instalación, no recomiendo este producto para nada"
            },
            {
                "source": "main",
                "review_id": "R1EUSZV0VHA6ZQ",
                "reviewer": "Bette Bond",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Computer did not work",
                "review_date": "Reviewed in the United States on January 7, 2025",
                "review_text": "The computer did not work...even for 5 minutes.  I am returning this computer and will never buy a computer via Amazon again."
            },
            {
                "source": "main",
                "review_id": "RBP8OT7HIKJ0E",
                "reviewer": "Martha Gurka",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Dell Laptop",
                "review_date": "Reviewed in the United States on January 7, 2025",
                "review_text": "I could not get the keyboard to work.  It was frustrating."
            },
            {
                "source": "main",
                "review_id": "RLVDTU93D9DV3",
                "reviewer": "Amazon Customer",
                "rating": "1.0 out of 5 stars",
                "review_title": "1.0 out of 5 stars Very slow",
                "review_date": "Reviewed in the United States on January 21, 2025",
                "review_text": "Runs very slow"
            },
            {
                "source": "main",
                "review_id": "R3CAAR7KE9JKV",
                "reviewer": "Saul Arroyo Alfaro",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Buena compra",
                "review_date": "Reviewed in the United States on November 19, 2024",
                "review_text": "Me ha sido útil"
            },
            {
                "source": "main",
                "review_id": "R3LJUUQBYIFD4J",
                "reviewer": "Petty Patti ",
                "rating": "5.0 out of 5 stars",
                "review_title": "5.0 out of 5 stars Great",
                "review_date": "Reviewed in the United States on July 27, 2024",
                "review_text": "Happy"
            }
        ]
    }
]