{
    "title": "HP Stream 14\" HD BrightView Laptop, Intel Celeron N4120, 16GB RAM, 288GB Storage (128GB eMMC + 160GB Docking Station Set), Intel UHD Graphics, 720p Webcam, Wi-Fi, 1 Year Office 365, Win 11 S, Gold",
    "average_rating": "4.2 out of 5 stars",
    "review_count": "2,340 global ratings",
    "histogram": {
        "5_star": "67%",
        "4_star": "14%",
        "3_star": "7%",
        "2_star": "3%",
        "1_star": "9%"
    },
    "review": [
        {
            "source": "main",
            "review_id": "RY264XMWOEHEO",
            "reviewer": "A. Smieja",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Nice little laptop for the money",
            "review_date": "Reviewed in the United States on February 19, 2025",
            "review_text": "I've had it now for a while but just started using it full time.  Great little laptop and very lightweight.  The only thing I've noticed is that the left-hand shift key has gotten stuck a few times and all my letters stay upper case.  Battery life has been awesome so far, but all laptops start out that way.  We'll see."
        },
        {
            "source": "main",
            "review_id": "R2NV8JUJUB1KXZ",
            "reviewer": "Anamarie",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Amazing quality!",
            "review_date": "Reviewed in the United States on January 29, 2025",
            "review_text": "Came in perfect condition, the screen is very clear, the sound is great, it’s quite fast and does not lag, the size is perfect for working at home and at school, definitely worth every penny! Quite slim and not too heavy either! If you’re looking for a good quality and affordable laptop, this one would be perfect!!"
        },
        {
            "source": "main",
            "review_id": "R182BAPH644F1F",
            "reviewer": "rick ellen mcintyre",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars cheap and works great",
            "review_date": "Reviewed in the United States on November 18, 2024",
            "review_text": "list of reasons why this deserves 5 stars. 1. looks cool.  it looks like carbon fiber. 2. it's really fast.  don't know if it's because of the 16 gigs of ram or the 4 core processor but  it's really quick. 3. the price.  this cost a little more than a notebook and you get a lot for it. 4. all the connections i needed. .  hdmi for a second monitor ,  high speed 3.0 usb's to run my interface and a 3.0 usb-c. 5. the hotface usb hard disc and power hub are really handy.  thanks for the great deal"
        },
        {
            "source": "main",
            "review_id": "R2GBE1TCJY8Y1C",
            "reviewer": "MelloPi",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Reset PC, Switch out of S Mode, Do Not Install McAfee",
            "review_date": "Reviewed in the United States on May 25, 2024",
            "review_text": "Windows S Mode and McAfee are glitchy performance killers and restrictive applications.  Switching out of Win 11 S mode should be a straight forward process but it just does not work as it should, along with McAfee installed, whether you want it or not.  McAfee acts like a worm virus, intrusively imbedding itself deep into system architecture instead of being a gate keeper like other anti-virus apps.  Windows S Mode dose not allow you to install and run any app that is not Microsoft verified and found on the Microsoft Store.  In S Mode, you cannot install and run any browser other than MS Edge or Bing.  There is an app within the MS Store to switch out of S mode but it will not work because, I suspect, of the bloated software that launches when you first turn on and set up this laptop.  Switching out of S Mode is permanent.  All the advise and direction I found to get this switch to work had failed.  Lots of frustrated people out there with the same issue.  I finally got MS Support on the phone and they told me this is a very common problem with this product and the only way to resolve it was to reset the PC.  A total reset, wiping the OS and all files you may have added.  No big deal as this is a new PC and I did not transfer anything from my old PC.  After the PC was reset, I was able to switch out of S mode so that I now have Win 11 Home instead of Win 11S Home.  At the same time, a McAfee install popup was automatically prompted so I could select Do Not Install.  This was all a bit of a pain but other than that, this laptop is not so bad.  The display colors are not as vibrant as I hoped but with a resolution of only 1365 x 768, I should have expected that.  However, the graphics display very well on a connected higher resolution monitor and it handles steaming video from Amazon Prime Video beautifully.  I hope this information can help someone avoid the frustration of dealing with what was intentionally sold as a very restrictive operating environment.  Getting rid of S Mode and McAfee gives you back unrestricted use of your laptop. One more annoying detail is that, by default, this operating environment is set to save everything to the MS cloud. The default storage of Document, Downloads, Pictures, etcetera, are all MS cloud folders which is where every file is stored unless you go through a few more clicks to store the files on your local laptop drive.  By default, initially you cannot even boot up this laptop without entering your MS PIN to log onto your laptop, and thereby logging into your MS account at the same time.  I found this a bit presumptuous that MS thought this was a good idea.  Perhaps good for their own marketing efforts though, as some bot scans your files for things you do in order to tailor marketing ad pushes to you personally, but I digress.  If you do not want Big Brother holding on to all your personal, professional, private, or other data, then you need to go in to system settings and turn off the MS log in PIN.  Doing so allows you to boot up your laptop to your local drive account only.  You can always log in and log out of your MS account if and when you choose at any time.  Of course, you can even turn off your own laptop log in password so it just simply turns on. without a password.  Your choice, as it should be."
        },
        {
            "source": "main",
            "review_id": "R2KJVKXMCQ94HE",
            "reviewer": "Liam",
            "rating": "1.0 out of 5 stars",
            "review_title": "1.0 out of 5 stars Defective on day one of setup; edit: returned",
            "review_date": "Reviewed in the United States on December 14, 2024",
            "review_text": "Mine just came in yesterday and I have started the process of setting it up today (only 2 days); I’ve downloaded Google Chrome and a reputable subscription based VPN app (S mode was deactivated for the purpose of downloading Chrome). After downloading those two, I set up 2 administrator users and one standard user. In the process of setting up the other administrator user: the laptop crashed and the screen turned black. I’ve tried hard resetting and am leaving it to charge overnight. My intended use was for education for when I’m not at home (I have a desktop and obviously no one is going to bring a whole tower to every class they go to) so I wasn’t planning to use anything fancy — word and chrome. In terms of performance before it crashed: 1) CPU was at 100% and was still slow when opening up apps (I wasn’t far from my main mesh router and my actual desktop works fine so can’t be internet problem) 2) It made me do a recovery startup when I first unpackaged and logged into my microsoft acccount and the startup took about 20 minutes 3) Breeze it up — it felt warm on the bottom after an hour Thinking about returning it if the laptop still doesn’t turn on (I’ve tried 2 different outlets in 2 different rooms — [wall plug] and [my extender that has anker charger and an air purifier plugged in]) tmr afternoon). Edit: I’m returning it and getting a refund; had it plugged in for a couple of days now and have been attempting to turn it on daily — no success; laptop still does not turn on"
        },
        {
            "source": "main",
            "review_id": "R3TJYTSIUR1WP6",
            "reviewer": "KKN",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Perfect for my needs.  WP/Web browser",
            "review_date": "Reviewed in the United States on January 29, 2025",
            "review_text": "This is what I was looking for.  Price point, simple, compact, decent speed.  I use HP at home and at work for 20ish years.  Only had one hardware issue in all those years which was covered by warranty.  All else was replaced due to age."
        },
        {
            "source": "main",
            "review_id": "R1IUGSKGCDAPJE",
            "reviewer": "Quiana Harvey",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Love the Color",
            "review_date": "Reviewed in the United States on February 1, 2025",
            "review_text": "I love this laptop very easy to navigate, and understand great software package included"
        },
        {
            "source": "main",
            "review_id": "R1H9PW7LXW5G97",
            "reviewer": "Vincent",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Works great!",
            "review_date": "Reviewed in the United States on February 11, 2025",
            "review_text": "Came in great condition! Everything came as advertised. Have had no issues with working on the laptop. Great price for a great laptop."
        },
        {
            "source": "main",
            "review_id": "R3JNZ3G53OI9UO",
            "reviewer": "Leighton ",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars GREAT PRODUCT!",
            "review_date": "Reviewed in the United States on February 21, 2025",
            "review_text": "The HP Stream 14\" Laptop is a solid option if you need a basic laptop for light use. It offers excellent value for the price, especially with 16GB of RAM and 288GB of storage. However, if you need more power for intensive tasks, you may want to consider a more powerful machine. It’s a great choice for students or anyone looking for a low-cost, everyday laptop."
        },
        {
            "source": "main",
            "review_id": "R37DXKKVDRGIHI",
            "reviewer": "Billie Jo",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars 100/10 Recommend",
            "review_date": "Reviewed in the United States on February 8, 2025",
            "review_text": "This thing is a beast for the price! Even though I haven’t used the SD card adapter (I cannot figure it out for the life of me), the speed and battery life are amazing! I’m able to comfortably run the Sims 3 as well as have an open browser and music playing with little to no issues. I got it 20% off but I wouldn’t hesitate to pay full price knowing what I do now."
        },
        {
            "source": "main",
            "review_id": "R1OHDFYFXESSD8",
            "reviewer": "Chess player 23",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Interesting",
            "review_date": "Reviewed in the United States on January 4, 2025",
            "review_text": "The package for the laptop was very well done. To my surprise it came with extra storage which was nice. For the price of the laptop it is nice, I will add that it is a bit laggy but this laptop is perfect when it's on sale. The sound quality is pretty much the same as a phone. Setup is pretty basic for any other laptop. There is a bit of slackness and latency."
        },
        {
            "source": "main",
            "review_id": "RCL4KPDQATCS8",
            "reviewer": "Samantha S.",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Great laptop for work or school..",
            "review_date": "Reviewed in the United States on January 21, 2025",
            "review_text": "If you're looking for something that runs fast and is easy to carry around, this is it. As far as gaming or anything that requires more memory - definitely look for a proper gaming PC."
        },
        {
            "source": "main",
            "review_id": "R3331BBEYWRL8Z",
            "reviewer": "Randy",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Works fine.",
            "review_date": "Reviewed in the United States on January 22, 2025",
            "review_text": "A little smaller screen than I'm used to All my old software loaded using a USB dvd drive.  Great seller"
        },
        {
            "source": "main",
            "review_id": "RCFZPWMHEEOWW",
            "reviewer": "Ryan Sheets",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Inexpensive",
            "review_date": "Reviewed in the United States on February 25, 2025",
            "review_text": "Arrived quickly and as advertised.  Solid laptop for someone who just streams movies"
        },
        {
            "source": "main",
            "review_id": "RJF7CSEI4Y8RN",
            "reviewer": "ChaLita",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Flexible device",
            "review_date": "Reviewed in the United States on January 14, 2025",
            "review_text": "I can use it for multiple tasks, work and school. The only thing missing is it's not touch-screen. Great for the price!"
        },
        {
            "source": "main",
            "review_id": "R324KM5TUOI1DE",
            "reviewer": "Fred Gowans",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Quality",
            "review_date": "Reviewed in the United States on January 27, 2025",
            "review_text": "I 've used HP products for several years, because they're reliable, and durable. My first Laptop I use for College 25 years ago. Even I was able to continue to use after I finish college.  Great computer."
        },
        {
            "source": "main",
            "review_id": "RZ017TFQ3XVT1",
            "reviewer": "Ernesto Cuellar",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Buen products",
            "review_date": "Reviewed in the United States on February 19, 2025",
            "review_text": "Buena"
        },
        {
            "source": "main",
            "review_id": "R1B7XTCMVCMZX7",
            "reviewer": "Aimee",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Love it",
            "review_date": "Reviewed in the United States on February 3, 2025",
            "review_text": "This is my first laptop. I love it. It purchased it to work from home. I absolutely love it"
        },
        {
            "source": "main",
            "review_id": "R7MIF7ZXJ4D8B",
            "reviewer": "Lisa",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars I like this laptop",
            "review_date": "Reviewed in the United States on February 6, 2025",
            "review_text": "Easy to set up. Comes with Office tools. Lightweight. Value for money."
        },
        {
            "source": "main",
            "review_id": "R2P2O4UQO1QEGP",
            "reviewer": "An enlightened customer",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars Pro-tip: Disable Copilot",
            "review_date": "Reviewed in the United States on February 15, 2025",
            "review_text": "I initially wrote a scathing review of this laptop because without even having done anything with it, it was incredibly sluggish, embarrassingly slow and terribly frustrating to use. Turns out after uninstalling Microsoft Copilot EVERYTHING sped up amazingly! I'll keep at 3 stars after using for a few days to confirm, but that seems to have been the trick to make this machine with its somewhat limited resources work much, much better. Stay tuned, folks."
        },
        {
            "source": "main",
            "review_id": "R1K8VTHWXEN5X4",
            "reviewer": "rick",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Nice laptop",
            "review_date": "Reviewed in the United States on February 5, 2025",
            "review_text": "This is a nice beginner laptop that's priced right!"
        },
        {
            "source": "main",
            "review_id": "RU6P8SHLZC3MP",
            "reviewer": "Matthew",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Greatness",
            "review_date": "Reviewed in the United States on February 1, 2025",
            "review_text": "It works great and is everything I need."
        },
        {
            "source": "main",
            "review_id": "R1NG25MPCN2FRU",
            "reviewer": "Villalobos ",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars Se siente de gama MÁS BAJA de lo que es. A pesar de tener 16 GB de RAM",
            "review_date": "Reviewed in the United States on February 16, 2025",
            "review_text": "He tenido laptops más baratas que esta, pero no sé traban tanto como esta. Realmente es muy lenta, se traba. A veces solo iniciando, cuándo quiero ingresar mi pin para acceder se traba. Vuelvo y repito he tenía otras de gama más baja y no me daban ese problema."
        },
        {
            "source": "main",
            "review_id": "R2M8YQRYQ165BA",
            "reviewer": "ImMKPS",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars Just ok",
            "review_date": "Reviewed in the United States on February 22, 2025",
            "review_text": "Was expecting more speed from a new computer. File Explorer is disappointingly slow… Still faster than my Asus from 2016 that had gotten super slow, but definitely was hoping for more. Did not meet my expectations."
        },
        {
            "source": "main",
            "review_id": "RJOFFEWHZ57MQ",
            "reviewer": "Jennifer",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars Works well, but the memory is an issue",
            "review_date": "Reviewed in the United States on January 1, 2025",
            "review_text": "The media could not be loaded. We have been using this laptop for about a month for my daughter's homeschool.  Thus far, we have had no issues with the basic processes of the device.  However, I am confused as to why the laptop was listed as having more memory than it actually does. There is a detachable item with the laptop (that I haven't even been able to get to work) and they included this item in their estimation.  But it doesn't actually add any memory to the laptop.  Additionally, I don't know how to use it, it won't turn on even when connected to the laptop, etc.  If I had the choice again, I would have purchased a more robust laptop for the same price but without this adapter/port thing. Lesson learned."
        },
        {
            "source": "main",
            "review_id": "RXTDKTTRB4K19",
            "reviewer": "Tracy Davis",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Great for students or work!",
            "review_date": "Reviewed in the United States on January 29, 2025",
            "review_text": "Great laptop for students or work!!!"
        },
        {
            "source": "main",
            "review_id": "R2WNUBDOT7VINU",
            "reviewer": "Becky Jane",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars great little laptop!!",
            "review_date": "Reviewed in the United States on December 15, 2024",
            "review_text": "Ive always had a desktop. when the hurricane took my house i needed something to be able to send the documents to the insurance and take care of all the paperwork. I had no idea the difference between my desktop and a laptop. this item has surpassed my expectations, and comes with a year of office 365 is an added bonus, has everything i need to fill out all the documents and spreadsheets. so happy i chose this one!!"
        },
        {
            "source": "main",
            "review_id": "R2QKSQHF8X6PA7",
            "reviewer": "Mise ",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars I'm obsessed with this laptop",
            "review_date": "Reviewed in the United States on December 27, 2024",
            "review_text": "Excellent laptop! The start-up process was easy. The keyboard responded well, except there was no backlight on the keyboard. Because of this, I had to return it. Await for my refund. Hopefully, I can get another one with backlight and everything else aside from this laptop, and the deal was truly an awesome deal."
        },
        {
            "source": "main",
            "review_id": "RK494358WNGQ3",
            "reviewer": "Laura johanneson",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Excelente me encanto",
            "review_date": "Reviewed in the United States on January 24, 2025",
            "review_text": "Excelente en tiempo rápido una belleza"
        },
        {
            "source": "main",
            "review_id": "RT9KRTBMCTUGW",
            "reviewer": "sarah cannon",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Worth the money",
            "review_date": "Reviewed in the United States on January 14, 2025",
            "review_text": "I bought two of these for my daughters in college and they do everything they need. Definitely worth the money!"
        },
        {
            "source": "main",
            "review_id": "R3GGV0EN39EG8Z",
            "reviewer": "Bryan Brusaw",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars HP",
            "review_date": "Reviewed in the United States on January 28, 2025",
            "review_text": "Wonderful computer"
        },
        {
            "source": "main",
            "review_id": "R3KJKI8OB8YZNU",
            "reviewer": "Nice",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Cant play roblox, cheap but powerful pc",
            "review_date": "Reviewed in the United States on December 5, 2024",
            "review_text": "I recently purchased this HP Stream 14\" HD BrightView Laptop. I was disappointed with its performance. I think it's better to spend a little more money and get a better computer. You cant even play simple games like roblox, the material feels cheap and looks cheap. The resolution is bad, but for just work it's pretty powerful. Just make sure to turn off S mode. I wouldn't buy this if I were you. Unless its strictly for work. I also suggest getting a refurbished Mac air 2013 , old but runs better and looks better than this."
        },
        {
            "source": "main",
            "review_id": "R20BUHVGZ5FMKV",
            "reviewer": "Eric L",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Great laptop",
            "review_date": "Reviewed in the United States on December 29, 2024",
            "review_text": "Christmas gift to my son,  and he told me it's more than he needs,  as he's watching a video,  while uploading character specs to a DnD website,  while he's playing a game. Excellent for teens at a great price"
        },
        {
            "source": "main",
            "review_id": "R1KEI5PFK1PBKA",
            "reviewer": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars It surprised me.",
            "review_date": "Reviewed in the United States on August 27, 2024",
            "review_text": "I was really nervous about buy this laptop. Setup was easy. It transferred all my stuff over from my last computer. When I first opened it, I looked it over and everything looked good. No dents or marks. It has done the job of lasting all day. I use my flash drive to store a lot of stuff so I don’t put a lot on the computer. I got the 16GB of RAM and it’s been fast for the office or school work I have to do."
        },
        {
            "source": "main",
            "review_id": "R2WKQKX8IAPK8K",
            "reviewer": "M. Wetmore",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Nice Laptop -  Horrible Windows 11 S",
            "review_date": "Reviewed in the United States on June 8, 2024",
            "review_text": "The laptop is fast and seems to work very well.  My only complaint is that it came loaded with Windows 11 S.  What this does is make it so you can't load any apps on the computer that aren't in Microsoft's Store.  Just another power grab on the part of Microsoft.  You are supposed to be able to go to System-->Activation and go to the Microsoft store to get out of 'S' mode, but it didn't work for me.  After much research I came across a suggestion to 'Reset' the laptop.  I did this (it takes a very long time) and when it was reset I could go to the Microsoft Store to get out of 'S' mode, and this time it worked."
        },
        {
            "source": "main",
            "review_id": "R2AWEWP52AQRYQ",
            "reviewer": "saida Granados",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Good for the price",
            "review_date": "Reviewed in the United States on January 17, 2025",
            "review_text": "Good price for simple tastk."
        },
        {
            "source": "main",
            "review_id": "R2S5Q6CD9G3YTS",
            "reviewer": "Jess",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars It’s alright ig",
            "review_date": "Reviewed in the United States on December 6, 2024",
            "review_text": "For 250$ I wasn’t expecting much and definitely didn’t get much. Out of the box, the laptop was kinda slow and laggy. I took it out of S mode and did all of the updates and it’s running a little better. It took about two hours to install all the updates. The computer is very hot and I don’t think the battery life is that great (started on 75, now on 52). It works for what I need it to work for but I kinda wish I spent a little more and got a better one."
        },
        {
            "source": "main",
            "review_id": "R1AEVB9KXO5GAR",
            "reviewer": "Dana Galima",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Great value for price",
            "review_date": "Reviewed in the United States on December 31, 2024",
            "review_text": "Great quality lap top for price. Works well. Husband likes it for making videos and editing things. Internet speed is quick. Great battery life. Light weight. Perfect simple laptop."
        },
        {
            "source": "main",
            "review_id": "R3BDN3EIIP46ZY",
            "reviewer": "Richard E Ariza",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars NICE LAPTOP FOR UNEXPERIENCED USERS",
            "review_date": "Reviewed in the United States on January 15, 2025",
            "review_text": "PURCHASED FOR A FRIEND"
        },
        {
            "source": "main",
            "review_id": "R32WZDPX8MP9F9",
            "reviewer": "Exactly as described on Amazon works perfectly great quality in product and pictures.",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars High school",
            "review_date": "Reviewed in the United States on October 14, 2024",
            "review_text": "Bought it for my oldest teen for school work and she has no complaints."
        },
        {
            "source": "main",
            "review_id": "R3P3VQ268AW5A3",
            "reviewer": "wendy madru",
            "rating": "4.0 out of 5 stars",
            "review_title": "4.0 out of 5 stars Good product",
            "review_date": "Reviewed in the United States on October 17, 2024",
            "review_text": "Bought for my granddaughter she uses it daily and loves it!"
        },
        {
            "source": "main",
            "review_id": "R3L26KXZKQ4GC8",
            "reviewer": "Emjadoze",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Muy bueno",
            "review_date": "Reviewed in the United States on January 15, 2025",
            "review_text": "Muy bueno"
        },
        {
            "source": "main",
            "review_id": "R308P8QO2EGLOZ",
            "reviewer": "mopo ",
            "rating": "2.0 out of 5 stars",
            "review_title": "2.0 out of 5 stars I wouldn’t but it again",
            "review_date": "Reviewed in the United States on February 22, 2025",
            "review_text": "I’m not sure if this issue is unique to my lemon of a laptop, because I’ve had multiple $300 computers that were better than this one. The light is SO DULL, it looks like it’s on battery saving mode when at full brightness. The battery lasts a while but takes forever to charge. The worst thing about the computer: it won’t stay connected to the internet. The only reason I have a laptop is to stream shows. Not only is it constantly disconnecting from the internet, it will simply stop showing available networks and I’m forced to restart it so it will show available wifi networks. I got the “bigger/better” storage version since my last 11” laptop is now the same price as this one. I wish I would have just got the same HP I did last time. I am not enjoying this product."
        },
        {
            "source": "main",
            "review_id": "R2JLV1DGG4C8IN",
            "reviewer": "CW",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars Slow",
            "review_date": "Reviewed in the United States on February 1, 2025",
            "review_text": "Super slow but works, using for writing papers."
        },
        {
            "source": "main",
            "review_id": "R2IF22XWK7YDR2",
            "reviewer": "English L. Eaves",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars Not great. But it works.",
            "review_date": "Reviewed in the United States on October 7, 2024",
            "review_text": "It's affordable. And it works. So, there's that. But, this thing struggles if I have YouTube open to listen to music, Google Docs to edit a manuscript, and Google search engine for research. And I mean STRUGGLES. Also, you can't do squat on this thing until you setup a Microsoft account. Not a fan of that. Can I not just use the thing I paid for without jumping through hoops? HP products used to be stellar. Now they are not so great. The screen/resolution is lacking. Not good for images at all. My 5 year old ASUS runs circles around this thing. This is my last HP product. The HP printer I bought before this was a piece of junk. The company produces garbage. Go with ASUS. You'll get a much more dependable product."
        },
        {
            "source": "main",
            "review_id": "R3F49TMCDQ2DYG",
            "reviewer": "Kenneth Stuart",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Outstanding laptop for a great price.",
            "review_date": "Reviewed in the United States on December 7, 2024",
            "review_text": "Excellent deal. Easy start up sequencing and optimization procedures. Decent processing speed. Keyboard feels and responds well. Resolution of display is excellent. Impressive deal with 365 free for a year. Great Deal! McAfee was supposed to be free for a year and they are billing after 3 months. Typical McAfee"
        },
        {
            "source": "main",
            "review_id": "R2YSMZZI2PZWQP",
            "reviewer": "Avay Dolberry",
            "rating": "3.0 out of 5 stars",
            "review_title": "3.0 out of 5 stars The color is not Gold",
            "review_date": "Reviewed in the United States on December 9, 2024",
            "review_text": "The color of the laptop depicted is exact...  Because I selected gold, I thought the laptop would be gold,,, it is NOT.  It is rose.  I really hate to send is back because of the color, however, I purchased it for my son who really does not care for the color."
        },
        {
            "source": "main",
            "review_id": "R9U010JLJ3A9E",
            "reviewer": "Luis Ramos Lopez ",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Good thanks you",
            "review_date": "Reviewed in the United States on January 7, 2025",
            "review_text": "Good thanks you"
        },
        {
            "source": "main",
            "review_id": "R3H5D8VLG1QTE4",
            "reviewer": "Jamie Nandory",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars HP Laptop",
            "review_date": "Reviewed in the United States on December 8, 2024",
            "review_text": "Someone had asked about voice typing. Yes, this one has easy to use voice typing. I required some help setting it up and assistance with initial use but now it is easy to use!"
        },
        {
            "source": "main",
            "review_id": "R36CFWKH4LBAG9",
            "reviewer": "John D. Rukavina",
            "rating": "5.0 out of 5 stars",
            "review_title": "5.0 out of 5 stars Excellent laptop",
            "review_date": "Reviewed in the United States on January 5, 2025",
            "review_text": "Quick response; flexible"
        }
    ]
}