[
    {
        "title": "HP Pavilion 15.6\" HD Touchscreen Anti-Glare Laptop, 16GB RAM, 1TB SSD Storage, Intel Core Processor up to 4.1GHz, Up to 11 Hours Long Battery Life, Type-C, HDMI, Windows 11 Home, Silver",
        "product_id": "B0C4G4L53W",
        "price": "$388.86",
        "image_url": "https://m.media-amazon.com/images/I/71aTEZOda0L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Pavilion-Touchscreen-Anti-Glare-Processor/dp/B0C4G4L53W",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "943 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "16%",
            "3_star": "6%",
            "2_star": "3%",
            "1_star": "10%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 2,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "review_text": "The laptop is fast and does everything I have expected from a HP laptop. The price was right on Amazon and the only thing is UPS couldn’t deliver it to my address so I had to drive to a local UPS store to pick it up."
            },
            {
                "review_text": "Fast,durable battery, easy to use,easy set up. Love the touch screen"
            },
            {
                "review_text": "I love this computer is a very good computer"
            },
            {
                "review_text": "10 stars!!!! I've always had HP and apple products. This laptop is a touchscreen and helps with my photo edited for my business. Fast and compact. Highly recommend!!!"
            },
            {
                "review_text": "Works great"
            },
            {
                "review_text": "Great device"
            },
            {
                "review_text": "I have this laptop for a while now and it works perfectly fine, the touch screen is a huge plus for me, for the price it definitely gives value for money. If you are looking for a laptop for school or simple an everyday easy going laptop this is ideal. It’s durable and works well with wifi. I must say I took away one star because the battery doesn’t last long otherwise it’s pretty efficient"
            },
            {
                "review_text": "After a day of use the battery went dead while in sleep mode, when I went to turn it back on it went in to bitlocker recovery mode and would not reload Windows. Idk if that's a windows 11 problem or the computer itself"
            },
            {
                "review_text": "battery only lasts a few hours and not as long as advertised"
            },
            {
                "review_text": "WASTE OF MONEY!! Computer went completely black screened in 11 months. Warranty for 1 year.System was completely removed from laptop while doing class work, sent it to Hp and warranty was voided due to the seller modifying the laptop and adding 1TB when it’s only suppose to come with 256gb. Reached out to Amazon and they said I should receive call from seller which I never did. After seeing everyone else’s reviews I’m sure I won’t get anywhere with them and not willing to pay a $200 bs restocking fee! Hubby is a computer wiz luckily (I should’ve let him look at it first but wanted to use my warranty).These computers are refurbished, all the parts are from HP EXCEPT for the 1TB Hard drive, which is made from Kingston. Did some research and a 1TB drive is only $60 (I would purchase a different brand than Kingston since it’s the cheapest, you get what you pay for).YouTube how to open and replace the hard drive (easy af)  and do it yourself. But this company seems to make sure these laptops only last but a year which is terrible for people using their last to buy the price of crap , trying to get through school/work etc. Smh. BUYER BEWAREI brought the Samsung 990 Evo Plus 1TB hard drive from Amazon for $70 and paid an extra $12 for a 2 year warranty .. just installed it and re-installed Windows 11 and EVERYTHING was backed up once I signed back in to Microsoft which makes me extremely happy!! DO NOT send your laptop back to this company, they will only sell it again with a weak/used hard drive for $400 to someone else….It’s cheaper to fix it yourself. :)"
            }
        ]
    },
    {
        "title": "HP 14 Laptop, Intel Celeron N4020, 4 GB RAM, 64 GB Storage, 14-inch Micro-edge HD Display, Windows 11 Home, Thin & Portable, 4K Graphics, One Year of Microsoft 365 (14-dq0040nr, Snowflake White)",
        "product_id": "B0947BJ67M",
        "price": "$177.40",
        "image_url": "https://m.media-amazon.com/images/I/815uX7wkOZS._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Micro-edge-Microsoft-14-dq0040nr-Snowflake/dp/B0947BJ67M",
        "average_rating": "4.1 out of 5 stars",
        "review_count": "2,546 global ratings",
        "histogram": {
            "5_star": "64%",
            "4_star": "13%",
            "3_star": "7%",
            "2_star": "3%",
            "1_star": "13%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 1,
            "3_star": 1,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "review_text": "I got this laptop for use while traveling. Will not use it for demanding software. It's slow. but in the acceptable range. It comes with Windows 11 Home in S mode. S mode limits the software you can use to those available in the Microsoft store. It wouldn't let me use LastPass or Dropbox. It came with Dropbox for S mode, but I couldn't get it to run.I removed S mode - once it's gone it can't be restored - and Dropbox and LastPass ran fine as did Chrome. It took several hours for Dropbox to sync my files, but it did so effectively. Thus, I have access to everything on my hard drive at home. I plugged in a tiny Samsung 256 GB flash drive (it costs $22 on Amazon) into a USB port and now I have far more storage than I'll ever need on this computer. The drive is so small that I'll leave it there for the life of the computer.All the programs I'll need when away from home run on this device. I wouldn't try to use it for gaming, but as a work away-from-home laptop for relatively simple tasks, it does the job at a very affordable price."
            },
            {
                "review_text": "HP 14 Laptop (14-dq0040nr) – Affordable and Portable, but with Some Trade-offs⭐ Rating: 4.0/5 ⭐Pros:✅ Affordable Price – This HP 14 laptop is budget-friendly, making it a great option for students, light users, or those in need of a secondary device.✅ Portable & Lightweight – The thin and lightweight design makes it easy to carry around, ideal for on-the-go use.✅ Decent Display – The 14-inch HD micro-edge display offers clear visuals, though it's not full HD.✅ Windows 11 Home – Comes with the latest OS, which is optimized for modern applications.✅ 1-Year Microsoft 365 Subscription – A great addition for users who rely on Word, Excel, and other Office tools.Cons:❌ Limited Performance – The Intel Celeron N4020 processor is okay for basic tasks like web browsing, email, and document editing, but struggles with multitasking or demanding applications.❌ Only 4GB RAM – The memory is quite low for modern standards, leading to slower performance when multiple tabs or applications are open.❌ Minimal Storage (64GB eMMC) – The storage space is extremely limited, meaning you'll need external storage or cloud solutions for larger files.❌ Not Ideal for Heavy Use – Not recommended for gaming, video editing, or other intensive tasks.❌ No Backlit Keyboard – Typing in low-light conditions can be challenging.Final Verdict:The HP 14 Laptop (14-dq0040nr) is a solid choice for those needing an affordable, portable device for light tasks like browsing, streaming, and office work. However, its limited RAM and storage make it less suitable for power users or heavy multitaskers. If you need a simple laptop for everyday use and don't mind relying on cloud storage, this could be a good pick—but if you need better performance, consider upgrading to a model with more RAM and SSD storage."
            },
            {
                "review_text": "It's a little slow because it don't have a lot of memory after you update everything but we only got it to look things up and do some research so it's worth it"
            },
            {
                "review_text": "Great laptop for the money. Does everything I need and then some. Very fast and responsive to the network. I highly recommend for a medium level lap top."
            },
            {
                "review_text": "It was easy to set up and start using. It only took a few minutes to put my information in and I started using it."
            },
            {
                "review_text": "If you’re looking for an inexpensive laptop… this is the one. Exactly as described . Runs quickly , pretty basic. Does what it needs to ."
            },
            {
                "review_text": "The HP 14 is a great choice for those looking for a basic laptop under $200, but it’s not for gamers, designers, or anyone who does more than the basics on their computer. Most surprisingly, it’s even decent  for streaming video and for cord cutters who can take advantage of the HDMI port to connect to a larger display.The basics:  It comes with Windows 11 Home in S mode, but you can easily switch out of S mode if you need to install additional programs not found on the Microsoft store. I turned it off with 4 minutes of use, so that’s a breeze.  And of course, this laptop features a 14-inch 1920 x 1080 display, an Intel Celeron N4020 processor, and 4GB of RAM.**Here are some of the highlights of the HP 14:*** **Great for basic tasks:** The HP 14 can handle basic tasks such as browsing the web, checking email, and using productivity software, but with only 4GB of RAM, I  experienced some  slowdowns when I had many tabs open in my browser or was running multiple programs at once.* **Long battery life:** The laptop can last up to 6.5 hours on a single charge. I was definitely impressed!* **Comfortable keyboard:** The keyboard is bouncy with a generous click and plenty of room for typing.if you like firmer keyboards, this one may not be your jam.* **SD card slot:** The HP 14 includes an SD card slot, which is a rarity for laptops in this price range.perfect for me,because my trail cam’s card can be emptied daily with ease!* **HDMI port:** as mentioned, this is great  for cord cutters who want to connect to a larger display or projector. My last cheap laptop was twice the price of this one and didn’t have an hdmi or a card reader.**Here are some things to keep in mind:*** **Small touchpad:** The touchpad is small and can be difficult to use.* **Dim screen:** The screen is a bit dim and I found it impossible to use outside no matter how I adjusted the display settings.* **Low storage:** 64GB of storage may not be enough for some users.* **Limited RAM:** 4GB of RAM  limits multitasking capabilities.I don’t know yet if those last two items are upgradable, but I’ll check into it if things get bogged down over the next few weeks!**Overall, the HP 14 is a great laptop for students, casual users, and anyone looking for a basic laptop under $200, especially if you don't plan on running multiple programs at once.  However, if you need a laptop for more demanding tasks, you may want to consider a model with more RAM.**"
            },
            {
                "review_text": "It's a nice laptop but it's soooo slow. If you're going to use it to watch YouTube or write google docs, then this wouldn't be bad but if you want to game, play Roblox or use it for work, probably not the best option at all."
            },
            {
                "review_text": "This is a shockingly terrible computer.  The look and feel is extremely cheap.  The thing felt incredibly flimsy, and the entire keyboard could be pushed in without much effort.  Awkward feeling keyboard feel and layout too.  The screen quality was awful.  If you weren't looking at the exact perfect angle, the screen would appear faded out and the color would change.  It has an extremely narrow range of viewing angles.  I could never adjust my eyes to the color, and photos would look simply terrible.  My Chromebook has vastly superior color rendering, and the screen looks good at a wide range of viewing angles.  The resolution was purported to be 1080, but the pixels seemed very large and most things appeared \"blocky\".  But the worst part of this computer was the performance.  Unbelievably slow!  Web pages would take forever to load, text would come in, and a bunch of white boxes would appear on screen until each image would load.  It is not my connection either, as I ran this computer right next to my Chromebook, which had none of these loading problems.  This computer was so slow that it would literally hang up while I was typing!  I would start to type a sentence, and nothing would happen on screen, then a few seconds later, the words would start to show up.  I closed everything but one web browser to compose an email, and I could not write simple text without the computer lagging behind.  It was beyond terrible to the point I may have just gotten a lemon.  But if this was not a broken machine, it's the worst computer I have ever used.  Returned it less than a week after using, I was fed up!"
            }
        ]
    },
    {
        "title": "HP 15.6\" Business Laptop, Free Microsoft Office 2024 Lifetime License, Copilot AI Chat, HD Touchscreen Display, Intel 6-Core i3-1215U 4.4 GHz, 16GB RAM, 1TB SSD, Long Battery Life, Windows 11 Pro",
        "product_id": "B0CWN27G3V",
        "price": "$403.98",
        "image_url": "https://m.media-amazon.com/images/I/71xEfn8Qi8L._AC_UY218_.jpg",
        "product_url": "https://www.amazon.com/HP-Business-Microsoft-Lifetime-Touchscreen/dp/B0CWN27G3V",
        "average_rating": "4.2 out of 5 stars",
        "review_count": "94 global ratings",
        "histogram": {
            "5_star": "65%",
            "4_star": "16%",
            "3_star": "5%",
            "2_star": "3%",
            "1_star": "11%"
        },
        "histogram_reviews_to_scrape": {
            "5_star": 6,
            "4_star": 2,
            "3_star": 0,
            "2_star": 0,
            "1_star": 1
        },
        "review": [
            {
                "review_text": "I love this computer. It was easy to set up, it came with Microsoft Office installed (make sure to decline the option to buy 365 twice). It’s light but not cheap feeling.  Great value for the money."
            },
            {
                "review_text": "This Laptop was bought for my husband,  we went for it because of the free office.I saw some review that the free Microsoft office didn't come with a license key. But the description on the product site says it comes preinstalled so there is no need for a license key.We set up the Laptop pretty easy, the windows update tool a while but other than that set up was a breeze.If this is your personal Laptop I advise you chose personal, hold off on using your work email until you are done setting up.To get free Microsoft working; When you get to the pary where you are offered free one month 365 you should decline it, it asks you like twice or thrice using different language,  decline it every time. Once you succeed,  it will take you straight to windows and you will find your free Microsoft there and all you have to do is click on word and accept license. (Also this process helps you get off windows s mood) That way you can enjoy your Laptop.Also, if you email is already tied to a 365 account it will be wise to use a neutral email as this may interfer with you getting the decline offer button. (You must use an email to sign into the laptop)I am not sure about battery life and other functionality but so far the Laptop is working fine."
            },
            {
                "review_text": "I am pleased with the quality of this computer. Sturdy, easy to set-up, happy to have Windows 11 pro and Microsoft Office 24 included. Only been using it for a week, so hoping it will continue to work as well as it has so far. Also delivered in just 3 days of ordering. Internet speed is good even with multiple windows open at once. I'm a retiree, so no gaming just email, shopping and research. But very happy with this purchase."
            },
            {
                "review_text": "Just what I was looking for: a light-weight HP laptop that has Microsoft lifetime non-subscription,  upgraded features. I've been satisfactorily using Windows 10 on two 17-inch laptops (an HP and a Lenovo) for several years. But when Microsoft announced not supporting WIN 10 and encouraging the installation of WIN 11, I knew I would have to \"bite the bullet\" and upgrade before I ended up having to buy Windows 11. WIN 11 comes pre-installed. I've become accustomed to using Office suites since the mid-90s (okay, okay I'm now 78).  Free pre-installation of the latest of the non-subscription Office suites (2024) was a big plus when considering the purchase of this new laptop.  I hope I'm all set for the rest of my life.  I was also looking for a laptop that--as I age--I could much more easily carry around the house than I can right now carry my 17-inchers.  (It could also be easier to carry when I pack up other personals if ever notified to evacuate due to fire, wind, or earthquake.) Also, realizing that I didn't necessarily need a 17-inch laptop any longer, I chose a less expensive 15-incher. By the way, validating the pre-installed Office 2019 is easy. Just don't hurry, read everything on the screen as you work toward validation, and you'll be done with that step in four minutes! Watch that you do not install Microsoft 365 'cause you'll have to pay for and subscribe to it. If you don't need it, then Office is truly adequate for you. The legal pre-installed version of Office 2019 is genuine Microsoft software that does not come with a product key and, therefore, it does not need to be registered with Microsoft.  (If you have an online Microsoft account, it's up to you if you want to register the laptop itself.)  One more thing, once you're done with setup process, you'll notice that OneDrive is the default for synchronizing. If you're not familiar with OneDrive, go online to understand what it's for and how it works. Contact the seller via Amazon's communication feature for anything. Just click his name on the right side of the product description page and you'll arrive at the seller's profile with the link for communication in the upper right corner."
            },
            {
                "review_text": "I have only had this laptop for a short time but it is fast, Holds a charge well, the camera for meetings is great and all is good! Good value for the money!"
            },
            {
                "review_text": "Great laptop for the price and it comes with lifetime subscriptions to word, excel, PowerPoint!  Super fast compared to my Acer.  Have only had it set up a few days but love it so far.  Would recommend."
            },
            {
                "review_text": "I purchased three of these laptops (1 for me and 2 for my church) to replace non-upgradeable Windows 10 computers.  The hardware configuration and features makes this a very competent laptop.  Connecting to WiFi and downloading required updates was straightforward.  Following the instructions on the OUTSIDE of the HP box for Office 2024 was confusing.  It said to skip or reject the Office 365 Trial offer which I did.  Clicking on any Office app caused a screen to appear showing Office 365 that asked me to agee to the terms of use.  Not sure if I have Office 2024 or 365, or if they are one in the same."
            },
            {
                "review_text": "It has been so long since I bought a computer, that I did not notice that this portable had no RJ-45 port. When I bought previous computers, that port was an automatic on every computer since it was the only way to connect to the internet.  I bought an adapter to get internet access even thought I do have Wi-FI but I prefer the security of a wired hook-up.  Other than not having that port, this portable has all the features I need since I also bought an Excel software versus paying for 365 every year. Perhaps when I buy my next computer in another 10 years, wireless will be as safe as wired."
            },
            {
                "review_text": "Buyer beware. I purchased this as a “new” computer. First attempt at booting, got timeout error message. Second attempt, error said there was no operating system installed, contact HP. On HP website, was able to see that the computer had less than 10 months warranty. Contacted HP, they asked the size of hard drive. When I told them it was 1TB, they said that serial number machine was not a 1TB machine when it left them in October. I purchased in January. They said Amazon upgraded it and made an error. Bottom line is machine is inoperable. They suggested purchasing from Best Buy or HP directly. This one is going back."
            }
        ]
    }
]